[{"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "The shooting was being handled locally and had no apparent link to terrorism, the FBI said.", "title": "Fired worker kills five and himself in Orlando rampage", "url": "https://www.usatoday.com/story/news/nation/2017/06/05/multiple-deaths-reported-orlando-workplace-shooting-rampage/102511896/", "numberOfLinks": 3, "author": "Wayne T. Price and John Bacon", "publishedAt": "2017-06-05T15:22:18Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/1831365ab0b044cac57cfdb1a16a5a239b413df7/c=0-250-2807-1836&r=x1683&c=3200x1680/local/-/media/2017/06/05/USATODAY/USATODAY/636322557246260586-AP-Florida-Shooting.jpg", "article": "A disgruntled former employee returned to an Orlando RV accessory business and fatally shot five people before killing himself, authorities said.Orange County Sheriff Jerry Demings said the 45-year-old shooter, who had been fired in April, entered the Fiama Inc. building at about 8 a.m. ET and opened fire. Seven people in the building survived the rampage and were providing details of the shootings, Demings said.\"We have no indication that this person is a participant in any type of terror organization,\" Demings said. Demings said the shooter had previously been accused of assaulting a co-worker but not charged. The victim in that case was not among the victims Monday, he said.Otherwise, the man had few prior contacts with police, Demings said.Shelley Adams told WFTV that her sister, Sheila McIntyre, called her from inside the building during the shooting. Adams said McIntyre was in a bathroom when she came out and saw someone down on the floor.“She just kept saying, ‘I’m OK; I’m OK,’” Adams told the TV station. “She just kept saying, ‘My boss is dead; my boss is dead.’”Read more:Shortly after the shooting took place, the sheriff's office tweeted that it was investigating a \"multiple fatality\" shooting at a business headquarters in Orlando. The sheriff's office tweeted \"situation contained.\"\"Now investigating tragic incident & will soon have accurate information,\" the department tweeted.The shooting was being handled locally as workplace violence and had no apparent link to terrorism, an FBI official who was briefed on the matter told USA TODAY. The official requested anonymity because the agency is not leading the investigation.The shooting took place in the city still healing from the Pulse nightclub massacre almost a year ago. In that case, a lone gunman entered the club and shot 49 people to death and wounded several others before he was fatally shot by police.Streets in an industrial area of the city where the shooting occurred Monday were closed, and patrol cars, officers and police dogs swarmed the scene.Gov. Rick Scott issued a statement saying he was briefed by law enforcement \"on this tragic incident.\"“Over the past year, the Orlando community has been challenged like never before,\" Scott said. \"Ann and I are praying for the families who lost loved ones today. I ask all Floridians to pray for the families impacted by this senseless act of violence.\"Contributing: Kevin Johnson", "dateOfCollection": "2017-06-05T15:43:45Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "“A number of people have been detained and are at present being spoken to,” the Metropolitan Police said in a statement.", "title": "Police know identities of London attackers, will release names later", "url": "https://www.usatoday.com/story/news/world/2017/06/05/london-terror-attack-police/102509056/", "numberOfLinks": 15, "author": "Jane Onyanga-Omara", "publishedAt": "2017-06-05T14:29:05Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/06834dd409ebda10cc051c1cfef7a449a43ea872/c=0-130-6523-3815&r=x1683&c=3200x1680/local/-/media/2017/06/05/USATODAY/USATODAY/636322372374117610-AFP-AFP-P996M-91451222.JPG", "article": "LONDON — British authorities know the identities of the three men who killed seven and injured dozens over the weekend, but have not released them yet because of the ongoing investigation, Prime Minister Theresa May said Monday.She said the country must do “more, much more” to fight the \"evil ideology” of Islamist extremism. She said Britain will review its counter-terrorism strategy.More people were detained in east London early Monday in connection with the attack. Counter-terrorism police raided two addresses in the Newham and Barking areas. “A number of people have been detained and are at present being spoken to,” the Metropolitan Police said in a statement.Fabio Lamas, 20, who works at a pub in Borough Market, told NBC he saw the three attackers wearing body armor and brandishing knives before the police arrived.\"I got people to start evacuating inside from our little garden that we have ... and got people to come into the bar and to go into toilets, hide under tables and hide in our cellar where we keep all our stock,\" he said. \"Then I heard shooting and I saw an American guy get shot in the head.\"The U.S. Embassy and the Metropolitan Police didn't immediately confirm the report.The raids came the day after police arrested 12 people in Barking in connection with the rampage. May said Monday that 11 remained in custody and one was released without charge.May said she thought London Mayor Sadiq Khan was doing \"a great job.\" It followed President Trump deriding and misrepresenting Khan's attempt to calm Londoners after the attack.“At least 7 dead and 48 wounded in terror attack and Mayor of London says there is \"no reason to be alarmed!\" Trump tweeted Sunday.  Khan had told Londoners there was no “reason to be alarmed” by an increased police presence, and said of the terrorists, “we will never let them win.”Trump maintained the feud with Khan on Monday, tweeting: \"Pathetic excuse by London Mayor Sadiq Khan who had to think fast on his 'no reason to be alarmed' statement. MSM is working hard to sell it!\"The attackers rammed pedestrians with a van before launching frenzied stabbings in the market. The three assailants were shot dead by police. The Islamic State claimed responsibility for the attack.Police said they knew the identities of the perpetrators, but did not release them. Metropolitan Police Commissioner Cressida Dick told the BBC that police seized a \"huge amount\" of forensic material and evidence from the van and in the raids.Twenty-one of the 48 people injured in the attack remained in critical condition late Sunday.The first victim to be named was Christine Archibald, 30, who worked in a homeless shelter before moving from Canada to Europe to be with her fiancé.\"We grieve the loss of our beautiful, loving daughter and sister. She had room in her heart for everyone and believed strongly that every person was to be valued and respected,\" said her family, who live in Castlegar in British Columbia, in a statement.French Foreign Minister Jean-Yves Le Drian said a French citizen was also killed.The attack came days before a general election Thursday. Campaigning resumed Monday after being suspended by major political parties in the aftermath of the attack. London Bridge train station also reopened.The attack was the third deadly terrorism incident in Britain in less than three months.In a speech in Downing Street Sunday, May called for tougher measures to contain Islamic extremism, saying the assaults are not directly linked, but “terrorism breeds terrorism.”\"It is time to say enough is enough,\" she said.Harun Khan, the secretary general of the Muslim Council of Britain, agreed with May that things must change.\"We are ready to have those difficult conversations, as equal citizens with an equal stake in this fight,\" he said in a statement Monday.\"I am pleased that the Prime Minister is speaking about conversation: it implies that we must listen to one another and work together to be part of a truly United Kingdom.\"On March 22, five people were killed in London after Khalid Masood rammed his car into pedestrians on Westminster Bridge before fatally stabbing a policeman outside Parliament. Masood was shot dead by police.On May 22, Salman Abedi, a British-born suicide bomber, killed 22 people and injured scores of others at an Ariana Grande concert in Manchester in northwestern England. Abedi died at the scene.Grande held a concert in Manchester on Sunday night to aid the victims and their families, drawing tens of thousands of people amid heavy security.A vigil will be held in central London Monday evening to remember the victims of the attack.READ MORE:", "dateOfCollection": "2017-06-05T15:43:45Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Russia's moves could thwart Trump's effwWest in pressuring North Korea over its rogue nuclear program and ballistic missile tests, Russia has increased trade and is improving rail lines to help the hermit nation stay connected to the rest of the worl", "title": "As China pulls trade from North Korea, Russia gets cozy with Kim Jong Un", "url": "https://www.usatoday.com/story/news/world/2017/06/05/russia-boosts-trade-north-korea-china-cuts/102389824/", "numberOfLinks": 5, "author": "Oren Dorell", "publishedAt": "2017-06-05T11:59:11Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/9ab0f7111fadd3bc9eefcca9f5d75bc6bd402eef/c=0-277-2795-1856&r=x1683&c=3200x1680/local/-/media/2017/06/01/USATODAY/USATODAY/636319221332855363-b03-missile-0531.jpg", "article": "As China responds to President Trump's call to pressure North Korea to curb its rogue weapons programs, Russia has stepped in to help the hermit nation stay connected to the rest of the world.Trade between Russia and North Korea increased by 73% during the first two months of 2017 compared to the same period the year before, boosted mostly by increased coal deliveries from Russia, according to Russian state-owned news site Sputnik.China, North Korea's chief political and economic benefactor, said it had curbed coal deliveries to North Korea and taken other steps aimed at persuading North Korean leader Kim Jong Un to halt his nuclear and ballistic missile development programs.In addition to a boost in coal shipments, other moves by Russia to expand commerce with North Korea include:• A Russian company, Investstroytrest, opened a new ferry line in May connecting the Russian port city of Vladivostok to the North Korean city of Rajin. Mikhail Khmel, the company’s deputy director, told Reuters the ferry is aimed at Chinese tourists seeking to visit Vladivostok by sea.• Russian railway officials in January visited North Korea to discuss upgrades to the Rajin-Hasan railway, which links Russia to the Korean peninsula, according to Russia’s state news agency TASS.• Russia and North Korea have reached a labor immigration agreement to expand a program that already employs 40,000 North Korean laborers in Russia’s timber and construction industries, a major source of foreign currency for Kim Jong Un’s government, according to the Japanese newspaper Nihon Keizai.These moves come despite Russia's signing onto recent sanctions by the United Nations Security Council, which call for reducing trade with North Korea in retaliation for two nuclear detonations last year and ongoing tests of ballistic missiles that the North says are aimed at developing a nuclear delivery system that can reach the U.S. mainland.The Security Council issued a unanimous statement on  May 21 that vowed to impose new sanctions on North Korea after it tested yet another long-range missile.Trump is pressing China to use its $6.6 billion in annual trade with North Korea as leverage to crack down on North Korea's weapons development, as China handles 90% of the North's business with the rest of the world. But a larger Russian trade relationship with North Korea could negate some of what China may do, several analysts said.The Russian trade activity fits into Russia's thinking about North Korea, said James Brown, an associate professor at Temple University’s Tokyo campus.“They don’t want to isolate North Korea. They want to enable North Korea to be able to continue to conduct activities with the rest of the world,” Brown said. “They’re against the North Korean nuclear program. ... But the Russians also are more sympathetic toward North Korea.”Russian President Vladimir Putin said on May 1  that North Korea's recent missile launch was \"dangerous,” and that Russia is “categorically against the expansion of the club of nuclear states,” according to Sputnik. But he also appeared to criticize U.S. policy toward North Korea, marked by U.S. military exercises near the Korean peninsula and belligerent threats from both Trump and Kim.“We need to return to dialogue with the Democratic People's Republic of Korea, stop intimidating it and find ways to solve these problems peacefully,” Putin said.Aircraft sit on the flight deck of the aircraft carrier USS Carl Vinson June 1, 2017, in the western Pacific. The Japan Maritime Self-Defense Force and U.S. Navy routinely train together to improve interoperability and readiness in the Indo-Asia Pacific region. (Photo: Spc. 2nd Class Z.A. Landers, AP)Putin believes North Korea takes provocative steps, “but that it’s forced to act in that way because of aggressive actions by South Korea and the United States, by having exercises and military drills and sending the aircraft carrier and those type of things,” Brown said.Chinese officials have warned they would consider halting crude oil deliveries to North Korea if it engages in more nuclear or long-range missile tests, according to China’s state-run Huanqiu newspaper.Regular oil tanker ship traffic between Russia and North Korea, and the rail line that is being repaired, are evidence that Russia could replace some Chinese oil supplies, but it’s unclear if they could replace all of it, said Anthony Ruggiero, an analyst at the Foundation for Defense of Democracies, a Washington think tank.“If the Chinese really crack down, would the Russians be able to completely backfill? I’m not sure that they would,” Ruggiero said.While Chinese coal imports have fallen to multiyear lows since the imposition of new sanctions by the U.N. Security Council, China’s imports of North Korean iron ore rose in April to the highest level since August 2014 and 10% higher than in March, according to the South China Morning Post.The data on China-North Korea trade is sparse and results in a fuzzy picture of the impact of official sanctions, said Marcus Noland, director of studies at the Peterson Institute for International Economics.North Korean prices for food and fuel have spiked recently, but it’s unclear why, Noland said. He ticked off a number of possible reasons — that supply is down because of sanctions, or it’s being diverted to the military, the population could be hoarding in fear of a war, or people could be more prosperous and buying more rice.But two things are clear: The North Korean currency, the yuan, has been stable so “whatever is going on is not having a big effect,” Noland said.And while Russia’s trade with North Korea appears to be rising, at $130 million annually it is still tiny compared to China’s $6.6 billion in annual trade, Noland said.Even so, Russia could cause mischief in North Korea for the U.S. and its northeast Asian allies South Korea and Japan, Noland said. “Yes, it is plausible that Russia will try to increase trade to increase its geopolitical influence.”", "dateOfCollection": "2017-06-05T15:43:46Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "A wild brawl between fans erupted just feet away from the Cavaliers star after Cleveland fell to the Warriors in Game 2 Sunday night.", "title": "LeBron James pushed out of the way of brawl after Cavs' Game 2 loss", "url": "https://www.usatoday.com/story/sports/nba/2017/06/04/lebron-james-pushed-out-way-brawl-after-cavs-game-2-loss/102506088/", "numberOfLinks": 6, "author": "Martin Rogers", "publishedAt": "2017-06-05T04:08:51Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/1c9297d0efefedca9726a13b02baec9344f01d8d/c=56-34-2653-1501&r=x1683&c=3200x1680/local/-/media/2017/06/04/USATODAY/USATODAY/636322173286341344-USP-NBA-FINALS-CLEVELAND-CAVALIERS-AT-GOLDEN-STAT-91447584.JPG", "article": "OAKLAND – LeBron James was pushed to safety by teammate J.R. Smith as a wild brawl erupted just feet away from the Cleveland Cavaliers star at the end of Game 2 of the NBA Finals on Sunday night.James, Smith, and the rest of their colleagues were making their way to the tunnel at Oracle Arena when at least three supporters began fighting as they leaned over the metal barricades separating the stands from the court.James appeared taken aback by the sudden eruption of activity, with Smith taking quick action of keep him out of harm’s way.“It was close, too close,” Smith told USA TODAY Sports in the Cavaliers locker room afterwards. “Yeah, I pushed him. I wanted to be sure he was out of there. He is the prize jewel right there. It doesn’t matter if I get hurt. It matters if he gets hurt.”Security hurriedly moved in to separate the men involved, as several Cavaliers players looked on and waited until things calmed down before entering the tunnel.“I wouldn’t so much say it was scary,” Smith added. “I remember basketball games in the projects when I was growing up you see that kind of thing. But you don’t really want it happening here.”A tweet posted by @warriorsworld, the social media handle of a popular Golden State Warriors blog of the same name, included a photograph of one of the men. It quoted the unnamed individual as saying that the scuffle started when a man from the exclusive courtside seats tried to encroach on the space of fans close to the railing.“Told him to get behind me, he kept yapping and then it went down,” part of the quote read.Oracle Arena security did not immediately respond to a request for comment.", "dateOfCollection": "2017-06-05T15:43:46Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "President revives calls for ban after London terrorist attack", "title": "Trump seeks quick Supreme Court review of 'travel ban'", "url": "https://www.usatoday.com/story/news/politics/2017/06/05/donald-trump-travel-ban-supreme-court/102509292/", "numberOfLinks": 9, "author": "David Jackson", "publishedAt": "2017-06-05T14:16:48Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/92c0fbb52c1530ebcb963b3704cbc1018a6e93e9/c=0-247-4863-2994&r=x1683&c=3200x1680/local/-/media/2017/06/05/USATODAY/USATODAY/636322429314676517-AP-ITALY-G7-SUMMIT-ISSUES-91186956.JPG", "article": "WASHINGTON -- President Trump asked legal aides Monday to seek a quick Supreme Court review of what he calls his \"travel ban\" from six Muslim countries, and suggested he would seek to expand that ban in the wake of the weekend terrorist attack in London.\"The Justice Dept. should ask for an expedited hearing of the watered down Travel Ban before the Supreme Court - & seek much tougher version!\" the president tweeted.He did not specify what a \"tougher version\" might entail.In another message, Trump took a swipe at the courts and said the U.S. needs to a better job of screening people coming into the country because of concern about terrorism: \"In any event we are EXTREME VETTING people coming into the U.S. in order to help keep our country safe. The courts are slow and political!\"Lower courts have ruled against Trump's proposal to temporarily ban travel from six Muslim majority countries: Iran, Libya, Somalia, Sudan, Syria and Yemen. Some judges cited Trump's own campaign rhetoric -- including calls to block all Muslims from entering the country until terrorist screening procedures could be improved -- in saying the plan improperly targets religion.One of the attorneys involved in the lawsuit against the travel order, Neal Katyal, indicated he would use Trump's tweets against him in arguments before the Supreme Court.In a tweet of his own, Katyal it is \"kinda odd\" to have Trump \"acting as our co-counsel. We don't need the help but will take it!\"While Trump aides once disputed the term \"ban,\" the president has trumpeted the word in the days since the terrorist attack in London. On Monday, the president tweeted: \"People, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a TRAVEL BAN!\"There have been two versions of the travel order. After courts struck down an initial version, aides removed Iraq from the list and made other changes that Trump criticized during the Monday tweet storm.\"The Justice Dept. should have stayed with the original Travel Ban, not the watered down, politically correct version they submitted to S.C.,\" Trump said.While Trump criticized the Justice Department over the wording of the current order, it should be noted: He signed it.", "dateOfCollection": "2017-06-05T15:43:46Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "The babies were taken to the hospital and released.", "title": "Neighbor kills Oklahoma man trying to drown twin babies in a bathtub", "url": "https://www.usatoday.com/story/news/nation-now/2017/06/05/neighbor-shoot-kills-oklahoma-man-trying-drown-twin-babies-bathtub/369733001/", "numberOfLinks": 6, "author": "Mary Bowerman", "publishedAt": "2017-06-05T11:43:43Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/d50095392ba81b27f6651f0e0c18f2ee4b5bb1ef/c=0-101-3464-2058&r=x1683&c=3200x1680/local/-/media/2017/06/05/USATODAY/USATODAY/636322397390709643-GettyImages-105207929.jpg", "article": "An Oklahoma man was fatally shot by a neighbor Friday as he tried to drown his infant twins in a bathtub, according to authorities. Leland Foster, 27, showed up at a house where the babies’ mother, Michelle Forrells, was staying and allegedly forced her and the infants into a bathroom, according to police, NBC reported. Foster held Forrells at knifepoint and tried to drown the twins, authorities said.During the incident, a 12-year-old girl living in the home ran to neighbor Cash Freeman’s house for help, KFOR-TV reported. Freeman grabbed his gun and ran to the house, where he saw Foster, the babies' father, trying to kill them, Lisa Bratcher, a spokeswoman for Ada police told NBC. Freeman shot Foster twice in the back. The babies were taken to the hospital and released, according to NBC. Freeman was questioned by police and later released. Investigators will decide whether Freeman will face charges for killing Foster, NBC reported. More coverage:  ", "dateOfCollection": "2017-06-05T15:43:46Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Richard Angell told Buzzfeed News  he was in Arabica Bar and Kitchen when he heard gunfire and saw injured people running by.", "title": "Customer returns to pay restaurant bill after London terror attack: 'These people shouldn't win'", "url": "https://www.usatoday.com/story/news/nation-now/2017/06/05/london-terror-attack-customer-returns-pay-bill/369769001/", "numberOfLinks": 7, "author": "Mary Bowerman", "publishedAt": "2017-06-05T12:10:03Z", "urlToImage": "", "article": "A man evacuated from a restaurant during the London terror attack that killed seven people and wounded dozens, returned to pay his bill and tip staff the morning after the massacre. Richard Angell told Buzzfeed News he was in Arabica Bar and Kitchen when he heard gunfire and saw injured people running by.  \"We were sitting in the restaurant at the table nearest the door, which is quite horrifying to think about,\" he told Buzzfeed. \"Suddenly we were aware of security saying lock the door and duck and cover. People jumped to the floor, knocking over tables.\" Attackers rammed pedestrians with a van on London Bridge on Saturday evening before launching frenzied stabbings in nearby Borough Market. The three assailants were shot dead by police. Twenty-one of the 48 people injured in the attack remained in critical condition late Sunday.Angell, who is the director of think tank Progress, said he wanted to return to the restaurant to thank the staff for looking out for the restaurant patrons and to pay his bill. \"These people shouldn't win,\" Angell told Buzzfeed News. \"This is the best city in the world and Borough Market is one of my favorite bits of the best city in the world. I'm not going to let the barbaric acts of cowardly people minimize that.\"The Islamic State has claimed responsibility for the attack.More coverage:  ", "dateOfCollection": "2017-06-05T15:43:47Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Saudi Arabia closed its land border with Qatar, and at least five Gulf-based airlines announced they will halt service to the desert peninsula nation.", "title": "Why Saudi Arabia is mad at Qatar and why we care", "url": "https://www.usatoday.com/story/news/world/2017/06/05/why-saudi-arabia-mad-qatar-and-why-we-care/102509588/", "numberOfLinks": 4, "author": "John Bacon", "publishedAt": "2017-06-05T15:16:20Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/f22b3226970161de708b246b6d13a586a6359378/c=0-395-4164-2747&r=x1683&c=3200x1680/local/-/media/2017/06/05/USATODAY/USATODAY/636322485661301711-AFP-AFP-PA050.jpg", "article": "The rift between Qatar and other Arab nations intensified Monday when Saudi Arabia closed its land border with Qatar and at least five Gulf-based airlines announced they will halt service to the desert peninsula nation.Saudi Arabia, a Sunni-dominated nation, has long had tense relations with Shiite Iran and has developed a \"Sunni coalition\" in the region to curb Iran's influence. The U.S. supports the Saudi effort. Qatar is predominantly Sunni and is a member of the coalition but has close economic ties with Iran, including sharing a major offshore gas reserve.Last week, Qatari Emir Tamim bin Hamad Al Thani roiled the Saudis when he phoned Iranian President Hassan Rouhani with congratulations on his re-election.MORE: Rift to affect fliers connecting through busy Doha hubSaudi Arabia, Egypt, the United Arab Emirates, Bahrain and Yemen cut ties to Qatar on Monday, claiming the energy-rich monarchy is undermining stability in the region by supporting in the Iran-aligned militant groups. Authorities gave Qataris living in and visiting their countries two weeks to leave.Iran's National Security Commission chief Alaeddin Boroujerdi blamed President Trump's recent visit to Saudi Arabia and U.S. interventions for the rift. The Saudis agreed to a lucrative, $300 billion arms deal that could have emboldened its leadership, believing the U.S. will support actions against Qatar.Tensions first boiled over two weeks ago with Qatar's publication of a story that said Al Thani had called Iran  “a regional and Islamic power that cannot be ignored.” Qatar said its state-run news agency and Twitter account were hacked and the story was fake, but state-linked media continued to publish the comments. Saudi Arabia, the UAE, Bahrain and Egypt blocked access to Al Jazeera and affiliated sites.The United States has close ties to both nations. Saudi Arabia is the closest U.S. ally in the region, and Qatar is home to al-Udeid Air Base and almost 10,000 U.S. troops. Qatar is no outlier to the West: It is scheduled to host the 2022 FIFA World Cup, a month-long international soccer tournament and the world's most popular sports event. It is also the world's biggest producer of liquefied natural gas and shares an underwater field with Iran.Saudi Arabia has the only land border with Qatar, and Qatar's population of more than 2.5 million people is fed by supply trucks that roll across the border.Qatar's Ministry of Foreign Affairs called the measures unjustified and \"based on baseless and unfounded allegations.\" Qatar has relentlessly denied claims supporting militant groups in the region. But the country has drawn a cool reception by other Sunni nations for its support of the Muslim Brotherhood in Egypt. Qatar also is a primary financial backer in Gaza, which is controlled by Hamas. Hamas is considered a terrorist group by the U.S. and several other countries.U.S. Secretary of State Rex Tillerson, speaking at a news conference in Australia, said there has been a \"growing list of some irritants\" in the region in recent months.\"Obviously they have now bubbled up to a level that countries decided they needed to take action in an effort to have those differences addressed,\" Tillerson said. \"We certainly would encourage the parties to sit down together and address these differences, and we — if there’s any role that we can play in terms of helping them address those — we think it is important that the GCC (Gulf Cooperation Council) remains unified.\"Contributing: The Associated Press", "dateOfCollection": "2017-06-05T15:43:47Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "CNN host Reza Aslan found himself at the center of a media firestorm after a foul-mouthed response to President Trump’s latest call for a travel ban.", "title": "CNN host Rezla Aslan gets flak for potty-mouthed anti-Trump tweet", "url": "https://www.usatoday.com/story/news/politics/onpolitics/2017/06/05/cnn-host-rezla-aslan-gets-flak-anti-trump-tweet/369922001/", "numberOfLinks": 8, "author": "Matthew Diebel", "publishedAt": "2017-06-05T14:03:39Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/68858ef22832d60c8040974347533a8e0631ff0d/c=0-142-850-622&r=x1683&c=3200x1680/local/-/media/2017/06/05/USATODAY/USATODAY/636322505902197225-REZAXXX-ASLAN-ZEALOT-BOOKS-2626.jpg", "article": "Maybe it was the human brains he ate a couple of years back.CNN host and author Reza Aslan. (Photo: Malin Fezehai)Controversial CNN host Reza Aslan found himself at the center of a media firestorm on at the weekend when he responded with a potty-mouthed epithet to President Trump’s tweet reiterating his call for a travel ban.Aslan, host of the CNN series Believer – in one episode of which he joined a Hindu sect in eating part of a human brain – later apologized for the Trump-related tweet, saying he “lost my cool and responded to him in a derogatory fashion.”Aslan had ranted that “This piece of s--- is not just an embarrassment to America and a stain on the presidency. He's an embarrassment to humankind.\"The tweet was later removed.CNN was pleased with the apology, AdWeek reports. (CNN's statement came after Aslan's apology.)“Reza Aslan is not a CNN employee,but does host a series on the network,” a CNN spokesperson said in a statement. “We are pleased that he has apologized for his tweets. That kind of discourse is never appropriate.”  Trump’s Twitter storm came about two hours after terrorists killed seven people in London by mowing them down with a van and stabbing them. Many others were injured.Before it was taken down, Aslan’s tweet received many “likes,” but also was the object of ire from Trump supporters.\"You ate human brains bro,\" said one. ", "dateOfCollection": "2017-06-05T15:43:47Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "ESPN's Rex Ryan, along with his brother Rob Ryan, were in Nashville for Game 3 of Stanley Cup Finals", "title": "Rex Ryan, Rob Ryan involved in bar fight in Nashville", "url": "https://www.usatoday.com/story/sports/nfl/2017/06/05/rex-ryan-rob-ryan-involved-bar-fight-nashville/102509714/", "numberOfLinks": 7, "author": "Scott Gleeson", "publishedAt": "2017-06-05T14:28:07Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/a807d2a75e35723fd4626768d5411f41bdc4075e/c=0-150-2398-1505&r=x1683&c=3200x1680/local/-/media/2017/06/05/USATODAY/USATODAY/636322455708276576-USATSI-9775774.jpg", "article": "Former NFL head coach Rex Ryan, along with his twin brother and former assistant coach, Rob Ryan, were involved in a bar skirmish in Nashville this past weekend.The two were dining at a Margaritaville restaurant in Nashville when things got a bit messy. A video of the confrontation made it to Twitter. Rex -- wearing a Bryce Harper Nationals jersey -- appears to be in the midst of an argument before it gets physical. After what appears to be a shove toward Rex, Rob Ryan intervenes and is seen putting his hands on another man's throat for a brief moment.The Ryans attended Game 3 of the Stanley Cup Finals between the Predators and Penguins on Saturday, and Rex played a part in the Predators’ pregame car-smashing tradition.Rex Ryan, who was fired by the Bills with one game remaining in 2016, joined ESPN in April to be a part of the Sunday NFL Countdown in September, while also likely to appear on SportsCenter, among other shows.", "dateOfCollection": "2017-06-05T15:43:47Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "The USA TODAY NETWORK will have live coverage of this event.", "title": "Live stream: Trump proposes air traffic control privatization", "url": "https://www.usatoday.com/story/news/politics/2017/06/05/live-stream-trump-proposes-air-traffic-control-privatization/102513826/", "numberOfLinks": 2, "author": null, "publishedAt": "2017-06-05T19:13:57+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/c66a8a943f5d90eca5a56475c37933f5882ab138/c=0-221-5124-3116&r=x1683&c=3200x1680/local/-/media/2017/06/05/USATODAY/USATODAY/636322520798810950-AP-TRUMP-FINANCIAL-REGULATIONS-90391236.JPG", "article": "President Trump on Monday is expected to announce he will send Congress a plan put the nation's air traffic control system in private hands. The plan calls for the creation of a private, nonprofit corporation, with airlines contributing fees rather than the taxes they now pay the government to cover the approximately $10 billion annual cost for air-traffic control. Watch the announcement live in the player above.", "dateOfCollection": "2017-06-05T15:43:48Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "The International Space Station has welcomed its first returning vehicle in six years - a SpaceX Dragon making a repeat delivery. (June 5)", "title": "Space Station Welcomes Space X Dragon Shipment", "url": "https://www.usatoday.com/videos/news/nation/2017/06/05/space-station-welcomes-space-x-dragon-shipment/102513912/", "numberOfLinks": 1, "author": "AP", "publishedAt": "2017-06-05T15:10:05+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/8053d91dc9a2258a0283ca7a3f06eb1e3cc2b513/r=x1803&c=3200x1800/https/videos.usatoday.net/Brightcove3/29906170001/201706/2354/29906170001_5460191749001_5460177905001-vs.jpg?pubId=29906170001", "article": "", "dateOfCollection": "2017-06-05T15:43:48Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Opposition leader Jeremy Corbyn supports calls for Prime Minister Theresa May to resign.", "title": "Security takes center stage ahead of U.K. general election", "url": "https://www.usatoday.com/story/news/world/2017/06/05/security-takes-center-stage-ahead-uk-general-election/102510922/", "numberOfLinks": 6, "author": "Kim Hjelmgaard", "publishedAt": "2017-06-05T19:07:22+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/b1cdfde1dd8b7690533976c83afac00546010112/c=0-49-4126-2380&r=x1683&c=3200x1680/local/-/media/2017/06/05/USATODAY/USATODAY/636322520246927984-EPA-BRITAIN-LONDON-TERRORIST-INCIDENT-AFTERMATH-91437342.JPG", "article": "LONDON — Britain's main candidates focused their campaigns Monday on security and counter-terrorism, as the country's latest terror attack dominated the political debate ahead of Thursday national elections.Prime Minister Theresa May's ruling Conservative Party and Jeremy Coryn's Labour Party, the main opposition, had paused their campaigns briefly out of respect for the seven people killed and 48 injured in London Saturday night, the third terror attack on British soil in three months.The Islamic State, or ISIS, said it was responsible for Saturday's attack, but that claim has not been verified. Often the attackers are native-born ISIS sympathizers who act on their own.May had called the election in hopes that her party would win a larger majority as she begins complex — and potentially costly — negotiations to exit the European Union. However, recent polls show her once-commanding lead over Corbyn has narrowed sharply, as he focused the election on the Conservatives' cuts in education, health care and other domestic programs rather than on Brexit.Both candidates are now focusing on national security following the assault in London and the suicide bombing in Manchester, northern England, two weeks ago that killed 22 people and injured more than 100 at an Ariana Grande concert.The latest poll from market research firm YouGov published Monday estimated that 42% of the electorate intended to vote for the Conservatives, which would give them 305 seats in Parliament, to 38% — or 268 seats — for Labour, with other parties getting the remaining vote. Weeks earlier, May's party had a double-digit lead and appeared headed for a landslide victory.If neither party wins at least 326 of the 650 seats in the House of Commons, May or Corbyn may try to form a coalition with other parties to create a governing majority. The party with the most seats also can try to run the country with a minority of seats but another general election would be called if it loses on a key vote.Corbyn accused the Conservatives of slashing 20,000 police officers over the last seven years that it has been in power. May was the country’s home secretary — or interior minister — under her predecessor, David Cameron, a Brexit opponent who resigned after Britons voted a year ago to leave the EU.\"You cannot protect the public on the cheap. The police and security services must get the resources they need, not 20,000 police cuts,\" he said in Carlisle, northern England, Sunday. “Theresa May was warned by the Police Federation, but she accused them of 'crying wolf.'\"Corbyn told the British broadcaster ITV that he supported calls for May to resign. May said Monday that counter-terrorism resources are well-funded despite the cuts to police staffing.London's Metropolitan Police Chief Cressida Dick said that the terrorist attacks in the U.K. are planned on domestic soil with little foreign coordination.Dick told British radio that 23,000 people of potential interest are being monitored in Britain, including 500 active investigations. He said five terror plots have been foiled since March.May said she wants to take tough new action to \"stamp out\" extremism, which she said has been tolerated for far too long. She urged major Internet companies, such as Facebook and Google, to do more to prevent the spread of radical ideologies and propaganda. That would require a way to balance free speech rights with the need to keep Britons safe.Facebook said it wants to be a \"hostile environment for terrorists,\"  but it did not propose specific measures.\"If we turn the Internet into a tool for censorship and surveillance, the terrorists will have won,\" Tim Farron, the leader of the opposition Liberal Democrats, wrote in an opinion piece for the Guardian newspaper.  \"We won't make ourselves safer by making ourselves less free.\"Farron warned May that counter-terrorism authorities could be overzealous in their attempts to monitor citizens' activity and resemble the surveillance habits of totalitarian states like North Korea, where free speech and individual rights do not exist.", "dateOfCollection": "2017-06-05T15:43:48Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "But the justices say special elections for at least 28 legislative seats may not be needed before 2018 -- a small victory for Republicans, who had called such a remedy 'the most extreme and intrusive possible.'", "title": "Supreme Court strikes down more North Carolina election districts", "url": "https://www.usatoday.com/story/news/politics/2017/06/05/supreme-court-strikes-down-more-north-carolina-election-districts/102512186/", "numberOfLinks": 6, "author": "Richard Wolf", "publishedAt": "2017-06-05T19:06:07+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/a02dcc15343ac763f18a76e656f325063c82d44a/c=0-194-4437-2701&r=x1683&c=3200x1680/local/-/media/2017/06/05/USATODAY/USATODAY/636322565540365753-AP-Voter-Laws-North-Carolina.jpg", "article": "WASHINGTON — The Supreme Court on Monday struck down dozens of state legislative districts in North Carolina because they disadvantaged black voters, but the justices said special elections this year might not be necessary.The decision was a mixed bag for the state, which now has seen both legislative and congressional districts rejected because of their emphasis on racial demographics and faces a potential Supreme Court review over excessive partisanship. Last month, the justices refused to reconsider a lower court's ruling that a North Carolina photo-ID law discriminated against black voters \"with almost surgical precision.\"While the court vacated a federal district court order mandating special elections this year for one-year terms, opponents of the redistricting plan vowed to fight that battle again in the lower court. Elections this fall would would give Democrats a chance to reduce Republicans' veto-proof majorities, which in turn could help newly elected Democratic Gov. Roy Cooper.“The U.S. Supreme Court has finally and emphatically confirmed what we've known for years — that many of North Carolina's state legislative districts are unconstitutional racial gerrymanders,\" said Anita Earls, executive director of the Southern Coalition for Social Justice. \"The order reaffirms that our clients, and the voters of this state, are entitled to have fair legislative districts that do not discriminate against voters based on their race.\"A three-judge trial court ruled last summer that 28 state legislature districts in question were improperly drawn with too much of an emphasis on race. Then the lower court ruled that special elections must be held this year — a process the state called \"the most extreme and intrusive remedy possible: partial invalidation of an election and imposition of a special election that overrides multiple provisions of the North Carolina Constitution.\"The Supreme Court's dual opinions Monday upheld the original district court ruling but questioned the need for special elections. The lower court's reasoning, the justices said, \"would appear to justify a special election in every racial-gerrymandering case -- a result clearly at odds with our demand for careful, case-specific analysis.\"Read more:", "dateOfCollection": "2017-06-05T15:43:48Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "The White House has long-shot plan to privatize the nation's air traffic control system.", "title": "In infrastructure push, Trump seeks to privatize air traffic control system", "url": "https://www.usatoday.com/story/news/politics/2017/06/05/donald-trump-air-traffic-control/102510732/", "numberOfLinks": 4, "author": "David Jackson, and Bart Jansen", "publishedAt": "2017-06-05T18:25:12+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/c66a8a943f5d90eca5a56475c37933f5882ab138/c=0-221-5124-3116&r=x1683&c=3200x1680/local/-/media/2017/06/05/USATODAY/USATODAY/636322520798810950-AP-TRUMP-FINANCIAL-REGULATIONS-90391236.JPG", "article": "WASHINGTON -- As President Trump and aides brace for congressional testimony this week from ex-FBI Director James Comey, the White House on Monday began a week-long promotion of various infrastructure proposals, starting with a long-shot plan to privatize the nation's air traffic control system.\"You can expect the President to be focusing even more on jobs this month and holding events in Washington and outside, pushing his pro-growth, pro-jobs agenda,\" White House spokesman Sean Spicer said.While specifics on how to upgrade the nation's roads and bridges are still being developed, Trump on Monday plans to say he will send Congress a plan put the nation's air traffic control system in private hands. It calls for creating a private, nonprofit corporation, with airlines contributing fees rather than the taxes they now pay the government to cover the approximately $10 billion annual cost for air-traffic control.During the rest of the week, Trump and other administration officials will call on states, cities, and private companies to pay more for rebuilding roads, bridges, railways, airports, and other types of infrastructure. The schedule includes meetings with members of Congress, a Wednesday speech in Cincinnati, and an \"infrastructure summit\" Thursday with various governors and mayors.Some Democratic lawmakers said Trump really doesn't have an infrastructure plan. Sen. Brian Schatz, D-Hawaii, said in a tweet that Trump \"is  NOT proposing money for infrastructure. It's tax cuts for financiers, privatizing public property. Not infrastructure.\"Thursday is also the day Comey is set to testify before Congress, an event likely to center on the ongoing investigation into links between Trump's campaign last year and Russians who sought to influence the election by hacking Democrats.In firing Comey last month, Trump cited performance issues, while critics accused him trying to close down the Russia investigation. The Justice Department later appointed ex-FBI Director Robert Mueller as special counsel to lead the investigation.Associates of Comey said that, according to the former director, Trump asked him to lay off an ongoing investigation into former National Security Adviser Michael Flynn, who is also accused of involvement with Russians.Trump, meanwhile, reportedly told Russian officials in an Oval Office meeting that Comey was a \"nut job,\" and that his dismissal would help get the Russia issue behind him.As for infrastructure, moving air-traffic control out of the Federal Aviation Administration has been debated periodically since the 1990s, but never approved by Congress. Trump’s proposal would be modeled on Canada’s system, which is run a private board of industry stakeholders rather than the government.Trump’s principles seek to improve legislation approved in 2016 in the House Transportation and Infrastructure Committee that never got a vote in the full House or Senate. The debate resumed as part of renewing FAA legislation that expires Sept. 30.Hearings are scheduled Wednesday in the Senate and Thursday in the House.The corporation’s 13-member board would begin with eight members appointed by the transportation secretary, with two representing airlines, two for unions, one for airports, one for general aviation and two for the government. Those eight would choose a chief executive officer, and then that board would choose another four independent board members. But no seats would be assigned to specific interests after the initial board is seated.“There will not be designated seats by interest group,\" said D.J. Gribbin, special assistant to the president for infrastructure.Airlines and the National Air Traffic Controllers Association supported the 2016 bill as a way to have more predictable funding than provided by annual spending fights in Congress that have led to furloughs and shutdowns in recent years.“I strongly support the president’s continuing recognition that modernizing our country’s air traffic control service is one of the most important infrastructure investments we can make,” Rep. Bill Shuster, R-Pa., whose 2016 bill laid the groundwork for Trump’s proposal, said May 24 of Trump’s budget.Besides smoother funding, airlines and supportive lawmakers contend that the corporation would modernize equipment and training faster than FAA. Government watchdogs have criticized FAA for slow progress on shifting controllers from directing planes by ground-based radar to satellite-based GPS.But the proposal has critics among airlines, general-aviation groups and in Congress.“There’s not a dime’s worth of difference between President Trump’s plan and Chairman Shuster’s proposal, both of which would hand over America’s skies to a private corporation, free of charge,” said Rep. Donald M. Payne Jr., D-N.J.The top Democrat on Shuster’s committee, Rep. Peter DeFazio, D-Ore., has argued that airlines would dominate the board and shouldn’t be trusted because of their own technology failures that cancel thousands of flights.Delta Air Lines opposed the 2016 bill because of concerns it would disrupt air-traffic control at a time when FAA is making improvements.General-aviation groups opposed the legislation because of concerns about how they would be charged under the private system and the possibility that airlines would be favored over private pilots at busy airports.In describing the plan, a statement from the Trump administration said all users of the system would pay their fair share, but it assured access to general aviation and to rural communities.The leaders of the Senate Appropriations Committee, which decides with House counterparts how much to spend each year on FAA, said the proposal doesn’t appear to make sense. Sens. Thad Cochran, R-Miss., and Patrick Leahy, D-Vt., said in a Feb. 28 letter that consumers would have no recourse for complaints or mistreatment as they currently enjoy through the Transportation and Congress.", "dateOfCollection": "2017-06-05T15:43:48Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Harvard revoked admissions for at least ten students after discovering they exchanged inappropriate memes in a Facebook chat. Elizabeth Keatinge (@elizkeatinge) has more.", "title": "Harvard rescinds admission for at least 10 students for vulgar memes", "url": "https://www.usatoday.com/videos/news/college/2017/06/05/harvard-rescinds-admission-least-10-students-vulgar-memes/102511284/", "numberOfLinks": 1, "author": "Buzz60", "publishedAt": "2017-06-05T13:20:17+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/8053d91dc9a2258a0283ca7a3f06eb1e3cc2b513/r=x1803&c=3200x1800/https/videos.usatoday.net/Brightcove3/29906170001/201706/3154/29906170001_5460071765001_5460059941001-vs.jpg?pubId=29906170001", "article": "", "dateOfCollection": "2017-06-05T15:43:49Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Dogs wearing the dreaded \"cone of shame\" were having a hard time getting noticed at the animal shelter. A local artist came up with an eye-catching solution.", "title": "Dogs get adopted thanks to artist’s help", "url": "https://www.usatoday.com/story/news/humankind/2017/06/05/dogs-get-adopted-thanks-artists-help/102513316/", "numberOfLinks": 4, "author": "Neda Farshbaf", "publishedAt": "2017-06-05T18:55:08+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/3e0189bd4a7dc32c6827cd8b28ef493dd78d6487/c=0-0-1237-699&r=x1683&c=3200x1680/local/-/media/2017/06/05/USATODAY/USATODAY/636322564753340708-Ellie-ConeOfFame-05-05-17.jpg", "article": "CHICAGO – After volunteering at a local animal shelter, art student Erin Einbender came up with an idea for her school photo project.Dogs at shelters have to get spayed or neutered before they can be put up for adoption. After their surgeries, they must wear the dreaded cones of shame, a protective cone-shaped collar used to protect an animal after surgery.At One Tail at a Time, where Einbender was volunteering, she noticed that many of the cone-wearing dogs were having a hard time getting adopted. They often looked sad with the plain, plastic cones around their neck.Einbender decided to jazz up their look by creating art out of the cones.  She named her project “Cones of Fame.”“The cones are meant to empower the pups (instead of shaming them) and to educate people on the importance of spaying/neutering,” Einbender wrote on her Facebook page.Ultimately, all the dogs that participated in the first Cones of Fame project were adopted. Now, Einbender hopes to work with other animal shelters to help their struggling cone-wearing dogs get adopted.***For more stories like this, LIKE Humankind on Facebook.", "dateOfCollection": "2017-06-05T15:43:49Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Newseum will honor and recognize 14 journalists who died in the pursuit of news in 2016. Today is also the 3rd annual #WithoutNews campaign to raise awareness on the threats to journalism.", "title": "Newseum honors 14 journalists who died in 2016", "url": "https://www.usatoday.com/videos/news/2017/06/05/newseum-honors-14-journalists-who-died-2016/102513462/", "numberOfLinks": 1, "author": "USA TODAY", "publishedAt": "2017-06-05T14:48:47+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/8053d91dc9a2258a0283ca7a3f06eb1e3cc2b513/r=x1803&c=3200x1800/https/videos.usatoday.net/Brightcove3/29906170001/201706/434/29906170001_5460167574001_5460151353001-vs.jpg?pubId=29906170001", "article": "", "dateOfCollection": "2017-06-05T15:43:49Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Law enforcement authorities said there were \"multiple fatalities\" following a Monday morning shooting in an industrial area near Orlando. (June 5)", "title": "Raw: 'Multiple fatalities' in Florida shooting", "url": "https://www.usatoday.com/videos/news/nation/2017/06/05/raw-multiple-fatalities-florida-shooting/102513344/", "numberOfLinks": 1, "author": "AP", "publishedAt": "2017-06-05T14:45:05+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/8053d91dc9a2258a0283ca7a3f06eb1e3cc2b513/r=x1803&c=3200x1800/https/videos.usatoday.net/Brightcove3/29906170001/201706/2934/29906170001_5460162312001_5460156376001-vs.jpg?pubId=29906170001", "article": "", "dateOfCollection": "2017-06-05T15:43:49Z"}]