[{"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "The White House anguished over how and when to report publicly about Russian hacking out of concern it could impact the presidential election.", "title": "Report: Obama ordered cyber 'implants' for Russian network in response to hacking", "url": "https://www.usatoday.com/story/news/2017/06/23/obama-ordered-u-s-intelligence-agency-deploy-implants-russian-network-response-kremlin-hacking/422818001/", "numberOfLinks": 4, "author": "Doug Stanglin", "publishedAt": "2017-06-23T15:24:51Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/91feec6e5037f449866d7a7d18a1df82c0630486/c=0-0-3160-1785&r=x1683&c=3200x1680/local/-/media/2017/06/23/USATODAY/USATODAY/636338055951299934-axx-putin-obama-06.jpg", "article": "President Obama, angered by Russian hacking during the 2016 elections, authorized a covert cyber operation to deploy \"implants\" in Russian networks that could be triggered remotely in retaliation to any future cyber aggression by Moscow, The Washington Postreported Friday.The Post said the operation, still in its early stages, had been signed off on by Obama and authorized U.S. agencies to carry out the program, even into the new administration.\"U.S. intelligence agencies do not need further approval from (President) Trump, and officials said that he would have to issue a countermanding order to stop it,\" the Post reported. \"The officials said that they have seen no indication that Trump has done so.\"The implants, developed by the NSA, are designed to hit Russian networks deemed “important to the adversary and that would cause them pain and discomfort if they were disrupted,” a former U.S. official told the Post.They could be activated in the event that Russia attacked a U.S. power grid or interfered in a future U.S. presidential race.The report is contained in a sweeping investigation into Russian electoral interference, U.S. efforts to uncover its extent, and the political handwringing over how and when to alert the public.The lengthy report is based on interviews with more than three dozen current and former U.S. officials in senior positions in government, including at the White House, the State, Defense and Homeland Security departments, and U.S. intelligence services the newspaper said.Other key findings:— CIA Director John Brennan first alerted the White House in early August that Russian President Vladimir Putin had ordered an operation to defeat or at least damage Hillary Clinton and help elect her opponent, Donald Trump. Sent by courier from the CIA, it carried “eyes only” instructions that its contents be shown to just four people: Obama and three senior aides.— As officials debated a response, secrecy and security was extraordinary, akin to the measures employed in the leadup to the killing of Osama bin Laden.—  On Aug. 15, Homeland Security secretary Jeh Johnson arranged a conference call with dozens of state officials, hoping to enlist their support for designating state voting system \"critical infrastructure\" to give priority in offering them federal cybersecurity assistance. He ran into a wall of resistance, including skepticism from Georgia's secretary of state who said he was unconvinced of Russian interference and viewed the White House proposal an assault on state rights.— Many White House officials were torn over how to make the information about Russian hacking public out of concern that it might appear to be a deliberate attempt by the White House to influence the election.— One constant factor in discussions over how to respond was a belief that Hillary Clinton would win the presidency and there would be time to confront the Russians more directly after the election. One former senior Obama administration official, speaking on background, expressed remorse over how the government handled the Russian problem, saying, \"I feel we sort of choked.\" — A Situation Room meeting to brief 12 key members of Congress, including the leadership of both parties, on the Russian hacking issue \"devolved into a partisan squabble.\" Democrats pressed to make the information public, while Republicans resisted, arguing that to warn the public that the election was under attack would bolster Russia's aim of undermining confidence in the system.—The Obama administration warned Russia three times over hacking, including a direct statement by Obama to Russian President Vladimir Putin during a meeting of world leaders in China. Putin responded by demanding proof and accusing the United States of interfering in Russia’s internal affairs.The White House, the CIA, the FBI, the NSA and the Office of the Director of National Intelligence declined to comment on the newspaper's findings, the Post said.  \n ", "dateOfCollection": "2017-06-23T15:44:36Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "The breach has now drawn the scrutiny of the Senate Homeland Security Committee, which is exploring the increased reliance on fencing technology at the nation's most secure prison facilities.", "title": "Exclusive: Empty guard towers allowed carjacker to escape maximum security prison", "url": "https://www.usatoday.com/story/news/politics/2017/06/23/exclusive-empty-guard-towers-allowed-carjacker-escape-maximum-security-prison/103007494/", "numberOfLinks": 8, "author": "Kevin Johnson", "publishedAt": "2017-06-23T09:17:07Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/01156a4c62938089786622cf005fb8870a907b76/c=0-0-3499-1977&r=x1683&c=3200x1680/local/-/media/2015/10/09/USATODAY/USATODAY/635799990374553701-XXX-CRIME-FAMILIES-ee0610.JPG", "article": "WASHINGTON — In a maximum security federal prison in California, convicted carjacker Guaymar Cabrera Hernandez made a run for it. A key to his brazen escape last month: Five guard towers ringing the perimeter of the compound were not staffed.Turns out, they have been empty for nearly six years.Instead, prison officials at the U.S. Penitentiary Atwater have been relying on three layers of fencing, including an electrified barrier known as a \"lethal fence\" — which the 26-year-old Guatemalan inmate easily defeated in a run to freedom that passed directly beneath two of the empty towers, according to two officials who are not authorized to discuss the matter publicly.So alarmed by the breach, the warden staged a video re-enactment of the escape, featuring a correctional officer scaling the same section of the fence. The video demonstrated how to avoid tripping a potentially lethal jolt of electricity, according to one of the officials who has viewed the tape.The unusual video, recorded shortly after Hernandez was recaptured on May 13, has since been sent to the Bureau of Prisons headquarters in Washington. Yet the towers at Atwater remain unstaffed, and the only visible security change at the complex was the addition of one vehicle to the existing single-car patrol to roam the prison's outside perimeter.The breach has now drawn the scrutiny of the Senate Homeland Security Committee, which is exploring the increased reliance on fencing technology at the nation's most secure prison facilities —  in lieu of tower officers who once represented the last line of defense against escape and other disturbances.\"The committee is looking into the situation at the Atwater prison as well as other prisons around the country,'' panel spokeswoman Brittni Palke told USA TODAY, adding that the lawmakers are coordinating their review with the Justice Department's inspector general.The Bureau of Prisons did not dispute the account of Hernandez's escape or the dearth of tower officers, saying that the agency \"continues to monitor its physical security structures in order to ensure adequate security procedures are in place.''\"For security reasons, we cannot comment on our use of towers and fencing,'' spokeswoman Tovia Knight said.Yet the breakdown at one of the federal system’s most secure facilities is casting new attention on persistent security concerns and staffing shortages, first disclosed by USA TODAY, that for years have plagued the country’s largest prison system.In recent years, nurses and other medical staffers have been thrust into guard duty and other security-related shifts to fill the chronic personnel gaps, despite their lack of experience patrolling the corridors and recreation yards inside the overcrowded system.Despite the problems, the BOP paid more than $2 million in bonuses to top administrators and wardens during the past three years while the agency was confronting security-related staffing shortages, overcrowding, sub-par inmate medical care and a lurid sexual harassment lawsuit that engulfed its largest institution, according to government records and court documents.The House Oversight and Government Reform Committee is now reviewing the bonus payments. But the Atwater breach is prompting the Senate Homeland Security Committee to launch a \"bureau-wide'' investigation into compromised fencing and other security concerns across the prison system.\"Our office is in the process of forming an investigation into bureau-wide issues and would like to use the issues with the fencing at Atwater as a starting point,'' according to committee correspondence obtained by USA TODAY.A committee investigator, in an email dated June 13, refers to the panel's interest in obtaining the Atwater video and describes the \"structural flaws of the fences'' as of \"great concern to us.''DeTekion Security Systems, a New York company which has conducted maintenance on fencing at Atwater as recently as March, did not respond to a request for comment.Related: The Atwater case is just one high-profile example of how the bureau's emphasis on fencing technology has increasingly supplanted dependence on correctional officers, as a concession to both technology and budget constraints.Perimeter towers at the bureau's largest penitentiary in Coleman, Fla., have also been unstaffed for years, said Joe Rojas, president of the local prison workers union. The empty towers have long unnerved officers who fear that they represent a glaring security weakness.\"I think everybody would rather have eyes, ears and boots on the ground rather than rely on a fence,'' said Rojas. Members of his union are charged with securing more than 2,600 inmates assigned to maximum security units.Hernandez, serving a 115-month sentence for carjacking and assault with intent to commit robbery, was transferred to Atwater following his 2016 attempted escape from a medium security federal prison in West Virginia.At Atwater, federal authorities discovered Hernandez missing about 8:30 p.m., May 12, during checks after the evening meal. According to one official briefed on the incident, the inmate with a slight build climbed a rain spout to the roof of a building, where he went undetected before making his way through the fencing.Gouged by concertina wire, Hernandez's blood marked the path that he took, up and eventually over the barriers just below the towers. Hernandez managed to scale the electrified fence by using insulators attached to the fence as stair-steps, avoiding the charged wires, the official said.Hernandez also may have slipped past a motion sensor just outside the fence-line. It is not immediately clear whether security officials were alerted to a tripped sensor at the time.Beyond the federal prison system, the Hernandez escape raised concerns in the surrounding community of Atwater, where Merced County Sheriff Vern Warnke said local authorities were not alerted to the breach until hours after the inmate was discovered missing.Daryl Allen, a spokesman for the sheriff, said that delay prompted a meeting between Warnke and federal prison authorities shortly after Hernandez was recaptured. Allen said the meeting \"ironed out\" communications problems between the prison and local law enforcement, at least in terms of the delayed notification.Yet the meeting did not apparently address the staffing of the guard towers. \"He (the sheriff) has heard they may have some issues,'' Allen said. \"Those are rumors that he has heard.''", "dateOfCollection": "2017-06-23T15:44:36Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Sears Holdings is closing another 20 stores as the distressed department-store chain seeks to stanch the bleeding.", "title": "Sears to close 20 more stores as crisis continues", "url": "https://www.usatoday.com/story/money/2017/06/23/sears-holdings-kmart-store-closures/422802001/", "numberOfLinks": 8, "author": "Nathan Bomey", "publishedAt": "2017-06-23T14:21:31Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/22ae66fff2977ca0539a2e728ef2e17468b9f001/c=0-49-580-375&r=x1683&c=3200x1680/local/-/media/2017/06/21/USATODAY/usatsports/searsexterior_hi_large.jpg", "article": "Sears Holdings is closing another 20 stores as the distressed department-store chain seeks to stanch the bleeding amid swirling challenges for the retail sector.The company will shutter 18 Sears stores and two Kmart locations, real estate investment trust Seritage Growth Properties confirmed in a Securities and Exchange Commission filing.The move adds to a steady drip of closures that now add up to more than 260 for the year, leaving the company with more than 1,100 remaining locations.The iconic American department-store chain has buckled under pressure from online competitors, having failed to reinvent its brick-and-mortar experience.Sears acknowledged in March that there was \"substantial doubt\" it would survive on its own, though the company said its cost-cutting maneuvers and other retail strategies would greatly improve its chances of carrying on. CEO Eddie Lampert has since blasted critics and said Sears is \"fighting like hell.\"Related:Sears Holdings has already shed $1 billion in costs this year, mostly through stores closures, and raised cash by selling its Craftsman brand to Stanley Black & Decker.The latest round of stores will begin liquidation sales by June 30 and will close by mid-September, Sears said in a statement. \"We understand that members may be disappointed when we close a store, but our Shop Your Way membership platform, websites and mobile apps allow us to maintain these valued relationships long after a store closes its doors,\" the company said. \"As a result, we hope to maintain and even grow our relationships with the members who shopped this location.\"Business Insider reported that the list of stores set to close includes three in Ohio, three in New York, two in Texas and two in Maryland. USA TODAY could not immediately confirm those locations.The company was spending about $11.2 million annually in rent on the 20 leases, according to Seritage, which was formed in 2015 in a sale-leaseback deal that provided Sears with financial aid and real-estate flexibility.The company will owe Seritage one year of rent plus one year of annual operating expenses as an early termination fee.A Seritage spokesperson declined to comment.Lampert's investment firm owns 43.5% of the limited partnership units of Seritage and controls 7.9% of its voting power.The move was similar to transactions favored by investors in legacy retailers whose real estate is considered more valuable than their actual business.Follow USA TODAY reporter Nathan Bomey on Twitter @NathanBomey.", "dateOfCollection": "2017-06-23T15:44:37Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "A camera found at a Goodwill store in Portland, Ore., revealed never-before seen images of Mount St. Helens eruption.", "title": "Camera found at Goodwill reveals forgotten photos of Mount St. Helens eruption", "url": "https://www.usatoday.com/story/tech/nation-now/2017/06/23/camera-found-goodwill-reveals-forgotten-photos-mount-st-helens-eruption/422778001/", "numberOfLinks": 9, "author": "Mary Bowerman", "publishedAt": "2017-06-23T15:04:38Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/aa5d4c60ce440be71daf98f6d1c85c55190ad801/c=0-22-1021-599&r=x1683&c=3200x1680/local/-/media/2017/06/23/USATODAY/USATODAY/636338015971207653-helens051815x005.jpg", "article": "A camera found at a Goodwill store in Portland, Ore., revealed long-forgotten images of the Mount St. Helens eruption. Photographer Kati Dimoff told KIRO-TV that she often finds old cameras and develops the film she finds inside. In May, she found an Argus C2 camera at Goodwill. Like always, she dropped the film from the camera off to be developed, and told KIRO-TV that when she picked the pictures up a note was scrawled on the back of the packet. \"Is this from the Mount St. Helen eruption?\" More coverage: The images include shots showing Mount St. Helens from a distance, and others showed a larger ash cloud, according to Dimoff. Thirty-seven years ago, Mount St. Helens erupted in Washington, spewing ash, rock, and hot gasses into the air and causing mud to flow down the mountainsides.The eruption took place on May 18, 1980, at 8:32 a.m. PT and was \"the deadliest and most economically destructive volcanic event in the history of the United States,\" according to the National Oceanic and Atmospheric Administration.The eruption killed 57 people and caused more than a billion dollars in damage. Ash blanketed the Pacific Northwest and stretched into 11 states and Canada. Fatalities included photojournalist Reid Blackburn, a USGS volcanologists named David Johnston and Harry Truman, a lodge owner in his 80s who rose to fame after he refused to leave the mountain in the weeks preceding the eruption.“Another shot included a family in a backyard, who I'm hoping know the story of the camera,\" she told KIRO-TV. After the photos were posted byThe Oregonian, Mel Purvis, contacted the news outlet and said he is in the pictures with his wife, son and grandmother. He believes the camera belonged to his grandmother, and Dimoff is planning to mail the camera and prints to him, The Oregonian reported. \"I almost fell out of my chair [when I saw the photos],\" Purvis told The Oregonian. \"That's me.\"Follow Mary Bowerman on Twitter: @MaryBowerman This is an aerial view of the \neruption of Mount Saint Helens, Skamania County, Washington on May 18, 1980. (Photo: Courtesy of United States Geological Survey  via Earth Science World Image Bank)", "dateOfCollection": "2017-06-23T15:44:37Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Disgraced former leader of \"The  Big Red One\" is reprimanded and stripped of rank for inappropriate relationship  with  junior woman on his staff", "title": "Disgraced Army general fired after 'inappropriate' relationship  with young woman on staff", "url": "https://www.usatoday.com/story/news/politics/2017/06/23/disgraced-army-general-fired-after-inappropriate-relationship/422902001/", "numberOfLinks": 4, "author": "Tom Vanden Brook", "publishedAt": "2017-06-23T13:59:46Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/33944dcb75598154bb4b7c9f5e463fe87a3f2bf2/c=0-69-799-521&r=x1683&c=3200x1680/local/-/media/2017/06/23/USATODAY/USATODAY/636338063493948284-Wayne-Grigsby-photo.jpg", "article": "WASHINGTON — The Army has stripped a disgraced former division commander of one star and forced him to retire for having an inappropriate relationship with a female captain on his staff.Wayne Grigsby will leave the service as a one-star general, the Army announced nine months after it fired him from commanding the First Infantry Division in September 2016. Grigsby had been weeks away from deploying to Iraq when the Army recalled him to Washington. He became the first division commander to be relieved in more than 45 years.In a stinging letter of reprimand, Gen. Daniel Allyn, the vice chief of the Army, wrote that the “manner and frequency” of his communication with the woman compromised the chain of command and created the perception that she was given preferential treatment. Allyn noted that Grigsby had been warned by his top aides about the public appearance of the relationship but continued.“In doing so, you placed your personal interests above those of the unit as it prepared for combat,” Allyn wrote.Grigsby, in a statement, apologized and said he “volunteered” to be retired at the lower grade. The Army requires that officers retire at the last grade they served satisfactorily.\"While I am embarrassed and disappointed in myself, I am more deeply troubled by the pain I know that I have caused my family, the First Infantry Division, the United States Army and all those with whom I have served our nation these past 35 years,” Grigsby said in his statement. “To them, I offer my sincerest apologies.”The Washington Post first reported Grigsby’s punishment.In September, the Army issued a brief statement in September announcing that Grigsby had been fired from his post leading the “Big Red One.” The division has seen combat some of the America’s bloodiest battlefields from the Argonne Forest in World War I to D-Day in World II to Vietnam, Iraq and Afghanistan. Grigsby joins a growing list of rising stars in the military laid low for misconduct in the last year. The Army has stripped ranks from former Lt. Gen. Ron Lewis, the former top military adviser to the Defense secretary, and Maj. Gen. David Haight, who oversaw military operations in Europe, following investigations into personal failings. Lewis lost his job after running up tabs on his government credit card at strip clubs; Haight’s decade-long affair and “swinging lifestyle” cost him his stars.Like Lewis and Haight, Grigsby had enjoyed steady advancement to the upper reaches of Army leadership. A decorated combat veteran, Grigsby commanded Army infantry units from the platoon to division levels. He led troops in war zones from Kosovo to Iraq to Afghanistan. He also commanded the Combined Joint Task Force-Horn of Africa, a key counter-terrorism post in Djibouti.Grigsby’s affair halted his ascent and left him in a rare and undesirable club. Maj. Gen. James Baldwin was the last division commander to be relieved after an investigation found him negligent in at attack that left 33 dead and 83 wounded at Fire Support Base Mary Ann in Vietnam on March 28, 1971. Read more: ", "dateOfCollection": "2017-06-23T15:44:37Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Bill Clinton signed a law in 1996 barring immigrants from receiving federal benefits, like food stamps and Medicaid.  But the \"proposal\" got cheers in Iowa.", "title": "Trump proposes a law that's existed for 20 years", "url": "https://www.usatoday.com/story/news/politics/onpolitics/2017/06/22/trump-proposes-immigration-law-already-exists/420014001/", "numberOfLinks": 9, "author": "N&#39;dea Yancey-Bragg", "publishedAt": "2017-06-23T03:37:49Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/08c51f58bdd6171aa5798941098afd15188fa47c/c=0-52-1024-631&r=x1683&c=3200x1680/local/-/media/2017/06/22/USATODAY/USATODAY/636337328899779964-Trump-Iowa-Rally.JPG", "article": "President Trump called for a new law barring immigrants from receiving welfare for at least five years at a rally on Wednesday. But neither Trump nor nearly 6,000 of his die-hard supporters seemed to realize that the law has already existed for more than 20 years. Trump received a standing ovation and pledged his administration would put the legislation into effect “very shortly.” “I believe the time has come for new immigration rules which say that those seeking admission into our country must be able to support themselves financially and should not use welfare for a period of at least five years,” Trump told the crowd in Cedar Rapids, Iowa.As The Hill reported, President Bill Clinton signed the Personal Responsibility and Work Opportunity Reconciliation Act in 1996. The law prevents immigrants from receiving federal benefits, such as food stamps, Medicaid, and Social Security for five years after entering the country.There are some exceptions, however, for children and pregnant women, refugees, and active duty military or veterans. It’s possible Trump could introduce tougher limitations and regulations on top of the existing law. Trump also came under fire for telling the rally crowd in Cedar Rapids that he doesn’t want a poor person to run the economy. He was defending his selections of billionaire Wilbur Ross and multimillionaire Gary Cohn as parts of his economic team.In addition to the cheering crowds, Trump's rally also drew about 250 protesters who voiced their dissent from about a block away. More: Trump: I didn't record secret tapes of James Comey  ", "dateOfCollection": "2017-06-23T15:44:38Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "What were the Bulls doing?", "title": "NBA Draft 2017: LaVar Ball leads our look at high- and low-key winners and losers", "url": "http://ftw.usatoday.com/2017/06/nba-draft-2017-lavar-ball-winners-losers-76ers-process", "numberOfLinks": 64, "author": null, "publishedAt": "2017-06-23T13:19:19Z", "urlToImage": "https://usatftw.files.wordpress.com/2017/06/winnerslosers.jpg?w=1200", "article": "\n\n\tBy Adi Joseph\nJune 23, 2017 4:39 am\n\n\n\t\t\t\t\tFollow\t\t\t\t\t@AdiJoseph\t\t\t\t\n!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+'://platform.twitter.com/widgets.js';fjs.parentNode.insertBefore(js,fjs);}}(document, 'script', 'twitter-wjs');\n\n\n\t\tBy: Adi Joseph\t\t| June 23, 2017 4:39 am\t\t\n\n\n\t\tFollow @AdiJoseph\t\n!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+'://platform.twitter.com/widgets.js';fjs.parentNode.insertBefore(js,fjs);}}(document, 'script', 'twitter-wjs');\n\n\nThe 2017 NBA Draft came with a flurry of trades and very few to no stunning picks. Teams mostly did pretty well, while very few completely owned the night.With that in mind, For The Win decided to approach the traditional winners-and-losers column a bit different. Here are four high-key winners and losers — people very obviously impacted in a major way — along with four low-key winners and losers, who may have flown below the radar.\n\n\t\t\t\tThe Minnesota Timberwolves should be the Golden State Warriors' biggest threat now\t\t\t\n\n\n\t\t\t\tLeBron laughs at former Cavs teammates who doubted him after 2003 NBA Draft\t\t\t\n\n\n\t\t\t\t17 fantastic GIFs that came up for athletes using #FirstGifComesUpForYourName\t\t\t\n\nJune 23, 2017 11:09 am \n·\n\nNina Mandell \nThis is everything. \nJune 23, 2017 11:07 am \n·\n\nCharles Curtis \nThe Hall of Famer got teary with Michael Strahan while speaking about his recent trip. \nJune 23, 2017 10:25 am \n·\n\nMichelle R. Martinelli \nMaking history for Israel, his first Cup Series race is the Toyota/Save Mart 350 at Sonoma Raceway. \nJune 23, 2017 10:20 am \n·\n\nCharles Curtis \nIt happened again. \nJune 23, 2017 9:50 am \n·\n\nMichelle R. Martinelli \nHe’s well aware he’s never won at the California track.  \nJune 23, 2017 9:48 am \n·\n\nNina Mandell \nTrust the process. \nJune 23, 2017 9:09 am \n·\n\nAlysha Tsuji \nCheck out what you missed! \nJune 23, 2017 8:50 am \n·\n\nAdi Joseph \nThe Timberwolves could outlive even the super team by the Bay. \nJune 23, 2017 8:20 am \n·\n\nCharles Curtis \nHe was both booed and given love on Thursday night. \nJune 23, 2017 7:34 am \n·\n\nCharles Curtis \nIs Jackson listening? \n\t\t\t\t\tThanks for signing up.\n\t\t\t\t\tYou'll be waking up a little more awesome tomorrow.\n\t\t\t\tDennis Rodman breaks down during 'GMA' interview about North Korea visitFans dig up draft pick's old anti-Thunder tweet, which is now a yearly draft traditionSomeone forgot to proofread Markelle Fultz's sponsored Instagram postNBA Draft 2017: LaVar Ball leads our look at high- and low-key winners and losersThe Minnesota Timberwolves should be the Golden State Warriors' biggest threat nowLeBron laughs at former Cavs teammates who doubted him after 2003 NBA DraftSnaps of the week: Steph Curry modeled in Hawaii, LeBron James listened to Mobb Deep nonstopLaVar Ball gave the most LaVar Ball interview after Lonzo was drafted by the LakersDennis Rodman breaks down during 'GMA' interview about North Korea visitGolfers outraged after Donald Trump commits golf's 'unforgivable' sinWhat were the Bulls doing? ", "dateOfCollection": "2017-06-23T15:44:38Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "The 2020 presidential campaign is more than 1,200 days away, but President Trump held yet another Make America Great Again rally — this time in Cedar Rapids, Iowa.", "title": "Fact check: Trump makes misleading claims at Iowa rally", "url": "https://www.usatoday.com/story/news/politics/2017/06/23/fact-check-trump-makes-misleading-claims-iowa-rally/103131784/", "numberOfLinks": 48, "author": "Robert Farley, Eugene Kiely, Brooks Jackson and Lori Robertson", "publishedAt": "2017-06-23T14:25:53Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/e8161554a8b13f225f3371ae9ffbc2f6f0550414/c=0-256-2496-1666&r=x1683&c=3200x1680/local/-/media/2017/06/23/USATODAY/USATODAY/636338050363500115-XXX-0621-31-TrumpCR-KK.JPG", "article": "The 2020 presidential campaign is more than 1,200 days away, but President Trump held yet another Make America Great Again rally — this time in Cedar Rapids, Iowa. And, as he did in past campaign speeches, Trump spoke for a long time and reeled off numerous false and misleading claims:The president visited Iowa on June 21, making an official stop first at Kirkwood Community College in Cedar Rapids to talk about agriculture. Later that evening, Trump spoke to a large crowd in the nearby U.S. Cellular Center at a political rally organized by his campaign.At his rally, Trump exaggerated when he claimed that his administration had deported MS-13 gang members “by the thousands.” It is by the hundreds, not thousands.Trump, June 21: \"The other thing that I have to tell you. You have a gang called MS-13. … These are true animals. We are moving them out of the country by the thousands, by the thousands.\"Trump is referring to the Mara Salvatrucha, or MS-13, a gang that was formed by Salvadoran immigrants in Los Angeles in the 1980s. In April, Attorney General Jeff Sessions said that there are 10,000 MS-13 gang members in the United States. That made us skeptical of the claim that “thousands” already had been deported.We asked the White House how many gang members have been removed under the Trump administration, but it declined to comment.However, The Washington Post on May 24 wrote that this year the U.S. has deported 398 gang members to El Salvador “compared with 534 in all of 2016, according to Salvadoran government statistics.” Those figures represent members of all El Salvador gangs, such as MS-13 and the 18th Street gang. MS-13 is “primarily El Salvadoran,” according to a 2005 National Gang Threat Assessment report by the National Alliance of Gang Investigators Association, though it’s possible there are members from other countries.Danielle Bennett, a spokeswoman for the U.S. Immigration and Customs Enforcement, told us in an email that so far in fiscal year 2017 — from Oct. 1, 2016, to June 4, 2017 — ICE has removed 2,798 gang members. But that includes all gang members, not just MS-13 members. She said ICE “does not track gang removals by specific gang,” so it does not know how many of the 2,798 were MS-13 members. The 2,798 removals also span both the Obama and Trump administrations, so not all of the FY 2017 deportations occurred under Trump.By contrast, there were 2,057 gang members deported in fiscal 2016, so there has been an increase this fiscal year. We don’t know how much of that is attributable to Trump’s policies, but Bennett said that ICE under the Trump administration “does specifically target MS-13 members for arrest and removal.” That appears to be corroborated by the statistics from El Salvador published in the Post.Bennett also said that ICE Homeland Security Investigations has made 602 criminal arrests and 170 administrative immigration arrests of MS-13 members so far in fiscal year 2017, as of June 4. But those figures include arrests made under both administrations, and the criminal arrests include citizens and noncitizens alike. For example, ICE reported last month that it arrested 104 MS-13 gang members as part of a six-week anti-gang enforcement operation that resulted in 1,378 arrests from March 26 to May 6. But nearly two-thirds of all those arrested were U.S. citizens, so most would not have been eligible for deportation.Trump can take credit perhaps for cracking down on gang members and increasing the deportation rate of gang members from El Salvador. But he exaggerates when he says he is deporting MS-13 gang members “by the thousands.”In the farming state of Iowa, Trump repeatedly played on the mythical claim that the federal estate tax is keeping family farms from being passed on to the next generation of farmers.First, in his speech at Kirkwood Community College in Cedar Rapids, the president said:Trump: \"I want to make sure the next generation of Americans has that opportunity [to live on a farm] as well. And, in particular, that includes your children and your grandchildren, and [we are] working very hard to get rid of the death tax so that those farms can be passed on.\"And at his rally later that evening, he said the estate tax should go because, “You should have a right to pass your farm onto your children and onto your grandchildren.”The fact is, however, that more than 99% of all farms are expected to be passed on without paying any estate tax at all. Repeal of the federal estate tax would benefit only the very wealthiest multimillionaires. And even the few who owe any tax may spread payments out over more than a decade.A March 15 study by the Economic Research Service of the U.S. Department of Agriculture estimated that 38,328 farms would become part of estates in 2016, of which only 0.42% — 161 estates — would owe any estate tax at all.All of those would be multimillion-dollar farms; only estates worth $5.45 million or more must file a return, and most of them don’t owe any tax. For those who do owe tax, the study estimated that the average effective rate would be 20% — with the option of spreading payments over 14 years.Separate research by the nonpartisan Tax Policy Center puts the number even lower. TPC estimates that only 50 farms and closely held businesses will pay any estate tax in 2017.And regardless of whether the number is 161 or 50, those farm estates that owe any tax at all have the option to spread installments over 14 years at reduced interest rates.When we wrote about this estate-tax myth in 2015, we reached out to Neil Harl, an Iowa State University professor of economics and agriculture, who has been studying the estate tax’s impact on small businesses and farms for decades.“I have been involved in this area since 1958 and I have never seen land that had to be sold to pay the federal estate tax and I have conducted more than 3,400 seminars in 43 states which included federal estate tax planning,” Harl wrote to us in an email. The italics were his. And for this article, we checked back with him, and he said that is still the case.“The lobbyists early on, I am told, concluded farmers as a group are more highly respected than billionaires, at least on this issue,” he added.Trump wrongly claimed that “all” insurance companies have left the individual market in Iowa. In fact, Medica Health announced on Monday that it would stay in the market statewide.The president further claimed that insurers are “leaving all of the states.” There are currently 44 counties in three states with no insurer for 2018, according to the Kaiser Family Foundation.Trump: \"In fact, I was just told by your great governor and ex-governor that your insurance companies have all fled the state of Iowa. Pretty sad, isn’t it? Well, they’re — I’ll tell you what, they’re going from every state. They’re leaving all of the states.\"Iowa’s individual insurance marketplace — where those who get Affordable Care Act subsidies buy their own insurance — has had a shaky outlook for 2018. Before Medica’s announcement on Monday, the state was unsure if the insurance carrier would participate next year. Two other insurers — Aetna and Wellmark — had already said they wouldn’t sell plans on the state marketplace in 2018, leaving Medica as potentially the sole statewide insurer. (Gundersen Health Plan sells policies in five of the state’s 99 counties, Iowa’s Insurance Division says.)Iowa’s Insurance Division said it was “unlikely these carriers will remain” in 2018 and proposed on June 12 to the federal Centers for Medicare & Medicaid Services a “stopgap measure” to retool the state’s ACA marketplace, where 72,000 Iowans now get coverage. That stopgap measure would change the income-based tax credits to age- and income-based assistance; create one plan rather than the metal levels of the ACA (bronze, silver, gold, platinum); and add funding to a state reinsurance program to help insurers cover high-cost individuals.Iowa’s Insurance Division confirmed to FactCheck.org that Medica was the only insurer to file 2018 proposed rates by this week’s deadline; Gundersen did not.Medica’s announcement was widely reported, and it said its 2018 plans would come with a 43% average premium increase. Iowa Insurance Commissioner Doug Ommen said the state would still move forward with the stopgap proposal, and he expressed concern about Medica’s average rate increase driving away younger and healthier policyholders.Medica CEO John Naylor told CNBC on June 16 that the company wanted certainty from the federal government on whether cost-sharing subsidies for low-income individuals would continue. In late May, the Trump administration and House of Representatives asked for a 90-day delay to the federal lawsuit on the matter, according to Politico.“When the federal government set out certain rules, our expectations are that these rules are followed,” Naylor told CNBC. “So as we look at pricing we need to know are those rules going to be enforced in 2018.”Trump greatly exaggerated when he claimed that insurance companies are “leaving all of the states.” As of June 21, there were 44 counties, with 31,268 insurance enrollees, at risk of having no insurance carrier for 2018, according to an analysis by the Kaiser Family Foundation, which relied on state rate filings and media reports. Those counties are in three states: Ohio, Missouri and Washington. However, the analysis notes that the insurer Centene said it would expand its insurance business in several states, including those three, but hasn’t detailed exactly where.“Insurer participation in 2018 will not be finalized until fall of 2017,” KFF says.Trump again claimed he has reversed the trend of coal mining job losses, and misleadingly pointed to the opening of a new coal mine in Western Pennsylvania as evidence that his policies have led to a resurgence in coal mining. Neither of those is true.Trump, June 21: \"And we’ve ended the war on clean, beautiful coal. And we’re putting our miners back to work. In fact, you read about it, last week a brand new coal mine just opened in the state of Pennsylvania, first time in decades, decades. We’ve reversed – and 33,000 mining jobs have been added since my inauguration.\"In fact, there has been an increase of about 1,000 coal mining jobs since January, according to the Bureau of Labor Statistics. For some perspective, there has been a total loss of nearly 40,000 coal mining jobs over the last five years.How does Trump get to 33,000? After talking specifically about coal mining, Trump cites a figure for all mining jobs – including gas, oil, metal ores, coal and nonmetallic mineral mining and quarrying. There have been 32,600 total mining jobs added since January. We wrote about this issue once before when EPA Administrator Scott Pruitt tried a similar sleight of hand.As for the grand opening of the Corsa Coal Company’s Acosta Deep Mine near Pittsburgh on June 8, that had nothing to do with Trump’s efforts to roll back coal regulations. As we wrote when Trump made similar boasts earlier this month, development of the Acosta mine began in September, two months before Trump’s election victory.Industry experts also tell us it is not emblematic of a resurgence of coal mining.The Acosta mine produces a particular type of coal that is used to make steel. That’s a bit of a niche market in the coal industry, accounting for just 10% of coal production in the U.S. There has been a surge in demand for this kind of coal because of production problems overseas.However, the vast majority of coal produced in the U.S. is thermal coal, the kind used to generate electricity. Consumption of that kind of coal has declined by nearly 18% between 2012 and 2016, mostly due to the surge in cheaper natural gas production driven by the shale revolution and to competition from renewable energy.Environmental regulations — which Trump has targeted — also hurt coal mining, but according to an April report from Columbia University’s Center on Global Energy Policy, those regulations were a “significantly smaller factor” in the shrinking of the coal industry. Industry experts say Trump’s efforts to roll back those regulations might stem the decline in coal consumption, but would not bring coal mining jobs back to levels seen even a few years ago.Trump touted his decision to withdraw from the Paris Agreement, which he said would have been an economic “catastrophe” for the U.S. The agreement, which took effect last year, was signed by 195 countries and primarily aims to keep warming “well below 2°C above pre-industrial levels” and to pursue “efforts to limit the temperature increase to 1.5°C.”The president pushed back at critics who said the pact is nonbinding.“And they all say it’s nonbinding,” he said. “Like hell it’s nonbinding. When we get sued by everybody because we thought it was nonbinding, then you can tell me it was nonbinding.”There are aspects of the agreement that are legally binding. Todd Stern, a former U.S. special envoy for climate change, explained in a press conference shortly before the agreement was reached that countries must submit “nationally determined contributions” that outline their emissions targets and report actions taken to meet those targets. But meeting emissions targets wasn’t one of the legal requirements.Stern, Dec. 2, 2015: \"We’ve made our position clear all year long that we support an agreement that’s legally binding in many respects, including the elements of accountability of the agreement, the requirement to put forward a target, to do it with information that clarifies it, the obligation to report and be reviewed on your inventories and the actions you’re taking in order to meet your target. Any number of rules and so forth. So a whole number of elements that are legally binding, but not the target itself.\"Stern wrote a May 8 op-ed for The Washington Post urging Trump to stay in the Paris Agreement. He said the president should “keep in mind that — as much as I would be sorry to see any retrenchment — countries can adjust their emissions targets downward. The agreement permits it, and I know because I helped negotiate that flexibility.”Trump said he was promoting legislation that would bar new immigrants from receiving welfare for five years, but a 20-year-old law already does that. He introduced his proposal after promising to preserve the “safety net” for people who “truly need help.”Trump, June 21: \"But others don’t treat us fairly. That’s why I believe the time has come for new immigration rules which say that those seeking admission into our country must be able to support themselves financially and should not use welfare for a period of at least five years. And we’ll be putting in legislation to that effect very shortly.\"But as The Hill pointed out, such a law already exists. The Personal Responsibility and Work Opportunity Reconciliation Act, signed into law in 1996 by then-president Bill Clinton, states that immigrants are “not eligible for any Federal means-tested public benefit for a period of 5 years beginning on the date of the alien’s entry into the United States.” That would include such benefits as food stamps, Medicaid and Social Security.As USA TODAY noted, there are some exceptions in the law for children and pregnant women, refugees, and active duty military or veterans. It’s possible, the story notes, that Trump is seeking to toughen the restrictions, or to eliminate some exceptions. Trump’s proposed FY 2018 budget notes that refugees are exempt from the five-year waiting period, and stresses the need to control the cost of benefits paid to immigrant-headed households. But it offered no details on how that would be accomplished beyond reducing the number of refugees, curbing illegal immigration and increasing merit-based legal immigration.We reached out to Trump’s press office for clarification, but it declined to provide any information on the record.Trump also repeated the claim that the U.S. already has spent $6 trillion in the Middle East since 2001. It hasn’t.Trump, June 21: \"After decades of rebuilding foreign nations all over the world, we are now rebuilding our nation. As of a few months ago, our country has spent $6 trillion in the Middle East, wasted. … We started 16 years ago and it’s in far worse shape than it was 16 years ago by many times over. So, we spent all of this money, all of these lives.\"Actually, the U.S. has spent about $1.7 trillion through fiscal year 2016, which ended Sept. 30, 2016, according to a February report by the nonpartisan Congressional Research Service.During the campaign, Trump made the $6 trillion figure a talking point. For example, in Philadelphia, he gave a speech in which he said, “We must declare our independence from a failed establishment that has squandered $6 trillion on foreign wars in the Middle East that never end and that we never win and that have made us less safe.”His campaign at the time cited a Reuters news article about a study that projected the wars in Iraq and Afghanistan will cost the U.S. $6 trillion “over the next four decades.” The story said the cost estimate included “future commitments, such as the medical and disability claims of U.S. war veterans.”It may be that the wars eventually will cost the U.S. $6 trillion. However, Trump said the U.S. “has spent $6 trillion” (past tense) as of “a few months ago.” That’s not accurate.Read more:", "dateOfCollection": "2017-06-23T15:44:38Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "The song choices are not subjective, but the ranking sure is.", "title": "Ranked: Every 'song of the summer' from the past 20 years", "url": "https://www.usatoday.com/story/life/entertainthis/2017/06/22/ranked-every-song-summer-past-20-years/103093984/", "numberOfLinks": 10, "author": "Maeve McDermott", "publishedAt": "2017-06-23T15:16:32Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/9b2f93082c0c78a2388bc8ebb282871ff3716c9a/c=0-29-800-481&r=x1683&c=3200x1680/local/-/media/2017/06/22/USATODAY/USATODAY/636337195978130966-song-of-summer-composite.png", "article": "Many artists have earned a \"song of the summer,\" but only one track is the best (Photo: Getty/PWC/FIlmMagic.)Summertime requires its own soundtrack. And every year, pop stars compete to deliver the \"song of the summer,\" the track that defines the season on the charts and in listeners' memories.Officially, the song of the summer is the track that spends the most time atop the Billboard Hot 100 between Memorial Day and Labor Day. The songs on this list weren't chosen by personal tastes; all of the tracks shown below were the top-charting hits on the Hot 100 for their respective summers, objectively, based on charts data. So if a favorite song isn't included below, pick a fight with the Billboard charts, not the list.It's too early in the season to choose this year's song of the summer, though Despacito has dominated the season's charts thus far. In the meantime, we've analyzed the last 20 years worth of songs of summer, identifying the best and worst singles of years past. Some of these songs are still classics today, and would fit perfectly on any beach or cookout playlist. As for some of the other tracks — what were we thinking?20. Party Rock Anthem, LMFAO feat. Lauren Bennett & GoonRock (2011)After subjecting us to hearing \"Every day I'm shufflin'\" on loop for an entire summer, the neon-clad, uncle-nephew duo LMFAO put listeners out of their misery in 2012, announcing their indefinite hiatus.19. I Kissed A Girl, Katy Perry (2008)2008 was a different time, before social media grew into a powerful tool fans used to instantly flame pop stars for their missteps, and I Kissed a Girl's icky queerbaiting likely would've fared worse today against Internet skeptics.18. Bent, Matchbox Twenty (2000)Matchbox Twenty make plenty of good songs and Unwell and 3 a.m. are classics of the ‘90s micro-genre the band inhabited. Unfortunately, Bent isn't their best.17. Fancy, Iggy Azalea feat. Charli XCX (2014)Fancy will be remembered more as the song that introduced Iggy Azalea to the public consciousness, and less for its actual quality.16. Cheerleader, OMI (2015)2015 was a particularly dull year for summertime releases, save for Fetty Wap's Trap Queen, which peaked too early in the year. But according to the listeners that sent Cheerleader to No. 1, OMI's breakthrough single was the best of the worst.15. Genie In A Bottle, Christina Aguilera (1999)Xtina is a '90s icon, but nostalgia isn't enough to earn one of her duller hits a higher ranking.14. Promiscuous, Nelly Furtado feat. Timbaland (2006)As mortifying  as the lyrics of this song can be, Nelly Furtado is as good a rapper as Iggy Azalea, if not better, and her Timbaland duet is bizarrely enjoyable.13. California Gurls, Katy Perry feat. Snoop Dogg (2010)12. One Dance, Drake feat. WizKid & Kyla (2016)Drake's dancehall phase produced a string of enjoyable singles. And while One Dance may not have been better than Controlla or Too Good with Rihanna, the rapper was on top of the world in 2016, which rightfully included a song of the summer.11. I'll Be Missing You, Puff Daddy and Faith Evans feat. 112 (1997)I'll Be Missing You was an elegy for Notorious B.I.G, and thanks to its May release date, one of rap's most depressing hits also became the year's song of the summer. While it's a classic, it maybe doesn't belong on your pool-party playlist.10. I Gotta Feeling, The Black Eyed Peas (2009)Is there another track that has compelled as many secular listeners to scream \"Mazel Tov!\" across the dance floor as the David Guetta-produced hit? I Gotta Feeling isn't a great song, but that doesn't mean it's not iconic.9. We Belong Together, Mariah Carey (2005)Another weirdly emo choice to hit No. 1, We Belong Together is an essential later-era Mariah Carey hit and well-deserving of its song of the summer title.8. The Boy Is Mine, Brandy & Monica (1998)Monica has confirmed in interviews that she and Brandy won't be releasing an updated version of the song, and rightfully so — it's a '90s R&B classic.7. Call Me Maybe, Carly Rae Jepsen (2012)Call Me Maybe is the archetype of the modern song of the summer, an earworm that listeners can't escape, no matter how they try. And yet, we were always glad to hear Call Me Maybe, which launched the career of one of pop's most effervescent stars.6. Confessions Part II, Usher (2004)Both of Usher's songs-of-summer winners earned top placement on this list. His Confessions album is a classic, and Confessions Part II still has fun with its tortured narrative of infidelity, but the song isn't exactly feel-good summer material.5. U Remind Me, Usher (2001)A wistful summertime classic, Usher's earlier hit gets the nod for being a little more upbeat than Confessions Part II. 4. Umbrella, Rihanna feat. Jay-Z (2007)Rihanna may earn her second song of the summer with her current DJ Khaled collaboration, Wild Thoughts, but Umbrella, which remains her all-time-best collaboration, sets a high bar.3. Blurred Lines, Robin Thicke feat. T.I. and Pharrell (2013)Upon Blurred Lines' release, some listeners were quick to point out the track's less-than-feminist politics. Unfortunately, it's still a great song; so good that it inspired a failed lawsuit from Marvin Gaye's estate for sounding too similar to Marvin's Got to Give It Up. At least they chose a summer classic to kinda-plagiarize.2. Hot In Herre, Nelly (2002)Of all the tracks on this list, Hot in Herre is the most inseparable from summer, sweaty to the point that it's almost cloying. The lyrics' middle school-level lewdness  are less sexy than endearing. But for all its goofy nostalgia, Nelly's 2002 hit is a quintessential summertime song.1. Crazy In Love, Beyoncé feat. Jay-Z (2003)Not only did Beyoncé make the best song of the summer of the modern era, but she did it with her debut solo single. Crazy in Love was the first track Beyoncé shared from 2003's Dangerously in Love, and it's as perfect now as it was then, all horn blasts and clattering hi-hats as Bey tells a story of a girl in love.", "dateOfCollection": "2017-06-23T15:44:39Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Despite a ruling that his confession was coerced, Brendan Dassey isn't free yet. The state of Wisconsin can retry him or appeal to the Supreme Court.", "title": "Conviction of 'Making a Murderer' defendant Brendan Dassey overturned", "url": "https://www.usatoday.com/story/life/tv/2017/06/23/conviction-making-murderer-defendant-brendan-dassey-overturned/103132758/", "numberOfLinks": 6, "author": "Andy Thompson and Alison Dirr", "publishedAt": "2017-06-23T13:48:22Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/f0541044a675b5b5409adf524ed8d1c5f67f967e/c=0-21-2055-1182&r=x1683&c=3200x1680/local/-/media/2017/06/23/USATODAY/USATODAY/636338077734874468-AP-Making-a-Murderer-Dassey.jpg", "article": "CHICAGO — A federal appeals court has affirmed a judge's ruling that overturned the murder conviction of Brendan Dassey, who was featured in the Netflix series Making a Murderer.In a 2-1 ruling issued Thursday afternoon, the U.S. Court of Appeals for the 7th Circuit upheld the August 2016 decision by U.S. Magistrate William Duffin of Milwaukee.Duffin found that Dassey’s constitutional rights were violated because investigators for the prosecution made false promises during multiple interrogations.In overturning the conviction, Duffin ruled that investigators made “repeated false promises” that, “when considered in conjunction with all relevant factors, most especially Dassey’s age, intellectual deficits and the absence of a supportive adult, rendered Dassey’s confession involuntary.”Read more:Dassey was convicted in the 2005 murder of photographer Teresa Halbach. His uncle, Steven Avery, also is serving a life term in connection with the killing. Avery also is appealing his conviction.The state appealed Duffin's ruling, putting the case before the federal appeals panel.Thursday's ruling doesn't necessarily mean Dassey will be freed from prison. The state can appeal to the U.S. Supreme Court or retry Dassey.\"We are evaluating the 2-1 decision from the court,\" said Johnny Koremenos, director of communications and public affairs for the Wisconsin Department of Justice. \"We anticipate seeking review by the entire 7th Circuit or the United States Supreme Court and hope that today’s erroneous decision will be reversed.\"Dassey's attorneys said the ruling took their client one step closer to freedom.“As of today, Brendan has been locked up for 4,132 days,\" said one of his attorneys, Laura Nirider. \"For the first time, this decision brings the end of that road in sight. We’re not there yet.\"Nirider stressed that the court’s ruling sent a strong message that the majority of the panel believed in Dassey’s innocence. “This is a confession that nobody can have any faith in.”Read more:Another of his attorneys, Steven Drizin, said Thursday’s ruling should send a loud message to state district courts and state appeals courts, which initially upheld Dassey’s 2007 murder conviction.“In evaluating whether a confession is voluntary, courts must engage in the kind of searching and analysis that the federal courts performed, that the state courts did not.”Dassey's attorneys are evaluating their next steps to secure his release.The case was the subject of the hit docu-series Making a Murderer, a Netflix production that was released in December 2015.Dassey was 16 years old when he was questioned — and later charged — in connection with Halbach’s murder.Nirider said during oral arguments before the 7th Circuit in February that there was a \"drumbeat of promises\" from investigators before \"every major admission\" made by Dassey.\"They fed him the answers they were looking for when he didn't give them the information they wanted to hear,” Nirider told the three-judge panel.The state countered that Dassey’s confession was not coerced because the investigators who questioned him never made him any explicit promises.Thursday's majority opinion discussed a \"pattern of suggestive questioning\" throughout the March 1 interrogation of Dassey.The ruling stated that prosecutors' case against Dassey in the original trial rested almost entirely on Dassey's interviews with police and one phone call with his mother — but no physical evidence.\"There was no physical evidence linking Dassey to the murder of Halbach — investigators did not find any of Dassey’s DNA or blood on any of the many objects that were mentioned in his confession — the knives in Avery’s house, gun, handcuffs, bed, RAV4, key or automotive dolly,\" the decision states.The judges said the state appellate court ignored \"many signs\" that Dassey was trying to please investigators and a clear pattern of fact-finding and promises.\"By doing this — by linking promises to the words that the investigators wanted to hear, or allowing Dassey to avoid confrontation by telling the investigators what they wanted to hear — the confession became a story crafted by the investigators instead of by Dassey,\" the ruling states.Contributing: John Ferak; follow Andy Thompsonon Twitter: @Thompson_AW; follow Alison Dirr on Twitter: @AlisonDirr", "dateOfCollection": "2017-06-23T15:44:39Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "A study found a correlation between some states with legalized recreational marijuana use and the frequency of collision claim reports.\r\nVideo provided by Newsy", "title": "There could be a link between car wrecks and marijuana", "url": "https://www.usatoday.com/videos/news/health/2017/06/23/there-could-link-between-car-wrecks-and-marijuana/103133484/", "numberOfLinks": 1, "author": "Newslook", "publishedAt": "2017-06-23T10:20:16", "urlToImage": "https://www.gannett-cdn.com/-mm-/8053d91dc9a2258a0283ca7a3f06eb1e3cc2b513/r=x1803&c=3200x1800/https/videos.usatoday.net/Brightcove3/29906170001/201706/2805/29906170001_5481354895001_5481341374001-vs.jpg?pubId=29906170001", "article": "", "dateOfCollection": "2017-06-23T15:44:42Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "View videos and photo galleries from USA TODAY", "title": "Pres. Bush: Vets Are &#39;Tremendous National Asset&#39;", "url": "http://www.usatoday.com/videos/news/nation/2017/06/23/pres.-bush:-vets-&#39;tremendous-national-asset&#39;/103134866/", "numberOfLinks": 0, "author": null, "publishedAt": null, "urlToImage": null, "article": "", "dateOfCollection": "2017-06-23T15:44:42Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Twin bombings at a crowded market killed 35 and wounded nearly 100 Friday.", "title": "3 bomb attacks in Pakistani cities kill 35", "url": "https://www.usatoday.com/story/news/world/2017/06/23/pakistan-twin-bombings-market-kill/422938001/", "numberOfLinks": 1, "author": null, "publishedAt": "2017-06-23T13:27:15.525+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/2d759cf20e76a8fa9dc966e297b629b5883402bf/c=0-176-3456-2129&r=x1683&c=3200x1680/local/-/media/2017/06/23/USATODAY/USATODAY/636338088527716836-EPA-epaselect-PAKISTAN-SUICIDE-BOMB-BLAST.jpg", "article": "PESHAWAR, Pakistan — At least 35 people were killed and nearly 100 wounded Friday in three separate bomb attacks in two major Pakistani cities, officials said.A suicide bomber was involved in the first car bombing near the office of the provincial police chief in the southwestern city of Quetta that killed at least 11 people and wounded 20. There were conflicting claims of responsibility for this attack from different extremist groups.Hours later twin bombings, minutes apart, hit a crowded market in a Shiite-dominated city in Parachinar, the main city in the Kurram tribal region and killed 24 people, mostly minority Shiite Muslims, according to government administrator Zahid Hussain.The bomb attacks come a few days before the Muslim holiday of Eid-al-Fitr, which ends the holy month of Ramadan. TV footage showed panicked people rushing to safety following the Parachinar market bombings.Mohammad Amir, an official at a government-run hospital in Parachinar, said they had received 24 dead bodies and more than 20 of the wounded were listed in critical condition.It was unclear who was behind the attack in Parachinar but Sunni militant groups have claimed responsibility for numerous similar attacks in the past.Friday’s car bombing in Quetta, the capital of Baluchistan province, was powerful enough that it was heard across the city, shattering windows on nearby buildings, said police spokesman Shahzada Farhat.Wasim Beg, a spokesman at a government hospital, said the death toll from the bombing had risen to 11 throughout the morning and some of the wounded remained in critical condition.TV footage showed several badly damaged cars and a road littered with broken glass.Hours after the attack, Jamaat-ul-Ahrar, a breakaway faction of the Pakistani Taliban, claimed responsibility. Asad Mansoor, the militants’ spokesman, vowed more such attacks as part of the extremist group’s campaign aimed at imposing Islamic laws in the country.Later Friday, the Islamic State group said in a competing claim that it was behind the attack, adding that one of its followers targeted the police post in Quetta, detonating his suicide belt there. It also released a photograph of the alleged attacker, identified as Abu Othman al-Khorasani.The competing claims could not be reconciled.Anwarul Haq Kakar, a spokesman for the provincial government, blamed neighboring India for the blast but offered no evidence to back up the allegation.Pakistan and India routinely trade charges of interference and inciting attacks on one another’s soil.On Thursday, Pakistan said that an Indian naval officer, Kulbhushan Jadhav, who was sentenced to death by a Pakistani military court on charges of espionage and sabotage, had petitioned for mercy.Jadhav, who Pakistan said had crossed into Baluchistan from neighboring Iran, was arrested in March 2016 and sentenced to death in April.In New Delhi, the Ministry of External Affairs insisted Jadhav was sentenced on “concocted charges” and expressed doubts about the existence of the petition for mercy. It also reiterated that the proceedings against Jadhav have been shrouded “in opacity.”Baluchistan has long been the scene of a low-level insurgency by Baluch nationalists and separatists, who want a bigger share of the regional resources or outright independence, but also attacks blamed on the Pakistani Taliban and others. Those militant groups include Lashkar-e-Jhangvi, which is considered a close ally of IS, as well as Jamaat-ul-Ahrar, which has taken credit for several previous attacks in Baluchistan and elsewhere and has bases in Pakistan’s tribal regions. ", "dateOfCollection": "2017-06-23T15:44:43Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "The family had argued that St. Croix County, Wis., had taken their land and should pay them just compensation for that loss under the Fifth Amendment.", "title": "Supreme Court rules against Wisconsin family's property rights claim", "url": "http://www.jsonline.com/story/news/local/wisconsin/2017/06/23/u-s-supreme-court-rules-against-wisconsin-cottage-owners/419190001", "numberOfLinks": 2, "author": "Bruce Vielmetti", "publishedAt": "2017-06-23T15:08:07.739+00:00", "urlToImage": "", "article": "The U.S. Supreme Court on Friday upheld Wisconsin court rulings that the owners of a family cottage on Lake St. Croix were not entitled to compensation over development regulations that bar the sale of the family's adjacent lot as a site for another home. The Murrs wanted to sell the lot to finance an upgrade to the cottage their parents built 56 years ago, and argued that  St. Croix County has essentially taken their land through strict shoreline development and conservation rules and should pay just compensation for that loss under the Fifth Amendment.But St. Croix County, and the state, say that the family's two adjacent parcels, taken together, would easily accommodate a modern home, and so they have not really lost any value. The government also noted that the original owners were aware of the development restrictions when they sold the lots to their children.The U.S. Supreme Court, in a 5-3 decision, agreed that the Wisconsin courts correctly analyzed the issue as one concerning a single parcel. Justice Neil Gorsuch, who was not on the court during arguments in the case, did not participate.Justice William Kennedy wrote the majority opinion that concluded no Fifth Amendment taking had occurred.Wisconsin courts had upheld the restrictions. The Pacific Legal Foundation heard about the Murrs case and persuaded the U.S. Supreme Court to hear it even though Wisconsin's own high court had refused. The foundation took the Murrs' case for free to seek legal clarity in such \"parcel as a whole\" takings claims.The frustration to the Murrs was that someone had owned a single lot from before the regulations would still be allowed to build on it.But under rules from 1970s, the Murr's empty lot, alone,  does not have enough useable area to get a building permit. The Murrs say that effectively takes the value of their land and they should be compensated.The case had been closely watched by both property rights advocates and governments.  Check back to JSOnline for updates on this story.", "dateOfCollection": "2017-06-23T15:44:51Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "If you’ve never been to disneyland you have a lot to catching up to do… in fact, you’re about 2,000 visits short of Jeff Reitz. Buzz60's Angeli Kakade has the full story.", "title": "California man has made 2,000 consecutive visits to Disneyland", "url": "https://www.usatoday.com/videos/travel/2017/06/23/california-man-has-made-2000-consecutive-visits-disneyland/103134388/", "numberOfLinks": 1, "author": "Buzz60", "publishedAt": "2017-06-23T11:00:21", "urlToImage": "https://www.gannett-cdn.com/-mm-/8053d91dc9a2258a0283ca7a3f06eb1e3cc2b513/r=x1803&c=3200x1800/https/videos.usatoday.net/Brightcove3/29906170001/201706/499/29906170001_5481410851001_5481387421001-vs.jpg?pubId=29906170001", "article": "", "dateOfCollection": "2017-06-23T15:44:55Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "A new generation has been identified that may make some Millennials breathe a sigh of relief. Buzz60's Angeli Kakade (@angelikakade) has the story.", "title": "You could be a Xennial. Here's how to tell", "url": "https://www.usatoday.com/videos/tech/2017/06/23/you-could-xennial.-heres-how-tell/103133486/", "numberOfLinks": 1, "author": "Buzz60", "publishedAt": "2017-06-23T10:20:19", "urlToImage": "https://www.gannett-cdn.com/-mm-/8053d91dc9a2258a0283ca7a3f06eb1e3cc2b513/r=x1803&c=3200x1800/https/videos.usatoday.net/Brightcove3/29906170001/201706/283/29906170001_5481357425001_5481323120001-vs.jpg?pubId=29906170001", "article": "", "dateOfCollection": "2017-06-23T15:44:57Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Decades after Mount St. Helens' deadly 1980 eruption, a photographer found these dramatic images in an old camera at Goodwill.", "title": "Never-before-seen images of Mount St. Helens eruption found", "url": "https://www.usatoday.com/videos/news/have-you-seen/2017/06/23/never-before-seen-images-mount-st.-helens-eruption-found/103134414/", "numberOfLinks": 1, "author": "USA TODAY", "publishedAt": "2017-06-23T11:01:10", "urlToImage": "https://www.gannett-cdn.com/-mm-/8053d91dc9a2258a0283ca7a3f06eb1e3cc2b513/r=x1803&c=3200x1800/https/videos.usatoday.net/Brightcove3/29906170001/201706/243/29906170001_5481395828001_5481395857001-vs.jpg?pubId=29906170001", "article": "", "dateOfCollection": "2017-06-23T15:44:58Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Steve Howe, the husband of Manchester attack victim Alison Howe, embraces family members as Alison's funeral cortege leaves St. Anne's Church in Oldham, England. Alison Howe was among 22 people who died in the suicide bombing at Manchester Arena as she waited in the foyer with her friend Lisa Lees, who also died, as they arrived to pick up their daughters from an Ariana Grande concert.", "title": "The day in pictures", "url": "http://www.usatoday.com/picture-gallery/news/2012/09/09/the-day-in-pictures/1410095/", "numberOfLinks": 1, "author": null, "publishedAt": "2017-06-23T09:46:39.43", "urlToImage": "https://www.gannett-cdn.com/-mm-/986700186163ca05a488611e8c165dd147d0ef76/c=0-192-3790-2333&r=x1683&c=3200x1680/local/-/media/2017/06/23/USATODAY/USATODAY/636338081342958700-GTY-800068128.jpg", "article": "", "dateOfCollection": "2017-06-23T15:45:01Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "", "title": "London high-rise engulfed in flames", "url": "https://www.usatoday.com/videos/news/world/2017/06/23/london-high-rise-engulfed-in-flames/102838058/", "numberOfLinks": 1, "author": null, "publishedAt": null, "urlToImage": "https://www.gannett-cdn.com/GDContent/applogos/usatoday.png", "article": "", "dateOfCollection": "2017-06-23T15:45:16Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Public officials had no legal obligation to protect a man who died after a brain-eating amoeba entered his nose as he swam at a county park beach.", "title": "Who's to blame for lake's brain-eating amoeba? Appeals court wades into negligence lawsuit", "url": "http://www.indystar.com/story/news/2017/06/22/whos-blame-lakes-brain-eating-amoeba-appeals-court-wades-into-negligence-lawsuit/411223001", "numberOfLinks": 13, "author": "Tim Evans", "publishedAt": "2017-06-23T14:56:25.077+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/3697e43b9f6ca55a648b43f36c36af4f07a109eb/c=0-32-700-427&r=x1683&c=3200x1680/local/-/media/2017/06/23/USATODAY/USATODAY/636338116600505148-XXX-climate-change-disease04.jpg", "article": "Public officials had no legal obligation to protect a man who died after a brain-eating amoeba entered his nose as he swam at a county park beach, the Indiana Court of Appeals ruled this week.More: Court says city, owner too slow to address 'Black Mountain' of industrial wasteMore: $55,000 down the drain? Not after IndyStar Call for Action got involvedAbel, 30, of Loogootee, is believed to be the only person in Indiana to die from PAM, or primary amebic meningoencephalitis. The infection is triggered by the microscopic, water-borne organism Naegleria fowleri, according to the Centers for Disease Control and Prevention. The amoeba is transferred to victims, the CDC reports, through water entering the nose while swimming in warm lakes and rivers.The CDC reports Naegleria fowleri “is commonly found in warm freshwater (e.g. lakes, rivers, and hot springs) and soil.” But before you freak out, here’s a little more perspective from the CDC:“The risk of Naegleria fowleri infection is very low. There have been 40 reported infections in the U.S. in the 10 years from 2007 to 2016, despite millions of recreational water exposures each year. By comparison, in the 10 years from 2001 to 2010, there were more than 34,000 drowning deaths in the U.S.”The 2014 lawsuit alleged the county and parks board were responsible for West Boggs Lake and failed to protect Abel and the public from the deadly organism.Abel is believed to have been infected while swimming in the 622-acre West Boggs Lake near Loogootee on July 15, 2012. Weather records indicate the day was humid and hot, with a high in the 80s, when Abel went for the fateful swim at the lake’s public beach.He became ill several days later and died at an Evansville hospital just days after his symptoms, including headaches and nausea, first appeared.The three-judge court of appeals panel ruled the county and parks board did not have — so it did not breach — a duty to protect Abel because his fate was not foreseeable. The court ruled that leaves no issue to be decided at trial, effectively dismissing the case.“Although the circumstances here were tragic,” Judge Michael P. Barnes wrote in the opinion, “we conclude that the County, Parks Board and Health Department did not have a duty to Abel. Consequently, the trial court erred when it denied their motions for summary judgment.”Abel’s family has a Facebook page called Waylon Abel-Amoeba Awareness, where they post information about his case and others around the U.S. An update from October says, in part:“We just want families to be aware and safe when swimming in fresh water. Please use precautions when getting in any fresh water lake. Remember it's 100% preventable.” The post includes two tips: “keep head above water” and “wear a swim mask or nose clips.”The CDC reports much is still unknown about who gets infected while swimming and why because there have been so few cases to study. While infection is rare, the only certain way to avoid exposure, the CDC says, is to \"refrain from water-related activities in warm freshwater.\"  Tim Evans is IndyStar’s consumer advocate. Contact him at tim.evans@indystar.com or (317) 444-6204. And follow him on Twitter: @starwatchtim", "dateOfCollection": "2017-06-23T15:45:18Z"}]