[{"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "White House spokesman said the question of whether Trump will invoke executive privilege to block Comey's testimony has \"to be reviewed.\"", "title": "Will Trump use executive privilege to block Comey testimony? Spicer says White House hasn't decided", "url": "https://www.usatoday.com/story/news/politics/2017/06/02/trump-use-executive-privilege-block-comey-testimony-spicer-says-white-house-hasnt-decided/102429120/", "numberOfLinks": 9, "author": "Erin Kelly", "publishedAt": "2017-06-02T19:46:37Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/6f95efde5ab68c1e946bbb30b8128a135a5cc698/c=0-0-4915-2777&r=x1683&c=3200x1680/local/-/media/2017/05/17/USATODAY/USATODAY/636305773740378638-AFP-AFP-OH15P.jpg", "article": "WASHINGTON — White House spokesman Sean Spicer on Friday did not rule out the possibility that President Trump might invoke executive privilege to try to stop former FBI director James Comey from testifying Thursday before the Senate Intelligence Committee as part of its investigation into Russia's interference in the presidential election and possible collusion between the Trump campaign and Russian officials.\"Obviously, it's got to be reviewed,\" Spicer said in response to a reporter's question about executive privilege. \"My understanding is the date for that hearing was just set. I haven't spoken to counsel yet. I don't know how they're going to respond.\"Earlier Friday, Kellyanne Conway, counselor to the president, said on ABC's Good Morning America that \"the president will make that decision.\"\"When Director Comey goes to testify, I think that will be a very clarifying moment,\" she said. \"It's more important to have somebody testify under oath, frankly, than to have his friends and his former colleagues out there speaking to the media, not under oath.\"Comey's much-anticipated testimony is expected to focus on his conversations with Trump, including about allegations that the president asked Comey to back off the FBI's investigation of former national security adviser Michael Flynn. Trump abruptly fired Comey on May 9 as Comey was leading that investigation.Trump fired Flynn in February amid questions about whether he inappropriately talked about U.S. sanctions against Russia with a Russian official and then misled Vice President Pence about it.Both the House and Senate Intelligence committees have issued subpoenas for Flynn's testimony and documents from his businesses.Read more:Executive privilege is a legal doctrine that allows a president to withhold information from other branches of government  — in this case, Congress. In 1974, during the Watergate scandal, the U.S. Supreme Court ruled in U.S. v. Nixon that executive privilege can only be invoked in certain circumstances, such as when a president is trying to protect national security or confidential advice from aides.Legal experts said Trump doesn't have a good legal argument to invoke the privilege to block Comey's testimony.\"I think the president has effectively waived the privilege in this case because he has communicated publicly, in several different public formats, about his conversations with Mr. Comey,\" said Mark Rozell, an expert on executive privilege and the dean of the Schar School of Policy and Government at George Mason University in Virginia.Trump talked about his conversations with Comey in TV interviews and on Twitter, making it hard for him to claim that they should be kept confidential now, Rozell said.\"Yet again, the president was not careful,\" the dean said. \"If he had any intention of claiming executive privilege, he ultimately weakened his own case severely.\"Trump also has less power to claim the privilege in regard to conversations with an ex-employee who no longer works for the executive branch, Rozell said.\"In this case, we're talking about private citizen James Comey,\" he said.Andrew Wright, an associate professor at the Savannah Law School in Georgia who served as associate counsel to former president Barack Obama, said executive privilege was designed to allow a president to keep an aide's advice confidential or protect national security.\"It was not designed to allow the president to say, 'Let's silence a critic,' \" Wright said. \"That's not how it works.\"The privilege can't be used to shield government misconduct — such as allegations that Trump may have tried to obstruct justice by asking Comey to drop the FBI's investigation of Flynn, Wright said.\"Courts have ruled that government misconduct is an exception to the doctrine of executive privilege,\" he said.Rozell said \"a rational person\" wouldn't try to invoke the privilege.\"A rational person looking at the cost-benefit ratio — what's the chance of success and is it even worth trying — would ultimately conclude don't do it,\" he said. \"But we all know this is a president who plays by his own set of rules and is very unpredictable.\"Politically, invoking the privilege could hurt the president by furthering the impression that he has something to hide, Rozell said.\"If I were his attorney, my advice would be: Mr. President, if you've done nothing wrong and have nothing to hide, cooperate with the investigation, be completely transparent, you have nothing to be afraid of,' \" he said.", "dateOfCollection": "2017-06-02T21:42:00Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "The comedian says Trump is invoking the power of the government in his feuds, adding, \"They’re using me as the shiny object so nobody talks about his FBI investigation.\"", "title": "Kathy Griffin: Donald Trump is messing with the 'wrong redhead'", "url": "https://www.usatoday.com/story/life/people/2017/06/02/kathy-griffin-and-lisa-bloom-say-trrump-feud-is-not-a-fair-fight/102426450/", "numberOfLinks": 9, "author": "Jayme Deerwester", "publishedAt": "2017-06-02T21:13:44Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/694a82a01798d61ccef30f97f93b781b57eb346a/c=0-188-3000-1883&r=x1683&c=3200x1680/local/-/media/2017/06/02/USATODAY/USATODAY/636320071571467071-GTY-691584578.jpg", "article": "p.p1 {margin: 0.0px 0.0px 0.0px 0.0px; font: 14.0px Arial} p.p2 {margin: 0.0px 0.0px 0.0px 0.0px; font: 14.0px Arial; min-height: 16.0px} p.p3 {margin: 0.0px 0.0px 0.0px 0.0px; font: 14.0px Helvetica; min-height: 17.0px}Kathy Griffin and civil-rights lawyer Lisa Bloom came for Donald Trump Friday. But their press conference may come back to haunt them, as well as the Democrats in general.\"I’m not afraid of Trump,\" the 56-year-old comedian said. \"He’s a bully. I’ve dealt with older white guys trying to keep me down my whole career.\"Griffin and Bloom addressed what they both view as a disproportionate response by the president and his family after she apologized for posing with a fake, severed Trump head for photographer Tyler Shields.Those pictures, Bloom said, were meant to be a parody of Trump's infamous \"blood-blood-coming-out-of-her-whatever\" comments about then-Fox News anchor Megyn Kelly, who raised the question of his past misogynistic remarks at a presidential debate in August.\"It was a parody of Trump's own sexist remarks taken to an extreme, absurdist visual,\" Bloom said.Obviously, that was not how they were interpreted and she had the photos pulled down and publicly acknowledged that she crossed the line.\"I apologized because it was the right thing to do,\" an emotional Griffin told reporters. \"Then it became a mob mentality pile-on.\"Although she did not retract her apology, Griffin felt the blowback warranted a follow-up: \"What is happening to me has never happened in the history of this great country.  A sitting president of the United States, his grown children and the first lady are personally, I feel, are trying to ruin my life forever.”She added, \"They’re using me as the shiny object so nobody talks about his FBI investigation.\"Although Bloom correctly pointed out that her client has a \"first amendment right to publicly parody the president,\" the problem for Griffin, as any celebrity who's weathered a similar scandal can attest, is the fine print: The first amendment does not indemnify the speaker from the commercial or legal fallout of their remarks, such as getting fired or sued in civil court.In addition to losing her New Year's TV gig on CNN, an endorsement and several stand-up comedy performances, Griffin has received \"detailed, specific\" death threats and is under investigation by the United States Secret Service, which her criminal attorney, Dmitry Gorin, expects will be resolved in her favor.Eric Schiffer, CEO of Reputation Management Consultants in Los Angeles, issued a verdict that was largely in line with the general sentiment on Twitter: \"Griffin damaged her credibility even more with her rambling, defocused blaming of Trump when it was Griffin who 'victimized' herself.\"He told USA TODAY that the comedian's \"choice to fire off an urgent flare to Democrats and the 'resistance' with a call to arms is a hail mary hope to trigger partisan outrage when most Democrats view her act as disgusting and boneheaded — even when many have dark hatred in their hearts for Trump. \r\np.p1 {margin: 0.0px 0.0px 0.0px 0.0px; font: 11.0px Helvetica; color: #424242} span.s1 {font-kerning: none}\r\nIt will probably be viewed as a botched move by Griffin and raise eyebrows from Democrats and resistance diehards, not their pitchforks.\"But anyone who thinks the My Life on the D-List star and standup-circuit veteran is done mocking Trump is mistaken.Bloom promised, \"Kathy will continue to be the fierce, brutally honest 'she-ro' that millions love. She will continue to push the edges of our comfort level, to challenge us and make us think.\"Plus, as Griffin reminded reporters, \"I’m not good at being appropriate. I’m going to make fun of him more now.\"p.p1 {margin: 0.0px 0.0px 0.0px 0.0px; font: 11.0px Helvetica; color: #424242} span.s1 {font-kerning: none}\r\np.p1 {margin: 0.0px 0.0px 0.0px 0.0px; font: 11.0px Helvetica; color: #424242} span.s1 {font-kerning: none}\r\n", "dateOfCollection": "2017-06-02T21:42:00Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "For decades, the relentless Chukchi Sea has been washing away the fine sand that makes up Sarichef Island and now this Iñupiaq village of 650 faces a stark choice: Move or drown.", "title": "Residents on remote Alaska island fear climate change will doom way of life", "url": "https://www.usatoday.com/story/news/nation/2017/06/02/alaska-island-fear-climate-change-dooms-town/102398636/", "numberOfLinks": 2, "author": "Trevor Hughes", "publishedAt": "2017-06-02T21:00:40Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/4671714f4b2b5ce38b3395e0ebf1399ade556c3c/c=0-395-3310-2265&r=x1683&c=3200x1680/local/-/media/2017/06/01/USATODAY/USATODAY/636319329952379951-DSC07969.JPG", "article": "SHISHMAREF, Alaska — Annie Weyiouanna remembers her home being bigger. For decades, the relentless Chukchi Sea has been washing away the fine sand that makes up Sarichef Island and this Iñupiaq village of 650 now faces a stark choice: Move or drown.“You are taking away our identity,” Weyiouanna says. “That’s like a punch in the gut. That’s who we are — we are tied to this land and the sea.”Regardless of debates about climate change, there’s no question the island is shrinking. Satellite images taken over the past 20 years show how far the shoreline has receded, drawing ever-closer to the small homes huddled on what is little more than a large sandbar.Federal officials estimate the island loses somewhere between nine and 22 feet of shoreline every year, although a massive seawall built from rocks barged in from the mainland has slowed the process.Still, that rock wall protects only the hardest-hit areas from erosion, and the wind carries away sand year-round from the island’s highest point, about 20 feet above sea level.Many of the native people here blame human-caused climate change for accelerating the island’s erosion, and worry that President Trump’s decision to pull out of the Paris climate agreement will supercharge the destruction that’s already occurring. One government estimate says the majority of the town’s homes could be uninhabitable within 15 years.Girls living in Shishmaref, Alaska, pose for a photo with their bikes during a sunny early spring day. Experts say the island on which Shishmaref sits will likely be all-but-uninhabitable by the time these four are finished high school. (Photo: Trevor Hughes/USA TODAY)What’s worse, they say, is Trump's proposed federal budget would eliminate funds they hoped could pay to relocate the village to the mainland some 20 miles away in what would be a years-long logistics nightmare of barges, temporary roads and construction of a new airstrip. One U.S. Army Corps of Engineers estimate put the moving cost at $180 million for a town where the median household income is less than $30,000 annually. And Shishmaref is just one of more than 180 coastal towns in Alaska facing such problems, although federal officials say it's one of the most precariously situated.Beyond cost, a move raises more personal questions. Community identity here is often tied to a specific location, where fathers pass down tips about the best hunting sites to their sons, where grandmothers take kids fishing for dinner and where virtually everyone is related to their neighbor.\"We have no choice. Our island is getting smaller. It isn't getting bigger,\" said ivory carver Edwin Weyiouanna.Understanding what’s happening to Sarichef Island requires a bit of a history and geology lesson. The island, about 100 miles from the Russian mainland, is part of a land bridge that once connected the North American continent to Asia. Researchers have concluded North America was initially populated by people and animals that made their way across that land bridge before it disappeared. The people who live on the coasts of both continents are related to each other, and used to routinely shuttle across in boats before the Cold War between the United States and the Soviet Union ended that practice. On a clear day, you can Russia from their island.Today, the residents of Shishmaref live a largely subsistence-based lifestyle. They boat to the mainland to hunt caribou and ducks and gather berries. They fish and shoot seals for meat for them and their dogs.Few have running water inside their homes. Instead, they buy water delivered by barge during the summer and collect crystal-clear freshwater ice from the mainland for drinking. They also depend heavily on food stamps to buy dried ramen noodles and eight kinds of Spam at the town’s two grocery stores, along with so much soda that the town’s dentist shakes his head in frustration. Health care is provided to most everyone for free under Medicaid.Without running water, few people have flush toilets. Instead, they use buckets fitted with toilet seats, and then bag up the waste for transport it to a sewage lagoon. Trash gets hauled to a landfill at the island’s south end and burned, and animal carcasses lie half buried in the snow or dirt.The sun sits low on the western horizon above Shishmaref at about 11 p.m. as two residents walk back home from an evening trip to the store. (Photo: Trevor Hughes/USA TODAY)Dogs chained up outside the modest houses bark at strangers, and residents drive most everywhere on four-wheelers or snowmobiles or side-by-sides, rather than walking the few blocks from one end of the town to the other. Many of the approximately 150 houses are owned by the local housing authority, and local government is the largest employer here. The land on which the town sits is owned by the tribe's native corporation, which means few people have any significant financial resources of their own.The plot where they might relocate is about 20 miles away on the mainland and also owned by the tribal corporation. It's surrounded by the 2.6 million-acre Bering Land Bridge National Reserve, which means the federal government's permission would be required to build roads to the new townsite, and to create a quarry for foundation materials.Flights off the island cost about $400 round trip, and that will only get you to Nome, population 3,500, about 120 miles away. The Army Corps estimates moving and assimilating the entire population of Shishmaref into Nome would cost about half what it would take to rebuild the town in an entirely new location, but residents here say that would destroy their entire sense of identity.This island, be it ever so humble, is home.At least for another decade. Maybe. It depends on whether sea level rise speeds up, a big storm again knocks out the defensive wall or warmer winters continue melting the protective sea ice that surrounds the island for much of the year. The ground itself is softening, the once-frozen permafrost melting, and there’s little vegetation to stop the top layers from blowing away.“I wish we didn’t have to move,” said Lorraine Jungers as she shopped at one of the stores with her teenage daughter. “I know the benefits of moving. But we’d be too far apart from the people that mean the most to us. This is our whole life right here. I can’t picture us anywhere else.”Crosses mark graves at the cemetery in Shishmaref. The cemetery is one of the island's highest points, but that's only about 20 feet above sea level. (Photo: Trevor Hughes/USA TODAY)Some residents don’t think the town will move. They say there’s no way to pay for it and no way to physically move an entire village across miles of open water to reach the mainland. In that event, residents here would slowly disperse over time as the water flowed its way inland.Even if the relocation happens, they fear there will be no way to maintain the same sense of community in a new place. Other struggles include questions over polar bears coming onto the mainland, whether to move the bodies buried in the island's small cemetery and how to overcome the inertia that comes with having lived in the same small piece of land for generations.The effort to move has been underway, in some form of another, for years. Residents have voted multiple times to relocate to the mainland and several have testified before Congress. A youth ambassador from Shishmaref attended the Paris climate talks in 2015.Edwin Weyiouanna shows off a carving made from mastadon ivory, whale baleen and rabbit fur. Many Shishmaref residents carve items like this to sell to tourists on the mainland. Brokers buy up pieces from several artists, buy a plane ticket to Anchorage or Fairbanks, and sell them for three times what the artisan receives. (Photo: Trevor Hughes/USA TODAY)Still, not much has changed despite more than a decade of lobbying, votes and media attention. And the clock is ticking. Shishmaref native Esau Sinnok has already seen the island lose at least 100 feet of coastline in his 19 years, and a dozen houses, including his grandmother’s, were relocated in 1997 to stave off immediate collapse into the ocean.Emergency protection efforts have proven costly: In 2001, the state paid $110,000 to install sand-filled wire baskets along the western shore. They lasted through only the next storm. A more expensive and extensive sea wall built in pieces in the late 2000s has helped protect a small portion of the island’s western closest to homes, but satellite images show it merely moved the erosion problem a little further along the shore, closer to the airstrip.The lack of action under President Obama frustrated Shishmaref residents ready to move. They wonder why Obama could commit so many billions of dollars to fighting climate change abroad while not doing more to help American citizens facing imminent danger.Still, things will be worse, they fear, under Trump.“He doesn’t believe climate change is real,” said Annie Weyiouanna. “And I see that and think it’s scary.”", "dateOfCollection": "2017-06-02T21:42:01Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Three Penn State officials - former president Graham Spanier, former athletic director Tim Curley and Gary Schultz - each were sentenced to prison after being convicted of child endangerment.", "title": "Three Penn State officials sentenced to jail in Jerry Sandusky case", "url": "https://www.usatoday.com/story/sports/ncaaf/2017/06/02/penn-state-jail-sentence-child-endangerment-graham-spanier-tim-curley-gary-schultz/102426832/", "numberOfLinks": 2, "author": "Scott Gleeson", "publishedAt": "2017-06-02T18:18:02Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/c869de7572021911aeb9b505eb7d081e4a342422/c=0-44-4569-2625&r=x1683&c=3200x1680/local/-/media/2017/06/02/USATODAY/USATODAY/636320081700827049-AP-PENN-STATE-ABUSE-91379522.JPG", "article": "Former Penn State officials Tim Curley, Gary Schultz and Graham Spanier were all sentenced to jail time Friday for failing to alert authorities to the allegations against ex-football coach Jerry Sandusky, allowing the now-convicted serial predator to continue molesting boys for years.All three were convicted of child endangerment. Schultz, the former university vice president, could serve a minimum of two months in jail and a maximum of 23 months. Curley, the former university athletic director, could serve a minimum of three months in jail and maximum of 23 months. And Spanier, the former university president, could serve a minimum of two months and a maximum of 12 months. All three are also poised to have house arrest after the jail time.Prosecutors in the case argued that the ex-Penn State staffers failed as leaders and cared more about themselves and the school’s image than protecting the children. Judge John Boccabella in the case called it a “Shakespearean tragedy” and was befuddled by the former administrators lack of action.“These men are good people who made a terrible mistake,” the judge said. “Why no one made a phone call to police … is beyond me.“All three ignored the opportunity to put an end to (Sandusky’s) crimes when they had a chance to do so.\"“I deeply regret I didn’t intervene more forcefully,” Spanier said, expressing remorse, in reference to Sandusky’s victims. Spanier will appeal a misdemeanor of child endangerment charge that both Schultz and Curley pleaded guilty on.Curley and Schultz also told the court they were sorry they didn’t do more.“I am very remorseful I did not comprehend the severity of the situation. I sincerely apologize to the victims and to all who were impacted because of my mistake,” Curley said.Said Schultz: “It really sickens me to think I might have played a part in children being hurt. I’m sorry that I didn’t do more, and I apologize to the victims.”All three individuals were received two years of probation, 200 hours of community service, and fines. Spanier was fined $7,500, while Schultz and Curley were fined $5,000.Sandusky is serving a 30 to 60-year prison term after being convicted of sexually abusing 10 boys.Spanier’s trial revolved around testimony by an ex-graduate coaching assistant, Mike McQueary, who said he reported seeing Sandusky molesting a boy in 2001.Sandusky was not arrested until 2011, after an anonymous email to a county prosecutor led investigators to approach McQueary. Sandusky was found guilty the next year of sexually abusing 10 boys and is serving a prison sentence of 30 to 60 years while he appeals his conviction. At least four victims at Sandusky’s trial said they were molested after 2001.The scandal led to the firing of beloved football coach Joe Paterno shortly after Sandusky’s arrest, and he died of cancer two months later at the age of 85.The Hall of Fame coach was never charged with a crime, but a report commissioned by the university concluded he was part of an effort to keep a lid on the allegations against Sandusky for fear of bad publicity.Penn State’s football program suffered heavy sanctions from the NCAA, and the university has paid out nearly a quarter-billion dollars in fines, court verdicts, settlements and other costs.McQueary testified about how he went to Paterno a day after the shower encounter to discuss what he had seen. Paterno notified Curley and Schultz, and McQueary met with both of them about a week later. In his 2011 grand jury testimony, Paterno said he was told by McQueary the encounter involved “fondling” and was of “a sexual nature,” but wasn’t sure what the act was.The prosecution’s key evidence included notes and email exchanges in which Curley, Schultz and Spanier debated what to do after McQueary’s report.PHOTOS: PENN STATE OFFICIALS SENTENCING MEMORANDUMContributing: The Associated Press", "dateOfCollection": "2017-06-02T21:42:01Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "We talk to five women who wrote publicly about their own sexual assaults after Stanford, some for the first time.", "title": "Emily Doe's letter to Brock Turner: 1 year later, 5 survivors speak out on the letter that inspired millions", "url": "https://www.usatoday.com/story/news/2017/06/02/emily-does-letter-brock-turner-1-year-later-5-women-speak-out/354824001/", "numberOfLinks": 21, "author": "Alia E. Dastagir", "publishedAt": "2017-06-02T21:20:36Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/325963291c58b39f11256d64d379865ba58b3121/c=0-194-750-618&r=x1683&c=3200x1680/local/-/media/2017/06/02/USATODAY/USATODAY/636320166362413748-Brock.jpg", "article": "When we paint a picture of sexual violence in America, we often use statistics. Every 98 seconds, an American is sexually assaulted. Nearly 1 in 5 American women is raped at some point in their lives. Not only do these numbers fail to capture the true scope of the problem (rape remains one of the most under-reported crimes), but they can also detach us from the individual horrors survivors experience.One year ago, in the Stanford sexual assault case, \"Emily Doe\" put words to that experience. The victim impact statement she read in court — more than 7,000 words of visceral eloquence — was published in full by Buzzfeed on June 3; within four days it had been viewed 11 million times.Brock Turner was convicted of assault with intent to commit rape of an intoxicated/unconscious person, penetration of an intoxicated person and penetration of an unconscious person. Turner faced up to 14 years in prison but was sentenced to six months in county jail. He served just three for “good behavior.”At his sentencing hearing, Emily Doe recounted the harrowing details of her assault, how she learned in the newspaper that she was found half-naked and unconscious behind a dumpster on Stanford's campus, and what she endured in the weeks and months that followed.She spoke directly to Turner, beginning:You don't know me, but you've been inside me ...But she also spoke to fellow survivors, ending: To girls everywhere, I am with you. On nights when you feel alone, I am with you. When people doubt you or dismiss you, I am with you. I fought everyday for you. So never stop fighting, I believe you.Women across the country answered with their own stories of survival. USA TODAY spoke with five women who wrote publicly about their own assaults after Stanford, some for the first time. Here's what going public has meant for them, how they think Stanford re-framed the national conversation on rape and how far we still have to go:\"Brock's dad's note really did trip a wire in me,\" Liz Taylor said. \"Outrage trumped my shame about not wanting to speak out.\" (Photo: Liz Taylor)Liz Taylor was 18 when she was raped in a dorm room at the University of Missouri on Labor Day weekend of her freshman year. Taylor, who was a virgin, says she stayed quiet out of shock and shame. It was 1996.\"Rape and sexual assault were barely part of the lexicon,\" she wrote on Medium after the Stanford case last year, the first time she talked about her rape publicly. \"I had no idea that’s what it was even called.\"Taylor's post, An Open Letter to Dan Turner, Father of #BrockTurner, tore into the letter Dan Turner wrote to the judge in his son's case, asking for leniency and laying out the ways Brock's life had been “deeply altered forever” over “20 minutes of action.”Why she spoke out\"I think there were a lot of people who read Emily Doe's statement and sort of felt this sense of awe of what she'd written... I was just blown away. I think she put into words what so many women feel and just totally nailed it. ...I read that post on a Saturday, and then on Sunday I saw that note from Brock Turner's dad whining about how Brock couldn't eat Ribeyes anymore, and I just had this mental image in my head of Emily Doe reading that after having poured out her heart and being so brave and speaking for so many of us. I just kind of had this like, 'Hold my beer' moment ... So I banged out that letter.\"After she spoke out\"I think any sort of relief I experienced was immediately replaced by this — I don't want to call it a burden because really it was an honor — but this outpouring of stories from friends and family saying 'me too, me too, me too.' And all of a sudden you're just like, 'What? Wait, all of us?'\"A part of Emily Doe's letter that resonated with her\"There were certainly enough differences to where it was not an identical situation, and yet everything she said I was like, 'All of that.' I found it resonating with me in its entirety even though we had vastly different experiences in many ways. I've never seen someone put into words all of the various facets of this experience.\"I have to relearn that I am not fragile, I am capable, I am wholesome, not just livid and weak.On whether Stanford has changed the conversation on rape\"I actually think the election did more to re-frame the conversation than anything else. Certainly the Access Hollywood tapes and Trump's accusers, but then also having Bill Clinton's accusers resurface. I think it brought up a lot of important questions around what we as a society find forgivable, what we'll tolerate, and how far we still have to go if we're willing to elect someone as our leader who openly bragged about assaulting women.\" \"I found so much power putting my own story out there,\" Danielle Beavers said. (Photo: Danielle Beavers)Danielle Beavers had spoken about her own rape before, but after the Stanford case she wrote about it for the first time in for the Greenlining Institute — an organization focused on race and economic justice issues where she is diversity and inclusion director.\"I was a young black girl raped by a group of young black men in blue collar Atlantic City,\" Beavers wrote. Listening to the conversations about Emily Doe and Brock Turner, Beavers said she realized she was disturbed by \"the racial inequity of my rape.\"Why she spoke out\"I think a lot of it honestly was fueled by frustration. It's very obvious to me there are certain reasons why particular stories get uplifted and others don't. ... When we know this happens every single day, why was this a story that got so much empathy and attention from people?  ... I think the anonymity of Emily Doe — not having a face, or a concrete name to pin to it — helped bring out that compassion from people. ... But I thought that if this was a black girl walking around Oakland, would it even have gotten written about in the paper?\"How being a survivor of color can be different\"It was very obvious and very much communicated to me even at 11 years old that talking about this looks bad for 'our people.' And when I say 'our people,' it's the black community and communities of color to a larger extent.\"A part of Emily Doe's letter that resonated with her\"One of the big pieces was how she was able to, for lack of a better word, forgive him. And talk about the life that she wanted for him afterwards. To be honest, I'm not in that place, and for her to be able to do that — in such a high-profile, contentious case that happened so quickly, to have that turnaround — I think everyone was in awe.\" Your life is not over, you have decades of years ahead to rewrite your story. The world is huge, it is so much bigger than Palo Alto and Stanford, and you will make a space for yourself in it where you can be useful and happy.What's changed since writing about her rape\"I just feel a little stronger. I can tell by the way that I carry myself. I think it's good for women to have at least a little bit of a sense of audaciousness and entitlement. And I say that because so often we have to apologize for our existence, apologize for violence that has happened to us, or silence ourselves because it makes people uncomfortable.\"Maya Weinstein lent her voice to the chorus of survivors last summer. \"It just felt like such an important moment,\" she said. (Photo: Maya Weinstein)Maya Weinstein was raped the first semester of her freshman year at George Washington University in October 2012. She began talking publicly about her rape six months later and has since written about her story, shared it in the documentary The Hunting Ground, and lent her voice to the conversation around Emily Doe in a piece published in Buzzfeed last year.On having her story out there\"My university told me I had to understand how difficult everything had been for my perpetrator. And I was like, 'that's absurd. He raped me. I'm a survivor.'Sometimes when I have the opportunity to speak publicly ... I wonder if he sees this. I wonder if he sees me, and he knows that I won, actually. And I still have to deal with the trauma and all of the negative feelings and the mental health issues that come with surviving such an intimate traumatic experience. But at the same time, I'm doing something with it. It's almost — it's a very weird feeling, but if he's watching, then he knows what I've been able to do.\" A part of Emily Doe's letter that resonated with her\"The part that really stood out to me was when she talks about how they both lost out.\" Nobody wins. We have all been devastated, we have all been trying to find some meaning in all of this suffering. Your damage was concrete; stripped of titles, degrees, enrollment. My damage was internal, unseen, I carry it with me.On why everyone doesn't have to share their story\"In the survivor space, especially over the past couple of years, there's almost a pressure to come forward with your story. People think they're not fully survivors until they share their story, and that's just not right. \"What I think was valuable about this case was that we still don't know her name, we don't know what she looks like, but she found a way to get her voice out there in a way that resonates with survivors. And I think that really helps, and should help survivors know that they can make an impact without having to feel exposed or vulnerable in a way they might not want to. It was a good way to create a dialogue and show the power of a story.\"On whether Stanford has changed the conversation on rape\"I work a lot with teenagers and grade school kids on consent and healthy relationships and sexual assault. Last summer I ran a program at a summer camp — and bringing up these issues you never know what these kids and teens know — and they referenced the Stanford case. They knew the name Brock Turner. They knew the details. They knew why it was problem. ... It was huge. ... It was actually really powerful to see how this managed to reach all these young people.\"Weinstein said the election bringing sexual assault back into the national conversation in a different way, however, was painful.\"It wasn't even when those tapes were released. It was election night and the next morning when the reality set in that people were able to see past those comments. ... It really just showed we have a huge culture issue in our society where we're able to say, 'Whatever, that's fine, I like the rest of him.' That that isn't enough evidence of character.\"Chloe Allred reported her rape, but was told even before an investigation began that there would not be enough evidence to prosecute.  \"We are not making it a priority in our justice system to prosecute rapists,\" she said. (Photo: Chloe Allred)Chloe Allred was raped in February of her sophomore year at Cornish College of the Arts in Seattle. She went to bed at a now former friend's house.\"The next thing I remember was feeling hands on my body. No, in my body,\" she wrote last year for Stylecaster, a media site aimed at Millennial women.The first time Allred talked publicly about her rape was during her art show, To Be Brave: Ending Body Shame. She made a painting about it, inspired by photos she had taken of herself the night after the assault. She said she felt compelled \"to capture what had happened to me, which had felt so unreal.\"She has since stood on stage with Lady Gaga and 50 fellow survivors at the 2016 Oscars and, after the Stanford statement went viral, spoke out again.A part of Emily Doe's statement that resonated with her\"The way she talked about this feeling of her own body being a stranger, of wanting to step outside of her body and herself.\"  I stood there examining my body beneath the stream of water and decided, I don’t want my body anymore. I was terrified of it, I didn’t know what had been in it, if it had been contaminated, who had touched it. I wanted to take off my body like a jacket and leave it at the hospital with everything else.On whether Stanford has changed the conversation on rape\"What I began to see in how that case was covered, and particularly after Emily Doe's statement was released, is that I think it kind of started to sink in more for people that he had done this really horrific thing and that even though he looks like a typical college kid, that doesn't excuse him for degrading another person ... It wasn't being shown until her writing and her direct account came out where it's like, OK, this is what this does to somebody. This is the aftermath of these '20 minutes of action.'\"After coming forward\"After my own assault I lost a lot of friends. I talked to members of my family who just didn't understand or who blamed me for what happened. And that just felt really isolating, and I felt crazy. And the election was kind of like that, almost on a macro scale ... It wasn't even that people thought [Trump] wasn't capable of it. It's that they just didn't care.\" What she really wants people to know\"I'm a survivor. I was assaulted in 2011 and now it's 2017 and it's still something I live with. I still live with the echoes of that trauma. I think a lot of people don't really realize how bad it is for survivors in America. I think they kind of think of American as though it's this accepting and great place for women. I know I thought about it that way before I experienced the things that I did.\" Chrissa Hardy said that when survivors connect with one another, \"It's much easier to fight back.\" (Photo: Chrissa Hardy)Chrissa Hardy was 17 and a virgin when she was raped at a party. It was full of people she knew, people she trusted. She did her best to forget what happened, but at 27 started to feel compelled to say the words: \"I was raped.\"She began to see more and more stories in the media about sexual assault, and was troubled by the pattern she witnessed as each case played out: Women felt shame and fear coming forward about their sexual assaults, and the public's response when they did was to blame them.\"I remember feeling, 'That's exactly why I didn't say anything,'\" she said. She eventually got to a place where she was able to say, \"It wasn't just a drunken hookup. I was raped. I remember saying 'no,' and him saying 'shhh.'\"After the Stanford case, Hardy decided to share her story publicly for the first time with an essay in Bustle. Why she spoke out\"After the Emily Doe statement came out, I was so touched and moved by her courage to not only say all of that, but to say it to him, in the courtroom. And I could not even imagine doing that myself and how much bravery that took. She just made me feel so much less alone. So I thought maybe I can unburden myself by sharing my own story, and also make someone else feel less alone.\"What it felt like to write about her assault\"I write and edit for a living, but I've never been able to write anything that fast. I was terrified to sit down and do it, and even when I did it I had some tears and emotions while writing, just sort of reliving the whole thing. But really it came out of me so fast, and I think I had it done within an hour. It's still the most important thing I've ever written and also the easiest thing I've ever written.\"A part of Emily Doe's statement that resonated with herMy sister picked me up, face wet from tears and contorted in anguish. Instinctively and immediately, I wanted to take away her pain. I smiled at her, I told her to look at me, I’m right here, I’m okay, everything’s okay, I’m right here. My hair is washed and clean, they gave me the strangest shampoo, calm down, and look at me.\"When she described the worry that she had about her sister's reaction and how she wanted to sort of protect her. ... That was probably the thing I connected with most, because I didn't want to hurt anyone else when I said the words, 'I was raped.' I was worried about how my husband would feel. I prioritized everyone's emotions above my own.\"What she hopes people will understand. What she hopes will change. \"I think everyone knows at least two or three women who have gone through something like this, and many of them are probably afraid to speak up or even admit to themselves that it happened because it's so easy to buy into this idea that maybe if I dressed differently, maybe if I didn't have as much to drink this wouldn't have happened to me. But that's not what it is. Rapists rape. It has nothing to do with alcohol. It has nothing to do with your clothing.I want more people to believe when someone is courageous enough to speak out, because it takes a lot to do that. And there's this silly idea that when women accuse any man with power or fame of sexual assault that they're doing it for fame themselves ... Women don't receive fame when they come forward with something like this. They are cloaked with shame, they are crippled by fear. They don't get money. They get death threats. That's what they get. Everyone single one of us has gotten that. I didn't even name my attacker in my story, and I got death threats online, and other horrible things were said to me as well, just because I had the audacity to say that someone raped me however many years ago. It takes a woman so much to admit something like this happened to her. I want people to believe every woman who said that it did.\" Read more: ", "dateOfCollection": "2017-06-02T21:42:01Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "EPA head Scott Pruitt refused to say whether Trump believes climate change is an invented problem.", "title": "Does President Trump believe in climate change? White House, EPA won't say", "url": "https://www.usatoday.com/story/news/politics/2017/06/02/does-president-trump-believe-climate-change-white-house-epa-wont-say/102429874/", "numberOfLinks": 8, "author": "Heidi M Przybyla", "publishedAt": "2017-06-02T20:03:21Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/162514cb3aceb6cee82df280073cb07a4eaa671c/c=0-0-2996-1693&r=x1683&c=3200x1680/local/-/media/2017/06/02/USATODAY/USATODAY/636320143522359379-GTY-691614902.jpg", "article": "WASHINGTON – Environmental Protection Agency administrator Scott Pruitt refused to say whether President Trump still believes that climate change is a hoax, one day after the president promised to withdraw from the landmark Paris climate agreement.Pruitt sidestepped reporters' questions about Trump’s views on climate change three times during a White House news conference on Friday.“The discussions we had, through the last several weeks, have been focused on one singular issue: is Paris good or not for this country? That’s the discussions I’ve had with the President. So that’s been my focus.”In a highly anticipated announcement from the Rose Garden on Thursday, Trump pledged to pull out of the international agreement to reduce greenhouse gases because it would cost the U.S. millions of jobs – sparking an outcry from European allies and even some high-profile American business leaders.While Trump said he would be willing to renegotiate the agreement to be more \"fair\" to the U.S., he has been a longtime critic of climate change, including in a 2012 tweet when he called it a Chinese creation to make the U.S. less competitive.According to a review by Vox.com, Trump has tweeted climate change skepticism at least 115 times, even accusing scientists of manipulating data.White House press secretary Sean Spicer also said he did not know the answer to whether Trump believes in climate change. “I have not had an opportunity to have that discussion. Administrator Pruitt pointed out what the president is focused on is making sure we have clean water, clean air” and the best deal for U.S. businesses, Spicer added.Spicer vowed to track down the answer “if possible.”During his Thursday announcement on the climate pact, Trump cited statistics from a Massachusetts Institute of Technology report in concluding that the agreement would only reduce emissions by a “tiny, tiny amount.\"The report's author subsequently said that conclusion shows Trump misunderstood their findings. \"If we don't do anything, we might shoot over 5 degrees or more, and that would be catastrophic,\" said John Reilly, co-director of the MIT Joint Program on the Science and Policy of Global Change.Pruitt insisted there was additional scientific research backing up Trump’s claim that the accord would have a minimal impact on reducing carbon emissions – without providing examples. “They didn’t have a corner on the market,” he said of the MIT study. “There were many at the time” and “we can provide those to you,” said Pruitt.Later Pruitt was asked his own personal opinions about whether global warming is real, and he acknowledged that “global warming is occurring” and “human activity contributes to it.”“The president made a very courageous decision yesterday for America,” said Pruitt. “We have nothing to be apologetic about as a country,” he said, stating that the U.S. has reduced its “carbon footprint” to 1990 levels through innovation and technology.", "dateOfCollection": "2017-06-02T21:42:01Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "You probably know your monthly bills can impact your credit. Here are seven monthly bills with payments your credit score can determine.", "title": "7 monthly bills affected by your credit rating", "url": "http://blog.credit.com/2017/05/7-monthly-bills-affected-by-your-credit-173717/", "numberOfLinks": 25, "author": "Brian Acton", "publishedAt": "2017-06-01T20:02:02Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/35657494721f2f45c7c4026423448d4be84b6460/c=0-212-2118-1409&r=x1683&c=3200x1680/local/-/media/2017/05/31/USATODAY/USATODAY/636318342468149863-GettyImages-508126658.jpg", "article": "You probably know your monthly bills can impact your credit, as late payments or accounts in collections can land on your credit report and bring down your credit score. But are you aware your credit score can affect the payment amount on a number of your monthly bills?Here are seven monthly bills with payments your credit score can determine.When you apply for a lease, your landlord might request a background check that includes your credit report. They can’t run a background check without your permission, although refusing may prevent you from moving forward with the lease.According to the Federal Trade Commission (FTC), the landlord can take adverse action if they find red flags in your credit report. This action could include denying your rental application or raising your rent higher than they would charge another applicant. The good news is they are legally required to give you written notice if they take adverse action, provide you the report they used (if you request it within 60 days) and give you the chance to dispute the information.Consumers with good credit tend to qualify for much lower credit card interest rates than those with poor credit. Interest is applied to your credit card balance each month unless you pay it off in full within the monthly grace period. (You can go here to learn more about how credit card interest is calculated.) If you tend to carry a balance month to month, your poor credit could be costing you extra in interest.Your mortgage payment is also directly affected by your credit. Mortgage lenders consider you a riskier borrower if you have a lower credit score. To hedge against that risk, they will charge you a higher interest rate.Credit scores impact the interest rate lenders offer when you apply for an auto loan. While interest rates vary between lenders, having excellent credit generally results in lower interest and a lower monthly payment. Those 0% financing offers you see on car commercials usually require excellent credit.Your credit score doesn’t generally affect federal loan payments, but if you plan on financing your education through private loans, lenders can use your credit score to determine your interest rate and fees. The worse your credit, the more interest you’ll pay on the loan.According to The Zebra’s State of Auto Insurance Report, there’s a correlation between credit and car insurance rates. On a national level, drivers with poor credit can pay more than twice as much as those with excellent credit for insurance. Some states have banned insurance providers from using credit scores to determine rates, but it’s a common practice in the states that allow it.Insurance companies use credit-based insurance scores to determine what you’ll pay for homeowners insurance. These scores are industry-specific and aren’t exactly the same as your credit score, but they use the information in your credit report to determine your score. The same negative marks that bring down your credit score can impact your insurance score, and affect your payment.Given your credit’s affect on nearly every bill in your mailbox (among other things, of course), it’s important to regularly monitor your credit for errors (you can go here to learn how to dispute those), identity theft or legitimate negative items that are affecting your score. You can pull your credit reports for free each year at AnnualCreditReport.com and view your free credit report snapshot every month on Credit.com. You can generally improve your bad credit by paying down high credit card balances, shoring up accounts in delinquency and limiting new credit inquiries while your credit score rebounds.Trying to lower your monthly bills. We can help you get started with 9 ways to lower your monthly mortgage payment. Image: sturtiSign up for our Credit Report Card and receive the latest tips & advice from our team of 50+ credit and money experts as well as a FREE Credit Score and action plan. Sign up now.Brian Acton is a freelance writer and contributor at Credit.com. Several years ago, as he worked to pay down debt and purchase a home, Brian became interested in personal finance and credit. He has been covering these topics ever since. Brian has a BA in History from Salisbury University and an MBA from UMUC. He lives in Maryland with his wife and two dogs. More by Brian ActonCertain credit cards and other financial products mentioned in this and other sponsored content on Credit.com are Partners with Credit.com. Credit.com receives compensation if our users apply for and ultimately sign up for any financial products or cards offered.Hello, Reader!\n\r\nThanks for checking out Credit.com. We hope you find the site and the journalism we produce useful. We wanted to take some time to tell you a bit about ourselves.\n\nOur People\n\r\nThe Credit.com editorial team is staffed by a team of editors and reporters, each with many years of financial reporting experience. We’ve worked for places like the New York Times, American Banker, Frontline, TheStreet.com, Business Insider, ABC News, NBC News, CNBC and many others. We also employ a few freelancers and more than 50 contributors (these are typically subject matter experts from the worlds of finance, academia, politics, business and elsewhere). \n\nOur Reporting\n\r\nWe take great pains to ensure that the articles, video and graphics you see on Credit.com are thoroughly reported and fact-checked. Each story is read by two separate editors, and we adhere to the highest editorial standards. We’re not perfect, however, and if you see something that you think is wrong, please email us at editorial team [at] credit [dot] com, \n\r\nThe Credit.com editorial team is committed to providing our readers and viewers with sound, well-reported and understandable information designed to inform and empower. We won’t tell you what to do. We will, however, do our best to explain the consequences of various actions, thereby arming you with the information you need to make decisions that are in your best interests. We also write about things relating to money and finance we think are interesting and want to share.\n\r\nIn addition to appearing on Credit.com, our articles are syndicated to dozens of other news sites. We have more than 100 partners, including MSN, ABC News, CBS News, Yahoo, Marketwatch, Scripps, Money Magazine and many others. This network operates similarly to the Associated Press or Reuters, except we focus almost exclusively on issues relating to personal finance. These are not advertorial or paid placements, rather we provide these articles to our partners in most cases for free. These relationships create more awareness of Credit.com in general and they result in more traffic to us as well.\n\nOur Business Model\n\r\nCredit.com’s journalism is largely supported by an  e-commerce business model. Rather than rely on revenue from display ad impressions, Credit.com maintains a financial marketplace separate from its editorial pages. When someone navigates to those pages, and applies for a credit card, for example, Credit.com will get paid what is essentially a finder’s fee if that person ends up getting the card. That doesn’t mean, however, that our editorial decisions are informed by the products available in our marketplace. The editorial team chooses what to write about and how to write about it independently of the decisions and priorities of the business side of the company. In fact, we maintain a strict and important firewall between the editorial and business departments. Our mission as journalists is to serve the reader, not the advertiser. In that sense, we are no different from any other news organization that is supported by ad revenue.\n\r\nVisitors to Credit.com are also able to register for a free Credit.com account, which gives them access to a tool called The Credit Report Card. This tool provides users with two free credit scores and a breakdown of the information in their Experian credit report, updated twice monthly. Again, this tool is entirely free, and we mention that frequently in our articles, because we think that it’s a good thing for users to have access to data like this. Separate from its educational value, there is also a business angle to the Credit Report Card. Registered users can be matched with products and services for which they are most likely to qualify. In other words, if you register and you find that your credit is less than stellar, Credit.com won’t recommend a high-end platinum credit card that requires an excellent credit score You’d likely get rejected, and that’s no good for you or Credit.com. You’d be no closer to getting a product you need, there’d be a wasted inquiry on your credit report, and Credit.com wouldn’t get paid. These are essentially what are commonly referred to as \"targeted ads\" in the world of the Internet. Despite all of this, however, even if you never apply for any product, the Credit Report Card will remain free, and none of this will impact how the editorial team reports on credit and credit scores.\n\nOur Owners\n\r\nCredit.com is owned by Progrexion Holdings Inc. which is the owner and administrator of a number of business related to credit and credit repair, including CreditRepair.com, and eFolks. In addition, Progrexion also provides services to Lexington Law Firm as a third party provider. Despite being owned by Progrexion, it is not the role of the Credit.com editorial team to advocate the use of the company’s other services. In articles, reporters may mention credit repair as an option, for example, but we’ll also be sure to note the various alternatives to that service. Furthermore, you may see ads for credit repair services on Credit.com, but the editorial team isn’t responsible for the creation or implementation of those ads, anymore than reporters for the New York Times or Washington Post are responsible for the ads on their sites.\n\nYour Stories\n\r\nLastly, much of what we do is informed by our own experiences as well as the experiences of our readers. We want to tell your stories if you’re interested in sharing them. Please email us at story ideas [at] credit [dot] com with ideas or visit us on Facebook or Twitter.\n\r\nThanks for stopping by.\n\r\n- The Credit.com Editorial Team\n", "dateOfCollection": "2017-06-02T21:42:02Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "North Carolina GOP Sen. Richard Burr is skeptical about the chances of it getting done at all.", "title": "GOP Sen. Richard Burr: I don't see health care plan this year", "url": "https://www.usatoday.com/story/news/politics/onpolitics/2017/06/02/gop-sen-richard-burr-dont-see-health-care-plan-year/102429014/", "numberOfLinks": 5, "author": "Eliza Collins", "publishedAt": "2017-06-02T19:00:15Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/ceb3061c553b1634aaa8acd0c694574afea1f31e/c=0-191-4736-2867&r=x1683&c=3200x1680/local/-/media/2017/06/02/USATODAY/USATODAY/636320116826792214-EPA-USA-SENATE-INTELLIGENCE-91199806.JPG", "article": "Sen. Richard Burr speaks to the media in Washington on May 25, 2017. (Photo: Tasos Katopodis, European Pressphoto Agency)WASHINGTON — Sen. Richard Burr doesn't envision the Senate passing legislation to repeal and replace Obamacare this year and is skeptical about the chances of it getting done at all.\"It's unlikely that we will get a health care deal,\" the North Carolina Republican told WXII 12 News Thursday. He added that his focus would be on states, like Iowa, that were losing their insurance companies based on the current health care market.\"I don’t see a comprehensive health care plan this year,\" he added.Republicans in the Senate have a slim 52-48 majority and can only lose two votes if they want legislation to pass. No Democrats are expected to vote to dismantle former president Barack Obama's signature health care bill.A handful of Senate Republicans have been huddling weekly to try to hash out details of the plan. So far, these conversations have not produced any policy details but have acted as broad discussions of what members would like to see in the bill.House Republicans passed their version of a bill in May, but many Republicans — including Burr — have dismissed it as a \"dead on arrival\" in the Senate. That bill allows states to apply to waive mandates that insurance companies cover certain types of care, like maternity care and substance abuse. It also allows insurance companies to charge people with pre-existing conditions more, although there is money set aside with the goal of mitigating the high costs.", "dateOfCollection": "2017-06-02T21:42:02Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Authorities, on alert after the Manchester bombing, report 'concrete evidence' of a threat.", "title": "German rock festival evacuated over terror threat", "url": "https://www.usatoday.com/story/news/2017/06/02/german-rock-festival-evacuated-over-terror-threat/102433832/", "numberOfLinks": 4, "author": "Doug Stanglin", "publishedAt": "2017-06-02T20:55:02Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/0affd7472962c9cba5a98780c5f95388bef402c0/c=0-158-4800-2870&r=x1683&c=3200x1680/local/-/media/2017/06/02/USATODAY/USATODAY/636320173255473934-EPA-GERMANY-ROCK-AM-RING.jpg", "article": "Police evacuated some 80,000 people at a three-day rock festival in far west Germany late Friday because of \"concrete evidence\" of a possible terrorist threat, authorities said.Festivalgoers were instructed to leave the Nuerburgring arena outside Nuerburg and go to nearby camping sites, according to organizers of the event, called Rock-am-Ring. The festival was expected to resume on Saturday.The German band Rammstein was headlining Friday night but had not yet taken the stage. Police said the crowd streamed to the exits in an orderly fashion.The music fest, which is scheduled to end on Sunday, was taking place at an outdoor sports arena near Nuerburg, in the state of \r\nRhineland-Palatinate, about 35 miles south of Bonn and close to the Belgian border.\"Since safety is paramount and a danger to festivalgoers in any case must be excluded as much as possible, it was decided to suspend the festival for the day,\" Koblenz police said in a statement.They added that police had \"concrete evidence\" of a possible terrorist threat, but did not elaborate.Police said security was particularly high at the event because of last week's suicide bomb attack at an Ariana Grande concert in Manchester, England, that killed 22 people.Security at the Rock am Ring event was beefed up to around 1,200 personnel, police said..", "dateOfCollection": "2017-06-02T21:42:02Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "After several setbacks, Trump may face his most receptive audience among the justices.", "title": "How Trump's travel ban might prevail in the Supreme Court", "url": "https://www.usatoday.com/story/news/world/2017/06/02/how-trumps-travel-ban-might-prevail-supreme-court/102420056/", "numberOfLinks": 5, "author": "Alan Gomez", "publishedAt": "2017-06-02T21:09:17Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/4eed2e114bf26f65e8a569557ae58686828874de/c=0-601-4691-3251&r=x1683&c=3200x1680/local/-/media/2017/06/02/USATODAY/USATODAY/636320140365814911-AP-Supreme-Court-Travel-Ban.jpg", "article": "President Trump's final hope to implement his temporary travel ban targeting six majority-Muslim countries now rests with the Supreme Court. And luckily for him, the justices may prove to be the most receptive audience to his lawyers' arguments.Federal judges in Hawaii, Washington, California, Maryland, Massachusetts and Virginia have ruled that two versions of his ban, issued Jan. 27 and March 6, violate First Amendment protections of religion. They all concluded that Trump's national security justification for the ban was far outweighed by a clear intent to discriminate against Muslims.Now Department of Justice lawyers, armed with a series of dissenting opinions from those lower courts, will plead their case before a more conservative court, with the prospect that a majority of justices may embrace their arguments.In a court filing Thursday, the department argued that a candidate's statements on the campaign trail — in this case, Trump's call for a \"Muslim\" ban — should not be considered when reviewing a president's actions. And they argued that judicial rulings have long held that presidents are to be trusted when they say they are acting to protect national security.\"There's this long line of immigration law, of precedence at the Supreme Court, that are premised on that kind of reasoning,\" said Peter Spiro, a professor at the Temple University Beasley School of Law. \"If they want to uphold the ban, the opinion writes itself.\"At issue is Trump's plan to temporarily ban most travel from Iran, Libya, Somalia, Sudan, Syria and Yemen for 90 days and suspend the entire refugee program for 120 days so the government can improve screening procedures to make sure terrorists don't slip into the country.Here is a look at some of the issues the high court will grapple with:One central question is whether a court is allowed to try and figure out the intent behind a presidential order.During his campaign, Trump called for a \"total and complete shutdown of Muslims entering the United States.\" Opponents of the ban believe that statement, combined with others made by Trump and aides before and after he became president, is proof that the ban was nothing more than a \"Muslim ban.\"But is it the role of a court to conduct that kind of analysis? Acting Solicitor General Jeffrey Wall has argued that courts cannot \"psychoanalyze\" Trump's motivations. If the text of an order is legal, Wall says, courts are not allowed to \"look behind\" that text to determine intent.The Department of Justice has pointed to a Supreme Court opinion in Kleindienst v Mandel, a 1972 ruling that found courts cannot \"look behind\" an act performed by a government employee if there is a \"facially legitimate and bona fide reason\" for the act.Five judges from the 9th U.S. Circuit Court of Appeals in San Francisco penned a dissent opinion asking how the majority could ignore that precedent when reaching its ruling to maintain a hold against Trump's first travel ban.\"Even if we have questions about the basis for the President’s ultimate findings — whether it was a \"Muslim ban\" or something else — we do not get to peek behind the curtain,\" Judge Jay Bybee, who was appointed to the 9th Circuit by President George W. Bush, wrote for the minority. \"So long as there is one 'facially legitimate and bona fide' reason for the President’s actions, our inquiry is at an end.\"Read more:While candidate Trump called for a \"Muslim\" ban during his campaign, Justice lawyers argue that he never advocated such a ban as president.Instead, they say Trump's approach to the issue evolved to the point where he focused on the national security threats from specific territories, not on people's religion. That's why he selected specific countries to ban, not every country where Muslims are predominant, they say.The first travel ban included a section that gave preference to religious minorities, a provision that Trump said was designed to help persecuted Christians living in the targeted countries. But that section was removed from the revised travel order, which Wall said should settle any doubts about the national security impetus behind the ban.\"The debate over the meaning of the President’s statements only highlights the dangers in 'opening the door' to campaign comments,\" Wall wrote this week.Christopher Hajec, director of litigation at the Immigration Reform Law Institute, which has filed briefs supporting the travel ban, said he was shocked to hear liberal judges openly scrutinizing the national security justification outlined in Trump's executive order.\"Courts are totally unequipped to do that,\" Hajec said. \"It's totally out of bounds. I don't think the majority of the Supreme Court is going to make that same mistake.\"Several judges who struck down the travel ban argued that the administration did not provide a sufficient national security justification to bar 180 million people from entering the U.S.Judge Barbara Milano Keenan, who was appointed to the U.S. Court of Appeals for the 4th Circuit by President Barack Obama, wrote that Trump's order outlines broad conditions of lawlessness in the six targeted countries, and describes each of them as terrorist safe havens. But Keenan wrote that the government never clearly established a link between conditions in those countries and its residents' likelihood of becoming terrorists.For supporters of Trump's travel ban, Keenan and other judges were overstepping their authority by even debating the president's national security argument. Wall repeatedly said during oral arguments that no court has ever scrutinized national security arguments made by a sitting president.U.S. District Judge Anthony Trenga in Alexandria, Va., provided one of the only victories for Trump when he upheld the travel ban in March. Trenga, who was appointed by George W. Bush, wrote that other courts around him were ignoring the fact that the administration made significant changes to the second travel ban to augment its national security justification.Responding to court rulings against the first ban, the revised ban included a country-by-country outline of conditions on the ground and ties to terrorist organizations. The end result, Trenga argued, was a \"detailed justification for the Order based on national security needs.\"Judge Dennis Shedd, who was appointed to the 4th Circuit by President George H. W. Bush, went further, pointing to statements by Attorney General Jeff Sessions and Department of Homeland Security Director John Kelly, who argued that the order was needed for national security.\"Shouldn't that be considered?\" Shedd asked during oral arguments in May.Contributing: Richard Wolf in Washington, D.C.", "dateOfCollection": "2017-06-02T21:42:02Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "In an emotional statement, comedian Kathy Griffin says she thinks President Trump 'broke her.'", "title": "Kathy Griffin about Donald Trump: 'He broke me'", "url": "https://www.usatoday.com/videos/news/politics/2017/06/02/kathy-griffin-donald-trump-he-broke-me/102436218/", "numberOfLinks": 1, "author": "USA TODAY", "publishedAt": "2017-06-02T21:07:01+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/8053d91dc9a2258a0283ca7a3f06eb1e3cc2b513/r=x1803&c=3200x1800/https/videos.usatoday.net/Brightcove3/29906170001/201706/579/29906170001_5457997427001_5457962191001-vs.jpg?pubId=29906170001", "article": "", "dateOfCollection": "2017-06-02T21:42:03Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "View videos and photo galleries from USA TODAY", "title": "Griffin not &#39;laying down&#39; for Trump, fears career is over", "url": "http://www.usatoday.com/videos/news/nation/2017/06/02/griffin-not-&#39;laying-down&#39;-trump,-fears-career-over/102435916/", "numberOfLinks": 0, "author": null, "publishedAt": null, "urlToImage": null, "article": "", "dateOfCollection": "2017-06-02T21:42:03Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "It's Pride month and all over the United States LGBT advocates are celebrating advances and equality.", "title": "Some of America's best gay Pride celebrations", "url": "https://www.usatoday.com/story/news/nation-now/2017/06/02/some-americas-best-gay-pride-celebrations/365127001/", "numberOfLinks": 22, "author": "Sean Rossman", "publishedAt": "2017-06-03T00:56:55+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/21105e901733baae802bab06d229d24c3fcd4da4/c=0-449-1992-1575&r=x1683&c=3200x1680/local/-/media/2017/04/04/USATODAY/USATODAY/636269350988274757-gay-pride-6.jpg", "article": "Nearly 50 years since New York City police officers raided the Stonewall Inn, gay Pride celebrations are seemingly everywhere in the United States, from small Southern towns, to Midwest cities and teeming metropolises.These vibrant displays of gay culture are now firmly part of American culture, despite a barrage of new anti-LGBT bills in more than half the states. This year's Pride events, like most of 2017, come with a tint of President Trump. The marches and parades, notes gay-rights group GLAAD, contain a hint of resistance to the new administration.\"Now, with an administration that is systematically trying to erase LGBTQ people from the fabric of this country,\" GLAAD President and CEO Sarah Kate Ellis wrote for Billboard, \"Pride is more important than ever.\"Take the worldwide Equality March for Unity & Pride, for example. The network of Pride marches across the country aims to address \"concerns about the current political landscapes and how it is contributing to the persecution and discrimination of LGBTQ+ individuals.\"Read more:Catching a Pride is easy. GayPrideCalendar.com lists hundreds of events across the world, from Vienna, Austria, to Richmond, Virginia, and San Francisco.Here is this year's list of top Pride marches, compiled with the help of the Human Rights Campaign and GLAAD:New York City held their Pride March 2016 along Fifth Avenue. (Photo: Mark Vergari/The Journal News)The Big Apple's Pride comes in late June and features rooftop parties, a street festival, a rally, luminaries and a brunch. Patti Labelle, Tegan & Sara, LeAnn Rimes and Nelly Furtado also will perform.The City of Angels' L.A. Pride 2017 includes performances by Brandy, Aaron Carter and Spencer Ludwig among a host of others. There is also a tour of Universal Studios, a Dodger game and a #ResistMarch.In the nation's capital, Pride involves a block party, a festival, rooftop pool party and a Miley Cyrus concert.The city claims its Pride gathering is one of the largest, drawing more than one million people each year. In 2016, Redfin said San Francisco's parade was the most popular based on Google Trends data. It includes a festival, rally, food, a parade and a concert. Also making Redfin's list was Chicago, which will host, for the 48th time, it's Pride Weekend in mid-June. It includes a festival, a salute to veterans, a women's comedy festival and a parade. That's not to mention the barbecue, the 10K/5K and a lot of Beyonce and Britney Spears jams.Follow Sean Rossman on Twitter: @SeanRossman", "dateOfCollection": "2017-06-02T21:42:03Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "President Donald Trump has signed two bills into law to help public safety officers and military veterans. One deals with hiring and training, while the other aims to speed claims for survivors of officers killed in the line of duty. (June 2)", "title": "Trump Signs Legislation to Aid Law Enforcement", "url": "https://www.usatoday.com/videos/news/nation/2017/06/02/trump-signs-legislation-aid-law-enforcement/102435336/", "numberOfLinks": 1, "author": "AP", "publishedAt": "2017-06-02T20:49:51+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/8053d91dc9a2258a0283ca7a3f06eb1e3cc2b513/r=x1803&c=3200x1800/https/videos.usatoday.net/Brightcove3/29906170001/201706/2717/29906170001_5457977378001_5457962159001-vs.jpg?pubId=29906170001", "article": "", "dateOfCollection": "2017-06-02T21:42:03Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "View videos and photo galleries from USA TODAY", "title": "AP FACT CHECK: Trump&#39;s Claims On Climate, Jobs", "url": "http://www.usatoday.com/videos/news/nation/2017/06/02/ap-fact-check:-trump&#39;s-claims-climate,-jobs/102435338/", "numberOfLinks": 0, "author": null, "publishedAt": null, "urlToImage": null, "article": "", "dateOfCollection": "2017-06-02T21:42:04Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "One of the men who was stabbed to death by a white supremacist on a Portland train had his backpack and wedding ring stolen off his dead body.", "title": "Portland train attack: Man arrested for stealing hero's ring", "url": "https://www.usatoday.com/videos/news/nation/2017/06/02/portland-train-attack-man-arrested-stealing-heros-ring/102428566/", "numberOfLinks": 1, "author": "Buzz60", "publishedAt": "2017-06-02T18:30:00+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/8053d91dc9a2258a0283ca7a3f06eb1e3cc2b513/r=x1803&c=3200x1800/https/videos.usatoday.net/Brightcove3/29906170001/201706/1445/29906170001_5457828847001_5457812918001-vs.jpg?pubId=29906170001", "article": "", "dateOfCollection": "2017-06-02T21:42:04Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Here are the top stories for Friday, June 2nd: The White House stands by its decision to leave the Paris agreement; China said the agreement 'should be cherished'; The UN Security Council adds 5 countries; a 12-year-old wins the National Spelling Bee.", "title": "AP Top Stories June 2 P", "url": "https://www.usatoday.com/videos/news/nation/2017/06/02/ap-top-stories-june-2-p/102435082/", "numberOfLinks": 1, "author": "AP", "publishedAt": "2017-06-02T20:44:51+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/8053d91dc9a2258a0283ca7a3f06eb1e3cc2b513/r=x1803&c=3200x1800/https/videos.usatoday.net/Brightcove3/29906170001/201706/1717/29906170001_5457972587001_5457962144001-vs.jpg?pubId=29906170001", "article": "", "dateOfCollection": "2017-06-02T21:42:07Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "In an emotional statement, comedian Kathy Griffin says she thinks President Trump is trying to ruin her life. She adds, \"He picked the wrong red-head.\"", "title": "Kathy Griffin: Trump's trying to ruin my life forever", "url": "https://www.usatoday.com/videos/news/politics/2017/06/02/kathy-griffin-trumps-trying-ruin-my-life-forever/102434846/", "numberOfLinks": 1, "author": "USA TODAY", "publishedAt": "2017-06-02T20:41:04+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/8053d91dc9a2258a0283ca7a3f06eb1e3cc2b513/r=x1803&c=3200x1800/https/videos.usatoday.net/Brightcove3/29906170001/201706/2451/29906170001_5457960236001_5457953877001-vs.jpg?pubId=29906170001", "article": "", "dateOfCollection": "2017-06-02T21:42:07Z"}]