[{"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Unlike Edward Snowden, who fled to Hong Kong and then to Moscow, Winner was easy to chase down.", "title": "Accused NSA leaker Reality Leigh Winner left easily followed trail, FBI says", "url": "https://www.usatoday.com/story/news/2017/06/06/accused-nsa-leaker-reality-leigh-winner-left-easily-followed-trail-fbi-says/102542686/", "numberOfLinks": 6, "author": "John Bacon", "publishedAt": "2017-06-06T13:06:22Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/087e0884aaae727629aaffb300b5cbd34c5a8b04/c=0-221-4848-2960&r=x1683&c=3200x1680/local/-/media/2016/10/20/USATODAY/USATODAY/636125948807171262-AP-Classified-Information-Theft.jpg", "article": "The investigation that led to the arrest of a federal contractor on charges of leaking classified material that was published by The Intercept website apparently was not the stuff of big-budget Hollywood spy films.The affidavit filed Monday against Reality Leigh Winner, 25, states that federal authorities contacted the FBI on Thursday and said a \"News Outlet\" had reached out two days earlier relating to an upcoming story. The Intercept, which published its story Monday, apparently provided authorities with a copy of a top-secret NSA document discussing details of alleged Russian interference in U.S. elections.Officials quickly determined the information was classified.\"The U.S. Government Agency examined the document shared by the News Outlet and determined the pages ... appeared to be folded and/or creased, suggesting they had been printed and hand-carried out of a secured space,\" the affidavit says.An internal audit determined that six people had accessed and printed the intelligence report, the affidavit says.\"A further audit of the six individuals' desk computers revealed that WINNER had e-mail contact with the News Outlet,\" it says. \"The audit did not reveal that any of the other individuals had e-mail contact with the News Outlet.\"Read more:No more phone calls, the FBI had a Winner. Unlike Edward Snowden, who fled to Hong Kong and then to Moscow after leaking classified documents, Winner was easy to chase down. FBI Special Agent Justin Garrick, based in Atlanta, spoke to her Saturday in her Augusta, Ga., home.\"During that conversation, WINNER admitted intentionally identifying and printing the classified intelligence reporting at issue despite not having a \"need to know,\" and with knowledge that the intelligence reporting was classified,\" the affidavit says.It adds that Winner, who had \"Top Secret\" clearance while working as a contractor with Pluribus International Corp., admitted taking the classified report from her office space and mailing it to the news outlet, even though she knew the website was not authorized to receive or possess the documents. The complaint claims Winner even acknowledged that she \"knew the contents of the reporting could be used to the injury of the United States and to the advantage of a foreign nation.\"The Intercept says the NSA document details the Russian \"spear-fishing\" attack targeting local government employees with emails that appeared to be from e-voting vendors but were designed to allow hackers to infect and gain control of computers.In late October, the hackers sent emails to 122 addresses tied to \"local government organizations,\" the document says, adding that \"officials involved in the management of voter registration systems\" were the likely targets.\"It is unknown whether the aforementioned spear-phishing deployment successfully compromised all the intended victims, and what potential data could have been accessed by the cyber actor,\" the alleged NSA document says. \"However, based upon subsequent targeting, it was likely that at least one account was compromised.\"Contributing: Kevin Johnson", "dateOfCollection": "2017-06-06T13:51:11Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "New Siri, augmented reality, and a Venmo-killer.", "title": "11 changes coming to iPhone with Apple's iOS 11", "url": "https://www.usatoday.com/story/tech/columnist/baig/2017/06/05/6-changes-coming-iphone-apples-ios-11/102517064/", "numberOfLinks": 10, "author": "Edward C. Baig", "publishedAt": "2017-06-06T10:23:08Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/bcdbb64f82a4aaf6a845b9f4b2d310f968ce1e81/c=0-118-2400-1474&r=x1683&c=3200x1680/local/-/media/2017/06/05/USATODAY/USATODAY/636322796634420014-ios-11-ipad-iphone.jpg", "article": "NEW YORK—Curious about the iPhone 8? Here's what's coming, courtesy of Apple's introduction of its new operating system.Apple kept news of a tenth anniversary iPhone under wraps on day one of its Worldwide Developers Conference in San Jose, Calif.But Tim Cook & Co. revealed plenty about the software that will be at the new iPhone’s core when it arrives, likely in the fall. As with prior iterations of Apple’s mobile operating system, iOS 11 also promises new features for current iPhone models. And Apple also reserved special love for iPads that the company can only hope helps revive a sagging brand.More Apple news: iOS 11 was released as a developer preview today. Here are eleven of the changes coming to iOS that caught my attention:The faddish popularity of last summer’s Pokemon Go release gave iPhone users an early sense of what augmented reality is all about, essentially layering characters and other “fake” stuff on top of the real world.Using a platform called ARKit, developers will be able to exploit computer vision and take advantage of what Apple maintains will be “the largest AR platform in the world,” given the vast user base of iPhones and iPads that are out there. I’m eager to see the many ways developers might do just that, in gaming, commerce and more. One thing we know: augmented reality almost always makes for a cool demo, even in its simplest form as when an Apple executive made a faux steaming cup of coffee appear on an otherwise barren tabletop.Watch out, Venmo, PayPal and Square. Apple is enabling person-to-person payments inside the Messages app, via Apple Pay and with an assist from Siri. Apple still has some explaining to do when it comes to the finer details. For example, Apple executive Craig Federighi said on stage that when you receive money from a friend it will go into an Apple Pay Cash card, of which I’d like to learn more.Attendees at WWDC 2017 in San Jose. (Photo: Jefferson Graham)At least two of the new features coming to the Maps app are potentially very handy. Apple is adding what is says are detailed floor plan maps at a variety of shopping malls and major airports. And Apple will also provide a “lane guidance” view when you take the wheel of a car.iOS 11 can silence notifications to keep you safe while driving. (Photo: Apple)Speaking of driving, this genuine safety feature is good news for drivers too easily distracted by notifications and alerts.When you turn on Do Not Disturb While Driving, iOS 11 will silence alert and notifications while keeping the screen dark. iOS 11 will use Bluetooth or Wi-Fi to measure that you’re moving in a car and if so, to suggest activating the feature. If it is activated, anyone sending you a message will get an automated response telling them that you’ll see their message when you get where you’re going. If the message  senders want to alert you about is truly urgent, they can reply urgent in the message to permit it to get through to you.Crowd of developers gets ready for the start of WWDC in San Jose, Calif. (Photo: Jefferson Graham)The proof will be in the pudding. But Apple insists that through machine learning and artificial intelligence, Siri will indeed get smarter in iOS 11, and also learn more about how to please you with personal experiences and suggestions by learning what you’re doing inside the Safari, News, Mail and Messages apps. Your Siri interactions are synced across devices (and encrypted.) I don’t know how much you’ll appreciate the new, supposedly more natural-sounding male and female Siri voices. But international travelers will likely appreciate the fact that Siri will be able to translate English words and phrases into Chinese, French, German and Spanish.iPhone photographers ought to welcome new features coming to the Photos and Camera apps, though of course I haven't put any of these to the test yet. (And who knows what kind of camera will be built into the next iPhone?) Such features include the ability to shoot Portrait Mode pictures (currently a feature on the iPhone 7 Plus only) with optical image stabilization. iOS 11 also lets you add effects and trim the short video snippets inside Live Photos images. And a new format called High Efficiency Image File Format can reduce the file size of the pics you take on an iPhone 7 or iPhone 7 Plus.New designs of any kind take getting used to but the changes to the Control Center where you can turn on Airplane mode, adjust the audio and more looks to be a positive step. Control Center packs such tools now in a single view, which you can get to with an upward swipe gesture. Meanwhile, a new lock screen also brings notifications into a unified view.On the design front, the App Store is also getting a makeover. Highlights include a new Today view with featured app content--valuable real estate for chosen app sellers of course--as well as a dedicated Games section.This is another feature I'll need to try. But Apple is promising easier one-handed typing, with easy access to numbers, symbols and punctuation.Apple Music subscribers will be able to follow, contribute and listen to shared playlists with friends and create profiles so they in turn can follow you. What’s more, Apple has opened up Apple Music to developers, giving them full access to the 40 million songs in Apple’s cloud catalog. Apple noted on the WWDC stage that Nike can add exercise playlists through the catalog, or Shazam can automatically add the songs it identifies to your music collection. Meantime, while the newly-announced $349 Siri-controlled HomePod speaker isn't coming until December, the new AirPlay 2 feature in iOS 11, will let you control Apple TV and third party speakers in multiple rooms around the house, using Control Center, the Home app or Siri.Beyond the iPhone, Apple says iOS 11 is the biggest software release ever for the iPad. Two benefits worth mentioning: drag and drop support and a new Files app, both of which would make a tablet such as the iPad Pro that much more like a Mac.Email: ebaig@usatoday.com; Follow USA TODAY Personal Tech Columnist @edbaig on Twitter", "dateOfCollection": "2017-06-06T13:51:12Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "President indicates he will continue weighing in on legal issues, foreign policy.", "title": "Trump promises to keep tweeting, accuses media of trying to convince him otherwise", "url": "https://www.usatoday.com/story/news/politics/onpolitics/2017/06/06/donald-trump-twitter-qatar-travel-ban-supreme-court/102542850/", "numberOfLinks": 10, "author": "David M Jackson", "publishedAt": "2017-06-06T13:28:47Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/f17fa5c8bcf157fac2442ba26d21e0a295de29a0/c=0-36-4591-2630&r=x1683&c=3200x1680/local/-/media/2017/06/06/USATODAY/USATODAY/636323346517596392-AFP-AFP-P44L6-91325738.JPG", "article": "WASHINGTON – So much for the idea of vetting President Trump's tweets.Trump served notice Tuesday that he will keep tweeting away, whether it's about his \"travel ban\" from selected Muslim-majority countries, the London Mayor's approach to handling the weekend's terror attack, or Middle East politics in general.Once again attacking what he calls the mainstream media early Tuesday, Trump said that \"the FAKE MSM is working so hard trying to get me not to use Social Media. They hate that I can get the honest and unfiltered message out.\"In a follow-up, Trump said: \"Sorry folks, but if I would have relied on the Fake News of CNN, NBC, ABC, CBS, washpost or nytimes, I would have had ZERO chance winning WH.\"Trump may have been referring to news reports that White House aides discussed plans to have someone check and vet presidential tweets before they orbit into cyberspace, especially ones that deal with legal issues.The tweets also come one day after lawyers across the ideological spectrum say Trump undercut his own legal case by tweeting about a pending Supreme Court case on the travel ban – in which he took aim at his own Justice Department for arguing for \"watered-down, politically correct version.\"George Conway, husband of Trump adviser Kellyanne Conway, criticized the tweets for potentially undermining the president's own agenda. \"The pt (point) cannot be stressed enough that tweets on legal matters ... seriously undermine Admin agenda and POTUS – and those who support him, as I do, need to reinforce that pt and not be shy about it,\" Conway said in his own flurry of tweets.After re-affirming his Twitter independence on Tuesday morning, Trump weighed in on the Middle East and appeared to take credit for decisions by many Arab countries to begin cutting ties to the nation of Qatar.\"During my recent trip to the Middle East I stated that there can no longer be funding of Radical Ideology,\" Trump tweeted. \"Leaders pointed to Qatar - look!\"Meanwhile, a growing number of Republican lawmakers are expressing frustration with Trump's Twitter habits.Senate Foreign Relations Committee Chairman Bob Corker, R-Tenn., said Monday: \"Probably it's best to refrain from communicating with 140 characters on topics that are so important.\"", "dateOfCollection": "2017-06-06T13:51:12Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Southwest’s big twice-a-year fare sale was rolled out Tuesday morning.", "title": "72-hour sale: Southwest fares fall below $100 round-trip", "url": "https://www.usatoday.com/story/travel/flights/todayinthesky/2017/06/06/72-hour-sale-southwest-fares-fall-below-100-round-trip/102542150/", "numberOfLinks": 8, "author": "Ben Mutzabaugh", "publishedAt": "2017-06-06T13:12:50Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/2b634632c3eff6aab1565a1553fd84019917b3e0/c=0-445-5609-3614&r=x1683&c=3200x1680/local/-/media/2016/10/04/USATODAY/USATODAY/636111383669070991-AP-Southwest-Airlines-Pilots-CEO.jpg", "article": "Southwest’s big twice-a-year fare sale is back, with round-trip fares below $100 on dozens of the carrier’s shortest routes.The sale fares also include longer routes, with the price of flights loosely tied to distance. Flights begin at $49 each way on Southwest’s shortest routes and increase to $79, $99 or $129 each way for longer flights.The sale launched Tuesday morning and is good for travel from Aug. 22 through Dec. 13. Flights on Fridays and Sundays are excluded from the sale as are certain dates around the Labor Day and Thanksgiving holidays. Schedules for Southwest’s Florida and Nevada flights have additional day-of-week restrictions.TODAY IN THE SKY: Southwest will end practice of overbooking, CEO saysThe sale fares apply specifically to non-stop options, though many connecting itineraries may also show lower-than-usual fares. Seats sold at the sale prices are capacity controlled, meaning the cheapest seats will likely sell out on individual flights. Southwest’s flights from Albany, N.Y., and Manchester, N.H., are excluded from the sale altogether.Many of Southwest’s international routes are also included in the sale, though those routes come with more day-of-travel restrictions. Fares on those routes range from $59 to about $250 each way, but are good only for flights on Tuesdays and Wednesdays during the sale period.Regardless of the details, bargain seekers will have to act quickly to snag the fares. The sale ends on Thursday (June 8) at 11:59 p.m. local time in the city of the departing flight. (Full sale details)TODAY IN THE SKY: Reno: The biggest little freight hub you’ve never heard of (story continues below)However, those used to Southwest’s previous sale fares should be warned that the availability of Southwest’s cheapest fares appears to be somewhat more limited than in past sales. The $49 fares do appear on most days on the advertised routes, but they do not always appear on every flight, according to a quick check of the carrier’s website early Tuesday morning.Using the airline’s Boston-Baltimore route as an example, the $49 one-way fares were available on just three of the airline’s 10 non-stop flights on Nov. 1 (a Wednesday). Fares on five of the day’s other flights were going for a still-low $69 while two others were selling for $150 one way.  A day later, though, nine of Southwest's 10 daily flights from Boston to Baltimore were on sale for $49 as of early Tuesday morning.Other routes showed the broad availability have made Southwest’s twice-a-year sales so noteworthy. A spot-check of Southwest’s San Francisco-to-Los Angeles for the same day (Nov. 1) showed all 10 of the day’s flights were available for $49 as of early Tuesday morning. The same was true of all 10 flights in the opposite direction for Nov. 7 (a Tuesday).Fares on some routes dropped even lower than the advertised fares. Flights between Spokane, Wash., and Boise – for example – were selling for as little as $92 round-trip early Tuesday morning. The same was true for a handful of other routes, including a limited number of $90 round-trip fares for Southwest’s flights between Chicago Midway and Minneapolis/St. Paul.The takeaway: While the sale fares are widely available through the sale window, customers with the greatest schedule flexibility will have the best luck securing the lowest advertised fares. Still, fliers should remember that the cheapest seats will likely begin to sell out as the sale goes on.The broad fare sale has become a staple for Southwest. It has rolled out similar three-day sales each June and October for the past several years. One sale from June 2015 proved so popular that it crashed Southwest’s website, prompting the carrier to extend that particular sale by an additional 24 hours. Southwest's website did not appear to be having any such issues during the current sale.IN PICTURES: 30 cool aviation photos (story continues below)In previous iterations of the sale earlier this decade, Southwest pegged fares to mileage thresholds. For example, Southwest's sales priced flights of 500 miles or less at $49 each way and increased from there. Flights of 501 to 1,000 miles cost $99 each way and flights of 1,001 to 1,500 miles cost $129 each way. Flights of more than 1,500 miles went for $149 each way.While Southwest has ended the precise mileage component of its big sales, its latest versions do closely mimic the previous distance-based sales. The carrier's four advertised sale-fare tiers — $49, $79, $129 and $149 each way — are similar to the prices offered on the distance-based sales of years past.Whatever the details, travelers can snag advertised round-trip fares as low as $98 on short routes.  Even on the airline’s longest cross-country routes, fares are as low as $258.Among the sub-$100 options with reasonable availability as of Tuesday morning were: Atlanta-Richmond, Va.; Albuquerque-Phoenix; Austin-Harlingen, Texas; Baltimore-Boston; Boise-Spokane; Burbank-San Francisco; Chicago Midway-Minneapolis/St. Paul; Cincinnati-Chicago Midway; Columbus, Ohio-Nashville; Dallas Love-Austin; Hartford-Baltimore; Des Moines-St. Louis; Memphis-Chicago Midway; Detroit-Baltimore; Fort Lauderdale-Tampa; Houston Hobby-Dallas Love; Indianapolis-Washington Reagan National; Jacksonville, Fla.-Atlanta; Kansas City-Milwaukee; Las Vegas-Oakland; Little Rock-St. Louis; Long Beach, Calif.-Sacramento; Los Angeles-El Paso; Los Angeles-Tucson; Milwaukee-Nashville; Minneapolis/St. Paul-Kansas City; Oklahoma City-Houston Hobby; Pittsburgh-Chicago Midway; Portland, Ore.-San Francisco; Reno-San Jose, Calif.; Salt Lake City-San Diego; Sacramento-Spokane; Washington Reagan National-Providence.IN PICTURES: Southwest Airlines unveils wider seats for its Boeing 737sA Southwest Airlines jet gets ready to land at Tampa International Airport on June 6, 2016. (Photo: Skip O'Rourke, Tampa Bay Times via AP)", "dateOfCollection": "2017-06-06T13:51:13Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Zaghba, who is believed to be an Italian national of Moroccan descent, was shot dead along with accomplices Khuram Butt and Rachid Redouane.", "title": "London attack: Police name Youssef Zaghba, 22, as third terrorist", "url": "https://www.usatoday.com/story/news/world/2017/06/06/london-terror-attack-police-raids/102541968/", "numberOfLinks": 19, "author": "Jane Onyanga-Omara", "publishedAt": "2017-06-06T13:19:13Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/7e522c4e141f354559ff07e7188d771b832dd473/c=0-83-4737-2759&r=x1683&c=3200x1680/local/-/media/2017/06/06/USATODAY/USATODAY/636323214851581054-AFP-AFP-PA8DQ-91472592.JPG", "article": "LONDON — Police named the third attacker in the deadly terrorist rampage that killed seven people here over the weekend as Youssef Zaghba, 22, from the eastern part of the British capital.Zaghba, who is believed to be an Italian national of Moroccan descent, was shot dead along with accomplices Khuram Butt and Rachid Redouane following the incident on London Bridge and at nearby Borough Market on Saturday night. Butt and Redouane were named by authorities on Monday.The Metropolitan Police said Zaghba was not a subject of interest to police or MI5, the domestic security agency.Police searched the homes of relatives of Butt — a Pakistani-born British citizen — and a restaurant run by his family members in Jhelum, a city 60 miles southeast of the Pakistani capital Islamabad Monday night, the Telegraph and the Sun reported. Authorities suspect Butt was radicalized in the U.K. and not in Pakistan, the newspapers said.Butt, 27, worked for London Underground  as a trainee customer services assistant for just under six months, leaving in October last year. The Telegraph reported that he worked at Westminster tube station, just a stone's throw from Parliament and had access to tunnels that run under that building. The area near Parliament was itself the victim of a terror attack in March that killed five people.An undated handout picture released by the British Metropolitan Police Service in London on June 5, 2017 shows Khuram Shazad Butt (left) and Rachid Redouane from Barking, east London, believed by police to be two of the three attackers in the June 3 terror attack on London Bridge. (Photo: HANDOUT, AFP/Getty Images)Butt and Redouane were both from Barking in east London. Redouane, 30, who claimed to be Moroccan and Libyan, also used the name Rachid Elkhdar, with a different date of birth.All three attackers were shot dead by police after ramming a van into pedestrians on the bridge and stabbing people in the market. The Islamic State claimed responsibility.A 27-year-old man was arrested in Barking Tuesday in connection with the investigation.A minute's silence was held across the country in memory of the victims at 11 a.m. local time Tuesday. Thousands of people attended a vigil for the victims in London on Monday evening.Authorities said Butt was known to security services but Redouane was not. Twelve people who were arrested in Barking on Sunday in connection with the attack have been released without charge.Italian news agency ANSA reported Tuesday that Zaghba was held at Bologna airport in March 2016 as he was about to catch a flight to Istanbul in Turkey. It said he raised suspicion because he had just a small backpack, a passport and a one-way ticket. Many foreign fighters travel from Turkey to neighboring Syria to join militants such as the Islamic State.Police searched his home but no \"particular elements\" were found other than religious documents that were downloaded from extremist sites, ANSA reported. Zaghba was released.Police named Kirsty Boden, 28, an Australian nurse who lived in London, as one of the victims on Tuesday. Christine Archibald, 30, a Canadian social worker who moved to Europe to be with her fiancé, was the first victim to be named. French authorities said a French national was also killed.Melissa McMullan told reporters on Monday that she believed her brother James McMullan, 32, from Hackney in east London, was also killed in the attack after police told the family that his bank card was found on one of the bodies.Forty-eight people were injured, 21 of them critically. NBC News reported that an American man who was shot in the head by a stray police bullet was expected to survive. The U.S. Embassy in London said it was aware of reports that U.S. citizens were injured, and was not aware that any had been killed.London Mayor Sadiq Khan suggested that President Trump’s state visit to Britain, scheduled for later this year, should be cancelled in an interview Monday.Earlier Monday, Prime Minister Theresa May said she thought Khan was doing \"a great job,” after President Trump derided and misrepresented the London mayor’s attempt to calm Londoners after the attack.“At least 7 dead and 48 wounded in terror attack and Mayor of London says there is \"no reason to be alarmed!\" Trump tweeted Sunday.  Khan had told Londoners there was no “reason to be alarmed” by an increased police presence, and said of the terrorists, “we will never let them win.”Early Monday, Trump tweeted: \"Pathetic excuse by London Mayor Sadiq Khan who had to think fast on his 'no reason to be alarmed' statement. MSM is working hard to sell it!\"Khan told British TV station Channel 4 on Monday evening: \"I don't think we should roll out the red carpet to the president of the USA in the circumstances where his policies go against everything we stand for.\"Lewis Lukens, the acting U.S. ambassador to the U.K. tweeted: “I commend the strong leadership of the mayor of London as he leads the city forward after this heinous attack.”White House spokesperson Sarah Huckabee Sanders said Trump was not “picking a fight” with Khan and that it was “utterly ridiculous”that his criticism was because Khan is Muslim. Some social media users in Britain pointed out that Trump had not criticized Andy Burnham, the mayor of Manchester, whose city was targeted by a deadly suicide bombing last month.Foreign Secretary Boris Johnson said Tuesday that he saw “no reason to rescind\" the invitation to Trump for a state visit.The Muslim Council of Britain said more than 130 imams and religious leaders from around the country refused to perform funeral prayers for the attackers.Geoff Ho, a journalist who was stabbed in the neck as he fought a terrorist in Borough Market, released a statement Tuesday saying that held off unarmed attackers near a pub until the police arrived. Two minutes later the assailants arrived at a nearby restaurant and Ho hit one of them and was stabbed.He thanked hospital staff and all who had supported him. \"Also, I want to make it clear that many of my friends are Muslim. The people who attacked me were not representative of Islam. I stand in solidarity with my Muslim brothers and sisters,\" Ho said.The London attack followed a bombing that killed 22 people at an Ariana Grande concert in Manchester, northern England, on May 22.  Ismail Abedi, 24, the brother of the suicide bomber Salman Abedi, was released without charge after he was arrested during the police investigation. Ten men remain in police custody in connection with that attack.READ MORE:", "dateOfCollection": "2017-06-06T13:51:13Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "The offensive will be difficult but will deal a decisive blow to the terror group, the U.S. general commanding the coalition said Tuesday.", "title": "Offensive to drive ISIS from Raqqa 'capital' in Syria begins", "url": "https://www.usatoday.com/story/news/world/2017/06/06/offensive-drive-isis-raqqa-capital-syria-begins/102542488/", "numberOfLinks": 2, "author": "Jim Michaels", "publishedAt": "2017-06-06T12:46:29Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/43e46b100290a4be3b15e3c223be529a4c61d848/c=0-102-2000-1232&r=x1683&c=3200x1680/local/-/media/2017/06/06/USATODAY/USATODAY/636323322446160454-AP-Islamic-State.jpg", "article": "U.S. backed forces began an offensive to rout the Islamic State from Raqqa, their de facto capital in Syria, the American-led coalition announced Tuesday.The offensive will be difficult but will deal a decisive blow to the terror group, which has been losing ground over the past year in both Iraq and Syria, said Lt. Gen. Steve Townsend, the coalition commander.Raqqa is the remaining stronghold of the terror group’s so-called caliphate. Iraqi forces are close to clearing Mosul, Iraq’s second largest city, from Islamic State control.\"It's hard to convince new recruits that ISIS is a winning cause when they just lost their twin 'capitals' in both Iraq and Syria,\" Townsend said in a statement.The offensive is being led by a coalition of Kurdish and Arab forces, which are backed by coalition advisers and airstrikes. The Trump administration recently announced it would begin supplying the Kurdish forces with arms and equipment to help in the offensive against the Islamic State, which is also called ISIS.Turkey, which is helping in the anti-ISIS fight, is opposed to the support for the Kurds because of fears the ethnic group will push for its long-time goal of carving out an independent state in parts of Turkey, Iraq and Syria.The U.S.-backed forces have been working to surround the city since November to cut off supply routes in and out of the area.The Pentagon announced recently that the coalition’s tactics are designed to annihilate the terror group so that its fighters cannot escape to establish strongholds elsewhere or launch terror attacks against Western targets.\"We all saw the heinous attack in Manchester, England,\" Townsend said in the statement.  \"ISIS threatens all of our nations, not just Iraq and Syria, but in our own homelands as well. This cannot stand.\"", "dateOfCollection": "2017-06-06T13:51:14Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "The payments could spark fresh debate about foreign money flowing to Trump firms.", "title": "President Trump's hotel received $270,000 from Saudi Arabia", "url": "https://www.usatoday.com/story/news/politics/onpolitics/2017/06/05/saudi-payments-to-hotel-owned-by-president-trump/102536764/", "numberOfLinks": 9, "author": "Fredreka Schouten", "publishedAt": "2017-06-06T11:57:46Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/fc6c4ade4c8230beb5a8d47a20ed0e0f97ff56ea/c=0-293-5760-3547&r=x1683&c=3200x1680/local/-/media/2017/06/05/USATODAY/USATODAY/636322965583836895-AP-Trump-Company-Foreign-Payments.jpg", "article": "WASHINGTON – The Trump International Hotel recently took in about $270,000 in payments tied to the Kingdom of Saudi Arabia as the country fights to roll back a U.S. terrorism law, according to newly filed lobbying reports.The spending, which covered lodging, catering and parking expenses, was disclosed in Justice Department filings last week by MSL Group Americas, a public relations firm. The filings detailed the work the firm engaged in between Oct. 1, 2016 and March 31, 2017 on behalf of the Saudis, Bahrain and other foreign governments.In a statement Monday night, Trump Organization officials said they would donate any profits from the transactions at the end of the year.The disclosure of Saudi spending, however, could spark fresh debate about President Trump’s decision to retain ownership of his real-estate and branding empire while serving in the White House. Trump turned over management of his companies to his adult sons and a veteran Trump Organization executive but still can benefit financially from his business interests.Last month, Trump visited Saudi Arabia, the first stop on the first foreign trip of his presidency.Read more:The firm reported paying more than $190,200 for lodging, $78,204 for catering and roughly $1,600 for parking at the Trump International Hotel in Washington — part of a larger campaign by the Saudis that brought U.S. military veterans to the nation’s capital to lobby against the Justice Against Sponsors of Terrorism Act or JASTA. The Daily Caller first reported on the hotel payments.Last year, Congress passed a bill over President Obama’s veto that would allow families of the victims of the Sept. 11, 2001 terrorist attacks to sue Saudi Arabia for any alleged role in the plot. The Gulf nation has denied any role in the attacks and is lobbying to ease the law’s provisions.Democrats on Capitol Hill and ethics watchdogs have argued that Trump’s continued ownership of his businesses could lead to a violation of the Constitution’s Emoluments Clause, which bars foreign payments to U.S. officials without congressional approval.White House officials referred questions about the Saudi payments to the Trump Organization.Before he took office, Trump pledged to donate foreign profits from his hotels to the U.S. Treasury. However, the Trump Organization is not trying to comprehensively identify all foreign profits to its hotel business, according to a company policy document recently provided to the House Oversight Committee.“To fully and completely identify all patronage at our properties by customer type is impractical in the service industry and putting forth a policy that requires all guests to identify themselves would impede upon personal privacy and diminish the guest experience of our brand,” the Trump Organization’s document said.Read more: ", "dateOfCollection": "2017-06-06T13:51:14Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Authorities in Columbus, Ga., are searching for a white van with blacked-out windows after police said a boy of about 10 years old was snatched from the street.", "title": "Police in Columbus, Ga., hunt for white van with tinted windows after boy snatched from street", "url": "https://www.usatoday.com/story/news/nation/2017/06/06/police-columbus-ga-hunt-van-tinted-windows-after-boy-abducted/373069001/", "numberOfLinks": 4, "author": "Matthew Diebel", "publishedAt": "2017-06-06T11:51:02Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/cce533b5d66270d03eaafa4664de1787ca24b3da/c=0-29-575-354&r=x1683&c=3200x1680/local/-/media/2017/06/06/USATODAY/USATODAY/636323284179908794-VAN14065300-G.png", "article": "Authorities in Columbus, Ga., are searching for a white van with blacked-out windows after police said a boy of about 10 years old was allegedly snatched from the street on Monday evening.According to local media, witnesses told law enforcement that a black male in his late 30s or early 40s pulled the boy, who is white, into the vehicle, which is described as a white utility van, reported local TV station WRBL.The van had a Georgia license plate with a “K” as one of the letters, the station quoted the police as saying. There was a ladder on top and a ladder on the left back door. The windshield, two front door windows and the two rear windows were described as having a “limo tint.”According to another local station, WTVM, police said that the boy had dark hair and was wearing an orange t-shirt and jeans and had been riding a green bicycle prior to the incident. Two boys of about 12 were with the victim before the alleged abduction occurred, the station reported. Police appealed for information about the incident and asked for calls to be made to the Columbus Police Department at 706-653-3400 or 706-653-3449.", "dateOfCollection": "2017-06-06T13:51:14Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "The fashion crowd wasn't the most receptive to the late night host's Trump ribbing.", "title": "Seth Meyers awkwardly jokes about Ivanka, Melania fashion at CFDA Awards", "url": "https://www.usatoday.com/story/life/entertainthis/2017/06/06/seth-meyers-awkwardly-jokes-trump-ivanka-melania-fashions-cfda-awards/102541382/", "numberOfLinks": 15, "author": "Maeve McDermott", "publishedAt": "2017-06-06T13:05:01Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/caeee7d0e06c3068762116293e914b4b89fe2a39/c=0-151-3000-1846&r=x1683&c=3200x1680/local/-/media/2017/06/06/USATODAY/USATODAY/636323105236931756-GTY-692741706-91468208.JPG", "article": "Seth Meyers onstage at the 2017 CFDA Fashion Awards. (Photo: Theo Wargo, Getty Images)Despite his reputation for cracking down on the Trump administration, Seth Meyers mostly stuck to a politics-free monologue at Monday's Council of Fashion Designers of America (CFDA) Awards, where he served as host.But in-between the jokes about romphims and Balenciaga's Ikea bag at the New York City gala, known as \"fashion's Oscars\" for its high-wattage attendees, the Late Night host included some style-related Trump content in his opening speech, to mixed results from the audience.\"Abercrombie & Fitch has announced it's putting itself up for sale. Meanwhile, thanks to Donald Trump, the United States has become a Banana Republic,\" he said, the room staying quiet.More successful was his joke about the Trumps' recent overseas trip. \"It's harder than ever to separate fashion from politics. First Lady Melania Trump made headlines recently after she decided not to wear a head cover while visiting Saudi Arabia,\" he said. \"Which was especially shocking, since her husband wears a head covering literally everywhere.\"But the crowd didn't react as favorably to Meyers' follow-up joke about Ivanka Trump's Nordstrom line. \"Big year for fashion designer Ivanka Trump,\" he said. \"I've heard her clothes are flying off the shelves in Nordstrom.\"While Meyers was the evening's only presenter to refer to President Trump by name, Janelle Monae also touched on politics in her speech later in the evening. The singer-turned-actress was given the Board of Directors' Tribute along with Gloria Steinem and Planned Parenthood president Cecile Richards.Designer Raf Simons was the other big winner of the night, receiving both the womenswear and menswear designer of the year awards for his work at Calvin Klein.p.p1 {margin: 0.0px 0.0px 0.0px 0.0px; font: 9.0px Arial}\r\nspan.s1 {font-kerning: none}\r\np.p1 {margin: 0.0px 0.0px 0.0px 0.0px; font: 9.0px Arial}\r\nspan.s1 {font-kerning: none}\r\np.p1 {margin: 0.0px 0.0px 0.0px 0.0px; font: 9.0px Arial}\r\nspan.s1 {font-kerning: none}\r\n", "dateOfCollection": "2017-06-06T13:51:15Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Minnesota Senator calls Maher's racial slur \"inappropriate and offensive\" and is glad host apologized.", "title": "Al Franken bows out of 'Real Time' after Bill Maher slur", "url": "https://www.usatoday.com/story/life/tv/2017/06/05/al-franken-cancels-real-time-after-bill-maher-slur/102532600/", "numberOfLinks": 5, "author": "Bill Keveney", "publishedAt": "2017-06-06T12:23:01Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/6e74e749d2501c0b00a331a8630334bb2c89d13f/c=0-111-2085-1289&r=x1683&c=3200x1680/local/-/media/2017/06/05/USATODAY/USATODAY/636322873267571249-Al-Franken.jpg", "article": "Bill Maher continues to feel the fallout from last week's on-air racial slur: U.S. Sen. Al Franken has canceled a scheduled appearance this Friday on Real Time With Bill Maher.A spokesman for the Minnesota Democratic senator said Monday that Franken would not appear on this week's edition of the HBO talk show. Franken, who recently released a new book, Al Franken, Giant of the Senate, was scheduled for the single-guest interview slot that immediately follows Maher's opening monologue.\"Senator Franken believes that what Bill Maher said was inappropriate and offensive, which is why he made the decision not to appear on the next episode of Real Time. He was glad to see Bill — who the Senator considers to be a good friend — apologize and and express sincere regret for his comment,\" Franken spokesman Michael Dale-Stein said in a statement.Bill Maher has been severely criticized for his use of a racial slur on Friday's edition of 'Real Time with Bill Maher.' He has apologized. (Photo: Janet Van Ham, HBO)Maher has come under considerable criticism and some have called for his firing after his use of an offensive term for African-Americans during an interview with Sen. Ben Sasse, R-Neb., on Friday's episode of Maher's irreverent political talk show.In a statement Saturday, HBO called Maher's comment \"inexcusable and tasteless\" and said it was removing the word from subsequent broadcasts of the show. The network, which has taken no other action, has not announced a replacement for Franken on Friday's show.Franken isn't the first guest to bail on Maher this season. Journalist Jeremy Scahill canceled in February after Maher invited the controversial Milo Yiannopoulos, then a Breitbart editor, to appear on the show.", "dateOfCollection": "2017-06-06T13:51:15Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "The Justice Department has announced charges against an NSA contractor for allegedly leaking classified information to a news organization. 25 year old Reality Winner reportedly removed confidential information from an NSA site in Georgia. The charges were announced after The Intercept published an NSA briefing about the alleged Russian meddling in last year's election. Winner worker as a contractor for Pluribus International Corporation & had been working at the NSA since February. She is charged wth \"gathering, transmitting or losing defence information\"\r\nVideo provided by TheStreet", "title": "NSA contractor arrested or leaking classified information", "url": "https://www.usatoday.com/videos/news/politics/2017/06/06/nsa-contractor-arrested-leaking-classified-information/102543620/", "numberOfLinks": 1, "author": "Newslook", "publishedAt": "2017-06-06T13:03:47+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/46edae5f6bf18be087c811f58401b62e0c349bb1/c=0-50-540-355&r=1280x720&r=x1803&c=3200x1800/local/-/media/2017/06/01/USATODAY/USATODAY/636319552319460571-FBI-logo.jpg", "article": "", "dateOfCollection": "2017-06-06T13:51:16Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Jerita had no idea her children were about to surprise her with a new car after she graduated from law school.", "title": "64-year-old law school graduate gets epic surprise from her children", "url": "https://www.usatoday.com/videos/news/humankind/2017/06/06/64-year-old-law-school-graduate-gets-epic-surprise-her-children/102544176/", "numberOfLinks": 1, "author": "Humankind", "publishedAt": "2017-06-06T13:30:31+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/8053d91dc9a2258a0283ca7a3f06eb1e3cc2b513/r=x1803&c=3200x1800/https/videos.usatoday.net/Brightcove3/29906170001/201706/3770/29906170001_5461331655001_5461304710001-vs.jpg?pubId=29906170001", "article": "", "dateOfCollection": "2017-06-06T13:51:16Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "The EPA head said the “coal sector” added 7,000 jobs in May and “almost 50,000 jobs” since the fourth quarter of last year. But the Bureau of Labor Statistics reports an increase of just 400 coal mining jobs in May and 1,300 since December.", "title": "Fact check: EPA Administrator Scott Pruitt and coal jobs", "url": "https://www.usatoday.com/story/news/politics/2017/06/06/fact-check-epa-administrator-scott-pruitt-coal-jobs/102543930/", "numberOfLinks": 8, "author": "Eugene Kiely", "publishedAt": "2017-06-06T17:25:35+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/ab9ad164cd5b80ab7edffecd94a67a6c58b672bf/c=0-246-2996-1939&r=x1683&c=3200x1680/local/-/media/2017/06/06/USATODAY/USATODAY/636323374901351869-GTY-691612732.jpg", "article": "The Environmental Protection Agency head said that the “coal sector” added 7,000 jobs in May and “almost 50,000 jobs” since the fourth quarter of last year. But the Bureau of Labor Statistics reports an increase of just 400 coal mining jobs in May and 1,300 since December.EPA Administrator Scott Pruitt made his remarks on NBC’s Meet the Press. Host Chuck Todd played a clip of former vice president Al Gore blaming the loss of coal jobs on technology and competition. Gore said “promising to re-create the 19th century is not a visionary strategy.”Todd, June 4: \"Is he right that you guys are making a false promise, though, to some of these fossil-fuel industries?\"Pruitt: \"Dead wrong. Because the numbers show exactly the opposite in fact since the fourth quarter of last year to most recently added almost 50,000 jobs in the coal sector. In the month of May alone, almost 7,000 jobs.\"We asked the EPA where Pruitt got his data, but we did not receive a response.We did find, however, that the Bureau of Labor Statistics had somewhat similar figures for all mining jobs in its June 2 press release for May employment data:BLS, June 2: \"Total nonfarm payroll employment increased by 138,000 in May, compared with an average monthly gain of 181,000 over the prior 12 months. In May, job gains occurred in health care and mining. (See table B-1.)\"Employment in health care rose by 24,000 in May. Hospitals added 7,000 jobs over the month, and employment in ambulatory health care services continued to trend up (+13,000).\"Job growth in health care has averaged 22,000 per month thus far in 2017, compared with an average monthly gain of 32,000 in 2016. Mining added 7,000 jobs in May. Employment in mining has risen by 47,000 since reaching a recent low point in October 2016, with most of the gain in support activities for mining.\"As for coal mining jobs, BLS says there were 51,000 jobs in May, up 400 from 50,600 jobs in April. Since December 2016, the number of coal jobs has increased by 1,300, according to the BLS.The biggest increase in mining jobs was in the category of “support activities for mining.” There were 292,400 such support jobs in May, up 7,900 jobs from April. BLS could not tell us how many of those jobs were related to coal mining, as opposed to gas, oil, metal ores and nonmetallic minerals. We do know, however, that most of those jobs support the gas and oil industries. There were 211,700 support jobs for oil and gas operations in April, according to the BLS.The American Coal Council, an industry trade group, estimates that there are “over 80,000 coal jobs” in the U.S., including support jobs. In an email, Terry Headley, a spokesman for the council, provided us a link to a report by the National Mining Association that showed there were 81,842 coal jobs in 2016. He said that figure includes support jobs, such as truck drivers, electricians, surveyors, mechanics and service technicians — explaining why it is higher than the BLS figure of 51,000.We don’t know where Pruitt got his figures, but BLS data do not support his claim that the coal sector added 7,000 jobs in May and almost 50,000 since the fourth quarter of last year.", "dateOfCollection": "2017-06-06T13:51:16Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "On Tuesday, 79-year-old Bill Cosby arrived at the Pennsylvania courthouse with his spokesman, Andrew Wyatt for the second day of his trial on sex assault charges. (June 6)", "title": "Raw: Cosby arrives on day 2 of sex assault trial", "url": "https://www.usatoday.com/videos/news/nation/2017/06/06/raw-cosby-arrives-day-2-sex-assault-trial/102543820/", "numberOfLinks": 1, "author": "AP", "publishedAt": "2017-06-06T13:13:41+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/8053d91dc9a2258a0283ca7a3f06eb1e3cc2b513/r=x1803&c=3200x1800/https/videos.usatoday.net/Brightcove3/29906170001/201706/2542/29906170001_5461319205001_5461306709001-vs.jpg?pubId=29906170001", "article": "", "dateOfCollection": "2017-06-06T13:51:17Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "After Intelligence contractor Reality Leigh Winner was arrested and charged with sharing top secret National Security documents about Russia with the media, Wikileaks founder Julian Assange says she “must be supported”.  Josh King has the story (@abridgetoland).", "title": "Julian Assange says we should 'support' alleged NSA leaker", "url": "https://www.usatoday.com/videos/news/politics/2017/06/06/julian-assange-says-we-should-support-alleged-nsa-leaker/102543258/", "numberOfLinks": 1, "author": "Buzz60", "publishedAt": "2017-06-06T12:53:50+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/8053d91dc9a2258a0283ca7a3f06eb1e3cc2b513/r=x1803&c=3200x1800/https/videos.usatoday.net/Brightcove3/29906170001/201706/3166/29906170001_5461302873001_5461279463001-vs.jpg?pubId=29906170001", "article": "", "dateOfCollection": "2017-06-06T13:51:17Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Secretary of State Rex Tillerson says President Trump wants him to rebuild Russian ties, despite what's happening politically at home.", "title": "Tillerson: President Trump ordered me to fix relations with Russia", "url": "https://www.usatoday.com/videos/news/politics/2017/06/06/tillerson-president-trump-ordered-me-fix-relations-russia/102542926/", "numberOfLinks": 1, "author": "Buzz60", "publishedAt": "2017-06-06T12:28:52+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/8053d91dc9a2258a0283ca7a3f06eb1e3cc2b513/r=x1803&c=3200x1800/https/videos.usatoday.net/Brightcove3/29906170001/201706/1322/29906170001_5461280555001_5461279688001-vs.jpg?pubId=29906170001", "article": "", "dateOfCollection": "2017-06-06T13:51:17Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "View videos and photo galleries from USA TODAY", "title": "ShowBiz Minute: Cosby, CFDA, &#39;Spider-Man&#39;", "url": "http://www.usatoday.com/videos/news/nation/2017/06/06/showbiz-minute:-cosby,-cfda,-&#39;spider-man&#39;/102542920/", "numberOfLinks": 0, "author": null, "publishedAt": null, "urlToImage": null, "article": "", "dateOfCollection": "2017-06-06T13:51:18Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "The 17-year-old will not serve prison time in the fight that led to the death of Amy Inita Joyner-Francis.", "title": "Teen gets 6 months in residential program for fatal Delaware bathroom fight", "url": "http://www.delawareonline.com/story/news/crime/2017/06/05/teens-sentenced-today-joyner-francis-death-case/366016001", "numberOfLinks": 5, "author": "Jessica Masulli Reyes", "publishedAt": "2017-06-06T16:07:37+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/d417b22c52c51011501946c177bf2b00ba2c9f83/c=0-51-1997-1179&r=x1683&c=3200x1680/local/-/media/2017/06/06/USATODAY/USATODAY/636323322654993741-trinity-carr-060617.jpg", "article": "A 17-year-old girl will not serve prison time for last year's fatal attack of Howard High School of Technology sophomore Amy Inita Joyner-Francis.Even though Joyner-Francis' mother and a state prosecutor implored the judge to send Trinity Carr to a juvenile prison, the judge sentenced her to six months at Grace Cottage – a secure residential program for female youth near Wilmington. He also banned her from social media and ordered her to complete various other forms of probation and community service until age 21.Zion Snow, 17, who was accused of planning the attack but never punching Joyner-Francis, was sentenced to 18 months of community supervision.\"It is a case in which no one is looking to determine who wins and who loses because everyone has lost,\" said Family Court Judge Robert Coonin. \"The community has lost, the defendants and their families have lost, and most importantly, Amy's family has lost.\"Nothing that any of us say or do here can ever change that – myself included.\"Last April, 16-year-old Joyner-Francis died after a brutal fight in the high school bathroom exacerbated her pre-existing heart condition. Dozens of girls watched the confrontation as it unfolded, and at least two recorded it on their cell phones.Video and social media postings helped the state secure convictions against two out of the three girls accused of having a role in the planning and carrying out of the attack.In Family Court in Wilmington on Monday, the two girls – Carr and Snow – appeared before Coonin for sentencing. Behind them sat not only their parents, but Joyner-Francis' family members.Although Joyner-Francis' family did not speak, Deputy Attorney General Phillip Casale read a letter from her mother in which she said changes need to be made to the criminal justice system so juveniles will think twice before harming anyone.STORY: Joyner verdict shows 'consequences' of actionsSTORY: Editorial: Joyner-Francis verdict has no silver lining\"They took another human being's life,\" Inita B. Joyner wrote. \"A child's life, my baby's life, and this is not acceptable in any manner.\"In the letter, Joyner-Francis' mother recalled her daughter as a child \"full of life\" who dreamed of becoming a doctor or pursuing a law career.\"As Amy's mother, I am very proud of the positive person she has become,\" Joyner said. \"Amy never ceased to amaze me with how mature and kind she was.\"Casale argued that a prison term would send a message to Carr and the community about what is expected of teens, even though her conviction for criminally negligent homicide and third-degree conspiracy came with no mandatory incarceration in Family Court.Prosecutors sought last year to have Carr tried as an adult in Superior Court, where she could have faced up to eight years in prison, but the judge determined she was amenable to rehabilitation in Family Court.Amy Inita Joyner-Francis, 16, died after an assault in a bathroom at Howard High School in Wilmington in April 2016. (Photo: BRITTANY HORN/THE NEWS JOURNAL)Coonin again disagreed with prosecutors on Monday when Casale and State Prosecutor Sean Lugg requested Carr be sent to a facility in Indiana, since Delaware has no juvenile prison for females.Carr's attorney, John Deckers, argued that the cornerstone of juvenile justice is that children shouldn't be judged by the worst thing they've ever done. The focus must be rehabilitation and the best interest of the child, he said.\"Children are well worth the investment of time and services because they are mentally, psychologically resilient and open to change,\" he said. \"Their behavior is correctable, and they are capable of becoming caring, productive members of society.\"Deckers added that the public backlash Carr has faced should not be underestimated.\"This is a very real consequence to Trinity and her family and her siblings and her parents that survives no matter what happens, no matter what sentence this court imposes,\" he said. \"Please, your honor, don't underestimate the vile, despicable nature of this backlash.\"Deckers said Carr is making positive changes in her life by attending counseling, following her pre-trial conditions and sharing her story with teens.After hearing the two sides, Coonin decided that prison in another state would not be appropriate. He ordered Carr to be taken to Grace Cottage, followed by non-residential after-care treatment until age 19 and then two years of adult probation.Carr must also complete 500 hours of community service with an emphasis on serving young people who have been abused or bullied and pay a to-be-determined amount of restitution.Snow, who was found delinquent of third-degree conspiracy, was sentenced to 18 months of community supervision and 300 hours of community service.Coonin said he hopes that by banning both from social media while they are serving their sentences, it will help them regain an \"appropriate appreciation\" for others and understand the effect of social media.“I hope, with this sentence, that you can gain the tools to understand and perhaps help others so this horrible event does not get repeated,\" Coonin said.Monday's sentencing came more than a year after the fatal fight shook not only the school community, but the state and nation.During an April bench trial in Family Court, prosecutors accused Carr, Snow and Chakiera Wright of planning the confrontation in the 20 hours before the attack. Wright was found not delinquent after Coonin said there was insufficient evidence to show she participated in the plan.Councilwoman Sherry Dorsey Walker, speaks to media after the sentencing of Trinity Carr and Zion Snow for their roles in the death of Howard High School classmate Amy Inita Joyner-Francis. (Photo: Jennifer Corbett, The News Journal)At the center of the prosecution's case was cellphone video of the assault. The video shows Carr dragging Joyner-Francis by her long, braided hair through a handicap-accessible stall in the bathroom. Carr swings her arms and lands punches onto the head and torso of Joyner-Francis, who was on the floor clutching her purse.During the trial, the attorneys litigated questions such as what a “reasonable” person should expect as a result of a fight, what type of clothing is worn by kids preparing to fight, and whether Joyner-Francis was a participant in the fight. The defense argued Carr could not have foreseen that Joyner-Francis would die as a result of the fight.Furthermore, evidence presented during trial – including threatening messages posted by Snow on social media saying “we gonna get her” – demonstrated Carr and Snow were planning to attack Joyner-Francis, Coonin said.After Monday's sentencing, Deckers declined to comment. Lugg called the sentence \"appropriate.\"\"As all noted, Amy can never be brought back,\" he said. \"But this is something that will hopefully give closure to all involved and allow for this community to heal.\"Sherry Dorsey Walker, former Wilmington councilwoman who was acting as a spokesperson for Joyner-Francis’ family, said the family knew the type of justice they wanted would not be possible with the case being tried in Family Court.\"I don't think there will ever be anything such as closure as it pertains to this situation because Amy will never come home,\" she said. \"So while one of the assailants gets to be at Grace Cottage and her parents can come visit her on a regular basis that is not something Amy's family can do.\"Contact Jessica Masulli Reyes at 302-324-2777, jmreyes@delawareonline.com or Twitter @JessicaMasulli. ", "dateOfCollection": "2017-06-06T13:51:21Z"}]