[{"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Energy companies braced for record demand as scores of flights were canceled.", "title": "Withering heat sweeps Southwest; Phoenix braces for 120 degrees", "url": "https://www.usatoday.com/story/news/nation/2017/06/20/withering-heat-sweeps-southwest-phoenix-braces-120-degrees/103030730/", "numberOfLinks": 5, "author": "John Bacon and Ryan Randazzo", "publishedAt": "2017-06-20T14:48:56Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/ab451de1b53c3ad82910dbc927d8536436517c4a/c=0-199-2996-1892&r=x1683&c=3200x1680/local/-/media/2017/06/20/USATODAY/USATODAY/636335480258562767-AP-Heat-Wave-Air-Conditioning.jpg", "article": "A brutal heat wave in the Southwest grounded some jets and prompted energy conservation warnings as air conditioners roared through a swelter that could bring 120-degree temperatures to some areas.\"We are looking at record-setting heat in the Southwest for the next two or three days, and this is an area that doesn't need records to be very, very hot,\" National Weather Service meteorologist Andrew Orrison told USA TODAY.The heat, blamed on a large and persistent high pressure system, is scorching parts of California, Nevada, Arizona and New Mexico. Sin City will be sun city Tuesday and Wednesday, when forecast highs of 117 and 116 could break records for those days, Orrison said.Power companies were on alert. The California Independent System Operator Corporation, which manages 80% of the state's power grid, issued a statewide call for voluntary conservation from 2 p.m. to 9 p.m. Tuesday and Wednesday.\"Consumers are urged to conserve electricity, especially during the late afternoon when air conditioners typically are at peak use,\"  the alert said, adding that businesses and residents can help avoid power outages by turning off lights, not using major appliances during the heat of the day and setting air conditioners to 78 degrees or higher.Read more:In Arizona, power companies expressed confidence they could keep air conditioners running. Phoenix reached 118 degrees on Monday and faced forecast highs Tuesday of 120 degrees and Wednesday of 116 degrees. Phoenix's record-high temperature of 122 degrees was set on June 26, 1990.\"It may not break the record, but it will at least get very close,\" Orrison said. \"And there will be a number of daily records broken across the Southwest this week.\"Both Arizona Public Service Co. and Salt River Project expect heavy energy demand that could approach or exceed records, Salt River spokeswoman Patty Garcia-Likens said.\"We feel confident we can meet the demands of our customers,\" she said. \"We work throughout the year to prepare for days like this.\"Salt River set its power-demand record last year on June 19, from 4 to 5 p.m. as temperatures in metro Phoenix hit 118 degrees.American Airlines canceled dozens of regional flights out of Sky Harbor International Airport in Phoenix because its Bombardier CRJ aircraft have a maximum operating temperature of 118 degrees. Tuesday's forecast high for Phoenix was 120 degrees, and the flights that are affected were to take off from 3 to 6 p.m.Larger jets have higher maximum operating temperatures — Boeing, 126 degrees, and Airbus, 127 degrees — and can handle the intense heat, the airline said.Orrison said the high-pressure system should drift off by week's end, taking the edge off the heat.\"It will cool down, but it will still be summer,\" Orrison said. \"We have a long way to go.\"Bacon reports for USA TODAY, Hansen for The Arizona Republic. Contributing: Zachary Hansen, The Arizona Republic", "dateOfCollection": "2017-06-20T15:31:18Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "A U.S. warplane shot down an armed drone linked to Syrian regime forces, the Pentagon said Tuesday.", "title": "U.S. warplane blasts Syrian drone from sky", "url": "https://www.usatoday.com/story/news/world/2017/06/20/united-states-warplane-blasts-syria-drone-sky/103033150/", "numberOfLinks": 2, "author": "Jim Michaels", "publishedAt": "2017-06-20T15:14:04Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/d5a90aeff4683e63582e966ffda26555dc432c7d/c=0-40-3888-2237&r=x1683&c=3200x1680/local/-/media/2017/06/20/USATODAY/USATODAY/636335537202297045-AFP-AFP-PQ7YJ.jpg", "article": "WASHINGTON — A U.S. warplane shot down an armed drone linked to Syrian regime forces, the Pentagon said Tuesday, the latest in a series of incidents between U.S.-backed forces and the regime of Bashar Assad that threatens to escalate the conflict there.The drone, a Shaheed-129, was shot down by an F-15E Strike Eagle after it \"displayed hostile intent and advanced on coalition forces,\" the U.S. military said in a statement.The incident occurred in the same vicinity as previous conflicts with pro-regime forces, near the combat outpost in At-Tanf, where a contingent of U.S. and coalition advisers are supporting a force to fight the Islamic State, also known as ISIS.The U.S. action also comes two days after a U.S. warplane shot down a Syrian plane that was attacking U.S.-backed forces near Raqqa, the Islamic State's de facto capital.On Sunday, a U.S. Navy F/A-18 warplane shot down a Syrian Air Force Su-22 that had dropped bombs near Syrian opposition forces.That took place near the Syrian city of Taqba, which has been the focus of fighting as U.S.-sponsored ground forces advance on the ISIS stronghold of Raqqa.Contributing: Tom Vanden Brook", "dateOfCollection": "2017-06-20T15:31:19Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "North Korea's deplorable record of human rights offenses speaks for itself.", "title": "North Korean treatment of Western prisoners is bizarre, not always physically brutal", "url": "https://www.usatoday.com/story/news/2017/06/19/north-korean-treatment-western-prisoners-bizarre-not-always-physically-brutal/103022748/", "numberOfLinks": 9, "author": "Mike James", "publishedAt": "2017-06-20T09:44:54Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/761c52d08d3ab4b8efdd5500e9251c17eebaec49/c=0-127-2500-1539&r=x1683&c=3200x1680/local/-/media/2017/06/14/USATODAY/USATODAY/636330064429069453-AFP-AFP-PI8KV.jpg", "article": "North Korea's deplorable record of human rights offenses speaks for itself. But the most curious element of the Otto Warmbier tragedy is why the young student may have been so badly mistreated at the hands of his captors, who some survivors say are strangely cordial to Western prisoners.Consider the case of Matthew Todd Miller, a California man who in 2014 was sentenced to six years of forced labor in North Korea. Miller, who was released six months later, says he was actually treated rather well and even was allowed to keep his iPhone and iPad for at least a month. He listened to his digital music while in captivity.\"I was prepared for the torture. But instead of that, I was killed with kindness,\" he said in an interview with NK News.Warmbier, 22, died Monday after coming back to the U.S. in a coma that lasted for 15 months of his North Korean captivity. The New York Times wrote that intelligence reports suggested Warmbier endured beatings, but doctors in the U.S. who examined him last week say his body shows no signs of physical trauma.Miller, who was not much older than Warmbier at the time of his arrest, said he was held in what he described as a “guest house” – the same place where he said fellow American Kenneth Bae was being held. “They would deliver me food. There were other prisoners in the guest house, too. I could hear them unlocking the doors from the outside to deliver them food.\"Bae told reporters and wrote in his book \"Not Forgotten\" that while there were psychological abuses — he was interrogated 15 hours a day and it let up only after he agreed to sign a paper saying he was a terrorist — he was never beaten. He was freed in 2014 and returned to the U.S., along with Miller.“There seems to be a general attitude of not using physical violence against Americans, although they don’t appear unwilling to use psychological tactics and that sort thing,” Robert R. King, a former State Department special envoy for North Korea human rights issues, told the Times. King handled Mr. Warmbier’s case until he retired in January.READ MORE:“This situation with Warmbier is likely something that happened that (North Korea) did not intend,” King said.In most cases, Western prisoners are coveted as political bargaining chips in the North Korean system. Unlike their own citizens, a Westerner is likely to be released someday and bruises or abuses would be detected. But psychological abuse, based on reports from freed captives, appears to be the norm for Western prisoners until they confess. Aijalon Gomes, an American teacher detained in North Korea in 2010 for 213 days, said in a 2015 interview that he was held in a freezing, tiny cell.\"After a wooden door was opened, I was untied and forced into the cement crawl space.  It was no bigger than a dog’s house,\" Gomes said in the interview. \"A little while later, an old blanket that looked like carpet underlayment was thrown in. And later still, a package of Korean or Chinese snack food was tossed in.\"READ MORE:Merrill E. Newman, an 85-year-old former U.S. Army officer who served in the Korean War, was held by North Korea for 42 days in 2013, accused of war crimes. He spent most of his time in captivity at the Yanggakdo Hotel in Pyongyang, where Swedish consular officials reported that he seemed to be well cared for and was even receiving necessary medications for a heart condition. Newman reported after his release that he had been held in comfortable conditions, although he said his \"confession\" to North Korean authorities was coerced.Not every American has been given a pass on violence in North Korea. In an interview with the South Korean news agency Yonhap, Robert Park, a missionary held in North Korea in 2009, said he was severely beaten by soldiers.Park, from Tucson, Ariz., said women with clubs beat him mercilessly in the genitals.\"I saw the devil in their eyes. They are much worse than people in Nazi Germany,\" Park said. The torture went on for days in what Park now believes was an attempt to keep him silent about torture. He said he thought that his captors wanted to drive the idea in his head that he should commit suicide after his release.\r\n\"North Korea would not have released me if they thought that I could recover\" from the torture, Park said.", "dateOfCollection": "2017-06-20T15:31:19Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "In a hidden room in a house near Argentina’s capital, police believe they have found the biggest collection of Nazi artifacts in the country’s history.", "title": "Behind a secret door in Argentina, a huge Nazi trove with apparent connections to Hitler", "url": "https://www.usatoday.com/story/news/world/2017/06/20/behind-secret-door-argentina-nazi-trove-connections-hitler/411361001/", "numberOfLinks": 7, "author": "Debora Rey", "publishedAt": "2017-06-20T14:44:33Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/a58142eed80c1f5f97aa66a7211a4cf79515b15b/c=0-111-1260-823&r=x1683&c=3200x1680/local/-/media/2017/06/20/USATODAY/USATODAY/636335377398384492-ADOLF-JPEG.jpg", "article": "BUENOS AIRES, Argentina - In a hidden room in a house near Argentina’s capital, police believe they have found the biggest collection of Nazi artifacts in the country’s history, including a bust relief of Adolf Hitler, magnifying glasses inside elegant boxes with swastikas and even a macabre medical device used to measure head size.Some 75 objects were found in a collector’s home in Beccar, a suburb north of Buenos Aires, and authorities say they suspect they are originals that belonged to high-ranking Nazis in Germany during World War II.“Our first investigations indicate that these are original pieces,” Argentine Security Minister Patricia Bullrich told The Associated Press on Monday, saying that some pieces were accompanied by old photographs. “This is a way to commercialize them, showing that they were used by the horror, by the Fuhrer. There are photos of him with the objects.”A Nazi medical device used to measure head size is seen at the Interpol headquarters in Buenos Aires, Argentina. In a hidden room in a house near Argentina's capital, police discovered the biggest collection of Nazi artifacts in the country's history. Authorities say they suspect they are originals that belonged to high-ranking Nazis in Germany during World War II. (Photo: Natacha Pisarenko, AP)Among the disturbing items were toys that Bullrich said would have been used to indoctrinate children, a large statue of the Nazi Eagle above a swastika, a Nazi hourglass and a box of harmonicas.Police say one of the most-compelling pieces of evidence of the historical importance of the find is a photo negative of Hitler holding a magnifying glass similar to those found in the boxes.Artifacts bearing Nazi symbols that were recovered by the Argentine Federal Police. (Photo: David Fernandez, EPA)“We have turned to historians and they’ve told us it is the original magnifying glass” that Hitler was using, said Nestor Roncaglia, head of Argentina’s federal police. “We are reaching out to international experts to deepen” the investigation.The photograph was not released to the public, but was shown to The Associated Press on the condition that it not be published.A member of the Argentinian federal police holds an hourglass with Nazi markings. (Photo: Natacha Pisarenko, AP)The investigation that culminated in the discovery of the collection began when authorities found artworks of illicit origin in a gallery in north Buenos Aires.Agents with the international police force Interpol began following the collector and with a judicial order raided the house on June 8. A large bookshelf caught their attention and behind it agents found a hidden passageway to a room filled with Nazi imagery.A knife with Nazi markings is seen at the Interpol headquarters in Buenos Aires. (Photo: Natacha Pisarenko, AP)Authorities did not identify the collector, who remains free but under investigation by a federal judge.“There are no precedents for a find like this. Pieces are stolen or are imitations. But this is original and we have to get to the bottom of it,” said Roncaglia.Police are trying to determine how the artifacts entered Argentina.Detail of artifacts bearing Nazi symbols that were recovered by the Argentine Federal Police. (Photo: David Fernandez, EPA)The main hypothesis among investigators and member of Argentina’s Jewish community is that they were brought to Argentina by a high-ranking Nazi or Nazis after World War II, when the South American country became a refuge for fleeing war criminals, including some of the best known.A member of the Argentine Federal Police  stands next to artifacts bearing Nazi symbols that were recovered by the federal police. (Photo: David Fernandez, EPA)As leading members of Hitler’s Third Reich were put on trial for war crimes, Josef Mengele fled to Argentina and lived in Buenos Aires for a decade. He moved to Paraguay after Israeli Mossad agents captured Holocaust mastermind Adolf Eichmann, who was also living in Buenos Aires. Mengele later died in Brazil in 1979 while swimming in a beach in the town of Bertioga.A bust of Adolf Hitler was among the finds. (Photo: David Fernandez, EPA)While police in Argentina did not name any high-ranking Nazis to whom the objects might have originally belonged, Bullrich noted there were medical devices.“There are objects to measure heads that was the logic of the Aryan race,” she said.Ariel Cohen Sabban, president of the DAIA, a political umbrella for Argentina’s Jewish institutes, called the find “unheard of” in Argentina.“Finding 75 original pieces is historic and could offer irrefutable proof of the presence of top leaders who escaped from Nazi Germany,” Cohen told the AP.RELATED STORIES\n ", "dateOfCollection": "2017-06-20T15:31:20Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "The presidential son-in-law finally breaks his silence. And now we know.", "title": "Jared Kushner speaks and Twitter goes wild", "url": "https://www.usatoday.com/story/news/politics/onpolitics/2017/06/19/jared-kushner-speaks-and-twitter-goes-wild/103026884/", "numberOfLinks": 11, "author": "Carolyn McAtee Cerbin", "publishedAt": "2017-06-20T12:53:10Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/08c51f58bdd6171aa5798941098afd15188fa47c/c=0-52-1024-631&r=x1683&c=3200x1680/local/-/media/2017/06/19/USATODAY/USATODAY/636335060378267383-KUSHNER-SPEAKS.JPG", "article": "Jared Kushner has spoken. And that's a big deal why?President Trump's son-in-law, the man married to first daughter Ivanka Trump, rarely speaks and seems to never be at the microphone. So when Kushner addressed tech leaders gathered for the inaugural American Technology Council meeting Monday, Twitter went nuts about his first remarks in his role as senior adviser to the president.Is Kushner's voice more James Earl Jones or \"Bar Mitzvah Boy\" from SNL? You be the judge.Here's a sampling from the Twitterverse:Follow Carolyn McAtee Cerbin on Twitter: @carolyncerbinRelated:", "dateOfCollection": "2017-06-20T15:31:28Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Qatar Airways bumped Emirates out of the top spot in the annual Skytrax ratings. Again. Air Canada, Delta named best in North America.", "title": "And the world's new No.1 airline for 2017 is ...", "url": "https://www.usatoday.com/story/travel/flights/todayinthesky/2017/06/20/worlds-best-airlines-skytrax-world-airline-awards/411428001/", "numberOfLinks": 37, "author": null, "publishedAt": "2017-06-20T14:48:03Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/2eb982c167ca45c51e4d4f8ce3eb0ed720ccea89/c=0-12-3541-2013&r=x1683&c=3200x1680/local/-/media/2017/06/20/USATODAY/USATODAY/636335442826919903-10-01.jpg", "article": " Qatar Airways was tabbed as the world's best airline in 2017, according to the annual World Airline Awards published by Skytrax.Qatar’s title continues a back-and-forth battle for No. 1 between it and Gulf rival Emirates, also known for its high-end service and luxurious premium cabins. Emirates finished atop Skytrax’s World Airline Awards last year, when it took the top spot back from Qatar Airways.This year, Emirates dropped to No. 4, placing behind No. 2 Singapore Airlines and No. 3 All Nippon Airways (ANA). Cathay Pacific rounded out the top five of the ratings, which were announced Tuesday on the sidelines of the biennial Paris Air Show.For Qatar Airways, the award comes as a bright spot during what's otherwise been a difficult period for the carrier. The Doha-based airline is one of those affected by a U.S. ban on large carry-on electronics, putting it at a passenger-experience disadvantage against competitors unaffected by the ban.TODAY IN THE SKY: Flights through busy Qatar hub may be hit by diplomatic spat in Middle East | Qatar Airways is world's first airline to get the Airbus A350 (story continues below) And a diplomatic spat between Qatar and nearby Middle East nations has forced it to scrap flights to Egypt, Saudi Arabia and the United Arab Emirates, among others. Also vexing for Qatar Airways is that those nations have closed off their airspaces to flights from Qatar. That's forced many flights from Doha -- where Qatar Airways operates a major hub -- to take circuitous routings to avoid the restrictions.In North America, Air Canada took the title for “Best Airline in North America.” Overall, the carrier placed 29th in the global ratings.Delta was the top ranked U.S. carrier in the World Airline Awards, placing 32nd overall. Virgin America, which had the highest rating among U.S. carriers in 2016, dropped 18 spots to No. 43. That made it fourth among U.S. carriers in the ratings, trailing Delta, Alaska Airlines (No. 36 globally) and JetBlue (No. 39). Alaska Airlines acquired Virgin America in a deal that closed late last year, kicking off a merger that will eventually have both carriers flying under the Alaska Airlines brand.TODAY IN THE SKY: Paris Air Show day 1: A bigger 737, huge Airbus order and the president (story continues below) The Skytrax awards are one of several annual consumer-focused rankings covering the airline industry. Travel + Leisure magazine’s ratings are due out later this summer, when the magazine will reveal if Singapore Airlines has retained its title as the world's top carrier in that list. Emirates was the runner-up in those ratings while Qatar Airways place third.In May, Southwest and JetBlue each won their respective airline categories in the annual J.D. Power customer service satisfaction survey of North American carriers. A month before that, Alaska Airlines edged out Delta for the top spot in another ranking – this one the 2017 Airline Quality Rating report.TODAY IN THE SKY: Alaska Air begins merger with Virgin America, promises 'more to love' | Virgin America name will be phased out in favor of Alaska Air, 'likely' in 2019 (story continues below) As for the Skytrax awards, the win was the fourth overall title for Qatar Airways since the ratings launched in 1999.Skytrax, which explains its rankings methodology here, bills its World Airline Awards as “the world’s largest, annual airline passenger satisfaction survey.” The group says 19.87 million eligible survey entries were counted in the final 2017 results. The survey period stretched from August 2016 through May 2017 and included participation from travelers of 105 nationalities. More than 325 airlines were included in the survey.The top 25 of the Skytrax rankings were:1. Qatar Airways (MORE: Scenes from Qatar Airways' Airbus A350 delivery flight)2. Singapore Airlines (MORE: Singapore Airlines takes delivery of luxurious new 777 | Singapore Airlines shows off its swanky new Airbus A350 in France)3. All Nippon Airways (ANA) (MORE: ANA now flying passengers in planes painted like Star Wars droids | ANA will paint Airbus A380 like a giant sea turtle)4. Emirates (MORE: Emirates shows off its Airbus A380 superjumbo at Washington Dulles)5. Cathay Pacific6. EVA Air (MORE: Trip report and photo tour: Inside EVA's Hello Kitty plane |    EVA Air's Hello Kitty-themed Boeing 777s now flying to Houston | Behind the scenes at a EVA's attendant training center) rankings continue below 7. Lufthansa (MORE: Boeing's 1,500th 747: 'Not your mother's jumbo jet')8. Etihad Airways (MORE: Luxury wars: Etihad rolls out bed-and-bath airline suites)9. Hainan Airlines10. Garuda Indonesia11. Thai Airways12. Turkish Airlines (MORE: Turkish Airlines opens swanky frequent-flier lounge at Dulles airport)13. Virgin Australia14. Swiss International Air Lines (MORE: Swiss Airlines' 'flagship' Boeing 777 now flying to New York | Swiss Air Lines reveals cabin, plans for its new Boeing 777-300ERs)15. Qantas Airways (MORE: Qantas debuts giant Airbus A380 on Sydney-Dallas/Fort Worth flights | Finally, a direct flight from Europe to Australia. Just 17 hours)16. Japan Airlines (JAL)17. Austrian Airlines18. Air France19. Air New Zealand20. Asiana Airlines21. Bangkok Airways22. KLM (MORE: KLM's Dreamliners are now flying to the USA | KLM gives sneak-peek of its Boeing 787 'Dreamliner')23. China Southern24. Hong Kong Airlines25. Finnair Skytrax, a U.K.-based travel consultancy that runs what it calls the \"world's largest review site,\" determines the winners of its annual World Airline Awards from reviews by more than 18 million passengers that represent more than 100 countries. At No. 1 for 2017:  Qatar Airways (Photo: Qatar Airways) ", "dateOfCollection": "2017-06-20T15:31:29Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Trump adviser Steve Bannon reportedly said White House briefings were happening more frequently off-camera because \"Sean got fatter\" — and Chelsea Clinton won't stand for it.", "title": "Chelsea Clinton calls out Steve Bannon for 'fat shaming' Sean Spicer", "url": "https://www.usatoday.com/story/news/politics/onpolitics/2017/06/20/chelsea-clinton-calls-out-steve-bannon-fat-shaming-sean-spicer/411879001/", "numberOfLinks": 12, "author": "Jessica Estepa", "publishedAt": "2017-06-20T14:56:21Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/7ca42f71c333421007a1bcab4a9c5ac17e0d7fbe/c=0-0-3000-1695&r=x1683&c=3200x1680/local/-/media/2017/06/20/USATODAY/USATODAY/636335519660359341-GTY-686857560-91112907.JPG", "article": "Chelsea Clinton, vice chairwoman of the Clinton Foundation, participates in the opening plenary of the Cooperative for Assistance and Relief Everywhere (CARE) 2017 National Conference May 22, 2017 in Washington, D.C. (Photo: Win McNamee, Getty Images)Trump adviser Steve Bannon reportedly said White House briefings were happening off-camera more frequently because \"Sean got fatter\" — and Chelsea Clinton won't stand for it.On Tuesday morning, researcher Brian Klaas tweeted an Atlantic article about the dearth of White House briefings in the Trump administration. His post criticized a detail from the article – that Bannon, via text message to a reporter, explained that White House Press Secretary Sean Spicer's appearance was the reason why.  Clinton retweeted Klaas, attacking the White House.Twitter users quickly pointed out that they believed Bannon was telling a joke, but Clinton stuck by her stance.The White House announced Tuesday morning it would indeed hold a briefing with Spicer on camera later in the afternoon. Will this exchange come up? Time will tell. ", "dateOfCollection": "2017-06-20T15:31:29Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Considering a credit card balance transfer offer? It can help to pay off debt. But how will transferring a balance affect your credit score? And what are the potential pitfalls?", "title": "Juggling debt: How transferring a balance affects your credit score", "url": "http://blog.credit.com/2017/06/how-transferring-a-balance-affects-your-credit-score-174097/", "numberOfLinks": 25, "author": "Abby Hayes", "publishedAt": "2017-06-20T11:03:11Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/7750deab62b532dcd7abace56875ad4690362806/c=11-71-2118-1262&r=x1683&c=3200x1680/local/-/media/2017/06/05/USATODAY/USATODAY/636322760860852275-GettyImages-627196720.jpg", "article": "Thinking of taking advantage of a balance transfer offer? It can be an excellent way to pay off your debt. But how will transferring a balance affect your credit score? And of what potential pitfalls should you be aware?It’s impossible to predict exactly how any one financial decision will affect your credit score. We can guess based on what we know about credit-scoring algorithms, and credit score simulators are can show you how a particular choice might affect your score. But so many factors influence your score that an exact effect is difficult to predict.With that said, we can look at two areas of your credit score a balance transfer will most likely impact: your credit utilization and new credit inquiries.Your credit utilization, or debt-to-credit ratio, is the second most important piece of your credit score, behind your payment history. It’s essentially a measure of how much you owe versus how much credit you have available.Say, for instance, you owe $1,000 on a card with a $2,000 limit. In this case, your debt-to-credit ratio is 50%. (You can see how your debt is impacting your credit by viewing two of your scores for free on Credit.com.)If you’re approved for a new credit card with a balance transfer offer, you’ll wind up with a higher overall credit limit. This could be a good thing, since it will push your debt-to-credit ratio lower.In the above example, if you’re approved for a new card with a $1,000 limit, your total credit limit will be $3,000. As long as you don’t accrue more debt, your total debt-to-credit ratio will be about 33%. Since that’s better than 50%, your credit score should be fine. Plus, with a lower interest rate, you can presumably pay off the debt quicker. As your debt decreases, so will your debt-to-credit ratio, which means your credit score will climb.A balance transfer’s effect on your credit score isn’t all good. To open a new credit card, the card issuer will pull your credit score, which will most likely add an inquiry to your credit file and cause a small but temporary decrease in your score. The impact won’t likely be large unless you apply for several balance transfer cards at once.A balance transfer card can be good in some circumstances, but it has potential drawbacks. Here’s what to avoid if you opt for a balance transfer:Taking on More Debt If you’re already dealing with credit card debt because of your spending habits, a balance transfer may be the wrong choice. Opening a new credit card gives you access to more credit, and with that access can come the temptation to spend. If you’re likely to reach your credit limits, a balance transfer card may not be for you.Paying Too Much in Balance Transfer FeesMost balance transfer cards come with a one-time fee. This fee may be worth it if it gets you out of paying loads of interest every month. But it might also cost more than you’re willing to pay. Be sure you know what the fee is upfront.Maxing Out a Credit CardScoring algorithms like FICO’s look at both your overall credit utilization and your per-card credit utilization. So maxing out a balance transfer card to take full advantage of a low- or no-interest offer may negatively affect your credit score, even if opening the new card decreases your overall debt-to-credit ratio.Is a balance transfer right for you? If transferring a balance helps you save money and pay off debt faster, it’s most likely the right choice. Just be careful if you’re preparing to apply for a larger loan, like a mortgage. Even a small ding at the wrong time can hurt you. Still, transferring a balance and efficiently paying off debt will have great consequences for your credit score over the long term.Image: Geber86Sign up for our Credit Report Card and receive the latest tips & advice from our team of 50+ credit and money experts as well as a FREE Credit Score and action plan. Sign up now.Note: It's important to remember that interest rates, fees and terms for credit cards, loans and other financial products frequently change. As a result, rates, fees and terms for credit cards, loans and other financial products cited in these articles may have changed since the date of publication. Please be sure to verify current rates, fees and terms with credit card issuers, banks or other financial institutions directly.Abby Hayes is a freelance blogger and journalist who writes for personal finance blog The Dough Roller and contributes to Dough Roller's weekly newsletter.Certain credit cards and other financial products mentioned in this and other sponsored content on Credit.com are Partners with Credit.com. Credit.com receives compensation if our users apply for and ultimately sign up for any financial products or cards offered.Hello, Reader!\n\r\nThanks for checking out Credit.com. We hope you find the site and the journalism we produce useful. We wanted to take some time to tell you a bit about ourselves.\n\nOur People\n\r\nThe Credit.com editorial team is staffed by a team of editors and reporters, each with many years of financial reporting experience. We’ve worked for places like the New York Times, American Banker, Frontline, TheStreet.com, Business Insider, ABC News, NBC News, CNBC and many others. We also employ a few freelancers and more than 50 contributors (these are typically subject matter experts from the worlds of finance, academia, politics, business and elsewhere). \n\nOur Reporting\n\r\nWe take great pains to ensure that the articles, video and graphics you see on Credit.com are thoroughly reported and fact-checked. Each story is read by two separate editors, and we adhere to the highest editorial standards. We’re not perfect, however, and if you see something that you think is wrong, please email us at editorial team [at] credit [dot] com, \n\r\nThe Credit.com editorial team is committed to providing our readers and viewers with sound, well-reported and understandable information designed to inform and empower. We won’t tell you what to do. We will, however, do our best to explain the consequences of various actions, thereby arming you with the information you need to make decisions that are in your best interests. We also write about things relating to money and finance we think are interesting and want to share.\n\r\nIn addition to appearing on Credit.com, our articles are syndicated to dozens of other news sites. We have more than 100 partners, including MSN, ABC News, CBS News, Yahoo, Marketwatch, Scripps, Money Magazine and many others. This network operates similarly to the Associated Press or Reuters, except we focus almost exclusively on issues relating to personal finance. These are not advertorial or paid placements, rather we provide these articles to our partners in most cases for free. These relationships create more awareness of Credit.com in general and they result in more traffic to us as well.\n\nOur Business Model\n\r\nCredit.com’s journalism is largely supported by an  e-commerce business model. Rather than rely on revenue from display ad impressions, Credit.com maintains a financial marketplace separate from its editorial pages. When someone navigates to those pages, and applies for a credit card, for example, Credit.com will get paid what is essentially a finder’s fee if that person ends up getting the card. That doesn’t mean, however, that our editorial decisions are informed by the products available in our marketplace. The editorial team chooses what to write about and how to write about it independently of the decisions and priorities of the business side of the company. In fact, we maintain a strict and important firewall between the editorial and business departments. Our mission as journalists is to serve the reader, not the advertiser. In that sense, we are no different from any other news organization that is supported by ad revenue.\n\r\nVisitors to Credit.com are also able to register for a free Credit.com account, which gives them access to a tool called The Credit Report Card. This tool provides users with two free credit scores and a breakdown of the information in their Experian credit report, updated twice monthly. Again, this tool is entirely free, and we mention that frequently in our articles, because we think that it’s a good thing for users to have access to data like this. Separate from its educational value, there is also a business angle to the Credit Report Card. Registered users can be matched with products and services for which they are most likely to qualify. In other words, if you register and you find that your credit is less than stellar, Credit.com won’t recommend a high-end platinum credit card that requires an excellent credit score You’d likely get rejected, and that’s no good for you or Credit.com. You’d be no closer to getting a product you need, there’d be a wasted inquiry on your credit report, and Credit.com wouldn’t get paid. These are essentially what are commonly referred to as \"targeted ads\" in the world of the Internet. Despite all of this, however, even if you never apply for any product, the Credit Report Card will remain free, and none of this will impact how the editorial team reports on credit and credit scores.\n\nOur Owners\n\r\nCredit.com is owned by Progrexion Holdings Inc. which is the owner and administrator of a number of business related to credit and credit repair, including CreditRepair.com, and eFolks. In addition, Progrexion also provides services to Lexington Law Firm as a third party provider. Despite being owned by Progrexion, it is not the role of the Credit.com editorial team to advocate the use of the company’s other services. In articles, reporters may mention credit repair as an option, for example, but we’ll also be sure to note the various alternatives to that service. Furthermore, you may see ads for credit repair services on Credit.com, but the editorial team isn’t responsible for the creation or implementation of those ads, anymore than reporters for the New York Times or Washington Post are responsible for the ads on their sites.\n\nYour Stories\n\r\nLastly, much of what we do is informed by our own experiences as well as the experiences of our readers. We want to tell your stories if you’re interested in sharing them. Please email us at story ideas [at] credit [dot] com with ideas or visit us on Facebook or Twitter.\n\r\nThanks for stopping by.\n\r\n- The Credit.com Editorial Team\n", "dateOfCollection": "2017-06-20T15:31:30Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "The Minnesota Timberwolves will have a Fitbit patch on their jerseys this season as part of new partnership.", "title": "Timberwolves partner with Fitbit for patch deal", "url": "https://www.usatoday.com/story/sports/nba/twolves/2017/06/20/minnesota-timberwolves-partner-fitbit-patch-deal/411143001/", "numberOfLinks": 3, "author": "Kevin Spain", "publishedAt": "2017-06-20T13:12:44Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/ee2e2c9204a2353cb11c78c8064f8e66932e8e3a/c=0-2562-3229-4386&r=x1683&c=3200x1680/local/-/media/2017/06/19/USATODAY/USATODAY/636335101080749203-USP-NBA--Minnesota-Timberwolves-Press-Conference.jpg", "article": " When NBA owners voted to allow teams to add patches to their jerseys for advertisement, it opened the door for creative partnerships.The Minnesota Timberwolves announced a jersey patch deal with Fitbit on Tuesday, and the team hopes the partnership becomes something that players, the team office and even fans will participate in.Fitbit will provide the Timberwolves, the Minnesota Lynx and the Iowa Wolves of the G-League access to devices. The Fitbit logo will appear on Timberwolves and Wolves jerseys. The patch will be unveiled with new uniforms coming out before the season. \"This is so much bigger and so much broader of a relationship than just the exposure and the brand association with our jerseys, our players, our team,\"  Timberwolves CEO Ethan Casson told USA TODAY Sports. \"This is fully integrated, and this involves lots of different platforms that we’re excited to work on together.\"The team and Fitbit are working to integrate concessions menus into the food-logging sections of the app, so fans will be able to get information on the food they purchase at games.   ", "dateOfCollection": "2017-06-20T15:31:30Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "The current track takes the storm into southwest Louisiana on Wednesday night.", "title": "Tropical storm warnings posted for Gulf Coast", "url": "https://www.usatoday.com/story/weather/2017/06/20/tropical-storm-warnings-posted-gulf-coast/103030616/", "numberOfLinks": 2, "author": "Doyle Rice", "publishedAt": "2017-06-20T13:56:18Z", "urlToImage": "https://www.gannett-cdn.com/-mm-/a910bc2a2854323d2b1ccbe7ba2cb193d10f9bbc/c=63-89-837-526&r=x1683&c=3200x1680/local/-/media/2017/06/20/USATODAY/USATODAY/636335413409014247-085855-5day-cone-with-line-and-wind.png", "article": "Tropical storm warnings have been posted along the Louisiana coast for a developing system now in the Gulf of Mexico.The system is labeled Potential Tropical Cyclone Three, which is a new designation from the National Hurricane Center for systems that have not developed yet, but that will likely bring tropical storm impacts soon.If the system's sustained winds reach 39 mph, it will be named Tropical Storm Cindy. It could be come a tropical storm later Tuesday.The current track takes it into southwest Louisiana on Wednesday night.The system is \"expected to produce total rain accumulations of 4 to 8 inches with isolated maximum amounts of 10 inches over southeastern Louisiana, southern Mississippi southern Alabama and the Florida Panhandle through Thursday morning,\" the hurricane center said.Flooding is also a significant concern, the Weather Channel said.Storm surge inundations of 1 to 3 feet are also possible along the coast. Gusty winds are also expected, and a tornado or two could also spin up.A second storm, Tropical Storm Bret, is now near the coast of South America near Trinidad and Tobago. The current track from the hurricane center takes it west/northwest into the Caribbean Sea. Once it reaches the Caribbean midweek, it should encounter wind shear that will weaken it. The system may dissipate by Thursday.Bret has become the earliest named storm to form in this part of the Atlantic since official records were kept in 1851, AccuWeather said.Contributing: WWL-TV, New Orleans", "dateOfCollection": "2017-06-20T15:31:30Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Inmates rushed to save a correctional officer who passed out from the heat.", "title": "Prisoners save passed out supervisor", "url": "https://www.usatoday.com/videos/news/humankind/2017/06/20/prisoners-save-passed-out-supervisor/103034980/", "numberOfLinks": 1, "author": "USA TODAY", "publishedAt": "2017-06-20T15:21:13+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/8053d91dc9a2258a0283ca7a3f06eb1e3cc2b513/r=x1803&c=3200x1800/https/videos.usatoday.net/Brightcove3/29906170001/201706/3058/29906170001_5477621061001_5477616453001-vs.jpg?pubId=29906170001", "article": "", "dateOfCollection": "2017-06-20T15:31:31Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Pence waves as he arrives in Miami on June 16, 2017, where President Trump announced a new Cuba policy.", "title": "Get to know the VP: A look at Mike Pence", "url": "http://www.usatoday.com/picture-gallery/news/politics/elections/2016/07/14/get-to-know-the-vp-a-look-at-mike-pence/86796856/", "numberOfLinks": 1, "author": null, "publishedAt": "2016-07-07T14:20:33+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/4a78210ffee3c89d0ee80f3c7476499082bde8ad/c=0-0-5465-3088&r=x1683&c=3200x1680/local/-/media/2017/06/20/USATODAY/USATODAY/636335539638627406-AP-Trump.jpg", "article": "", "dateOfCollection": "2017-06-20T15:31:31Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Sam Talavera Jr. ends his 19 hour day at 1 a.m. by parking on the side of a road. A USA TODAY Network investigation found a predatory scheme that ensnared thousands of immigrant truck drivers at the port. Thousands of drivers work up to 20 hours a day, sometimes for pennies. When they can't work, trucking companies fire them and take their pay.", "title": "Trucking companies prey on their own workers", "url": "http://www.usatoday.com/picture-gallery/news/investigations/2017/06/20/trucking-companies-prey-on-their-own-workers/103033308/", "numberOfLinks": 1, "author": null, "publishedAt": "2017-06-20T14:38:58+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/56e31254d01a4a9b31b6f67212ddc47caa82dfa3/c=0-195-3840-2364&r=x1683&c=3200x1680/local/-/media/2017/06/20/USATODAY/USATODAY/636335540413442213-Sam-Talavera-01.JPG", "article": "", "dateOfCollection": "2017-06-20T15:31:31Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Conway talks with press secretary Sean Spicer in the Roosevelt Room of the White House on June 15, 2017.", "title": "A look at Kellyanne Conway, counselor to the president", "url": "http://www.usatoday.com/picture-gallery/news/politics/2017/01/09/a-look-at-kellyanne-conway-counselor-to-the-president/96340072/", "numberOfLinks": 1, "author": null, "publishedAt": "2017-01-09T14:56:23+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/3dcb4aae15d2d31aff15796fc3e59d6352453ba2/c=0-0-3670-2073&r=x1683&c=3200x1680/local/-/media/2017/06/20/USATODAY/USATODAY/636335541432014902-AP-Trump.1.jpg", "article": "", "dateOfCollection": "2017-06-20T15:31:31Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Voters will select either Republican Karen Handel or Democrat Jon Ossoff in the tight, hard-fought race to replace Tom Price in Georgia’s 6th Congressional District. The race is seen by many as a significant test for the Trump administration. (June 20)", "title": "Voters Head to Polls in Ga. Congressional Race", "url": "https://www.usatoday.com/videos/news/nation/2017/06/20/voters-head-polls-ga.-congressional-race/103033872/", "numberOfLinks": 1, "author": "AP", "publishedAt": "2017-06-20T14:49:54+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/8053d91dc9a2258a0283ca7a3f06eb1e3cc2b513/r=x1803&c=3200x1800/https/videos.usatoday.net/Brightcove3/29906170001/201706/2378/29906170001_5477591568001_5477575170001-vs.jpg?pubId=29906170001", "article": "", "dateOfCollection": "2017-06-20T15:31:32Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "A butter shortage in France is causing bakery prices to rise, and could see a shortage in the beloved croissant. TC Newman says don't panic!", "title": "Don't panic! But we could be having a croissant crisis", "url": "https://www.usatoday.com/videos/news/world/2017/06/20/dont-panic-but-we-could-having-croissant-crisis/103034390/", "numberOfLinks": 1, "author": "Buzz60", "publishedAt": "2017-06-20T15:05:01+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/8053d91dc9a2258a0283ca7a3f06eb1e3cc2b513/r=x1803&c=3200x1800/https/videos.usatoday.net/Brightcove3/29906170001/201706/298/29906170001_5477603679001_5477597774001-vs.jpg?pubId=29906170001", "article": "", "dateOfCollection": "2017-06-20T15:31:32Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "The Trumps watch as Panamanian President Juan Carlos Varela and his wife, Lorena Castillo, depart the White House on June 19, 2017.", "title": "The Trump presidency: A new era in Washington", "url": "http://www.usatoday.com/picture-gallery/news/politics/2017/01/21/the-trump-presidency-a-new-era-in-washington/96879374/", "numberOfLinks": 1, "author": null, "publishedAt": "2017-01-21T15:42:35+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/d6bab063244dec9c226e7552b4df0591267ebbd6/c=0-85-2605-1557&r=x1683&c=3200x1680/local/-/media/2017/06/20/USATODAY/USATODAY/636335536958218224-AP-Trump-US-Panama.jpg", "article": "", "dateOfCollection": "2017-06-20T15:31:36Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Canada has introduced a $2 coin  that glows in the dark.\r\nVideo provided by Newsy", "title": "Canadian money just got so much cooler", "url": "https://www.usatoday.com/videos/money/2017/06/20/canadian-money-just-got-so-much-cooler/103034024/", "numberOfLinks": 1, "author": "Newslook", "publishedAt": "2017-06-20T14:55:01+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/8053d91dc9a2258a0283ca7a3f06eb1e3cc2b513/r=x1803&c=3200x1800/https/videos.usatoday.net/Brightcove3/29906170001/201706/3122/29906170001_5477592502001_5477583649001-vs.jpg?pubId=29906170001", "article": "", "dateOfCollection": "2017-06-20T15:31:36Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "Armed security guards at Des Moines Water Works Park last month left an Iowa man with three bullet holes in the radiator of his SUV .", "title": "Park security guards fire multiple shots into SUV driving past curfew in Des Moines", "url": "http://www.desmoinesregister.com/story/news/local/2017/06/20/security-guards-shoot-suv-water-works-park-past-curfew/399724001", "numberOfLinks": 3, "author": "Kim Norvell", "publishedAt": "2017-06-20T19:03:07+00:00", "urlToImage": "https://www.gannett-cdn.com/-mm-/f1c5b16514ad9b70833fe694761c80da12c200bc/c=0-205-534-507&r=x1683&c=3200x1680/local/-/media/2017/06/20/USATODAY/USATODAY/636335517901760068-SUV.jpg", "article": "An early morning run-in with security guards at Des Moines Water Works Park last month left a central Iowa man with three bullet holes in the radiator of his SUV and a concern for others visiting the park.  Scott Richardson, 50, spent May 13 riding bikes with friends. The group stopped at a downtown bar and restaurant before Richardson returned to Water Works Park at about 1 a.m., three hours after the park had closed. He loaded his bike onto his 2013 Jeep Wrangler and headed toward the exit.That's when a car with flashing amber-colored lights pulled in behind him. When Richardson didn't stop, the car pulled around him and blocked the exit. Two security guards got out of the vehicle.One of the men fired three rounds from a 9mm handgun into Richardson's engine.The guards from On Point Security Group, a private company based in Clive, later told police they wanted to stop Richardson to tell him the park was closed and his vehicle could have been towed. Richardson was arrested by police for operating while intoxicated.A Des Moines Police Department spokesman called the shooting questionable, but no charges were filed against the shooter.  Police have forwarded the case to the Polk County attorney, who will decide whether to file charges.  \"I don't know if we have overzealous mall cops taking matters into their own hands, but all indications are that’s exactly what we’re dealing with in this situation,\" said Brad Schroeder, a Des Moines attorney representing Richardson. \"And it should scare the heck out of everybody.\"Richardson, of Norwalk, told the Register the guards \"tailgated\" his car with their amber lights flashing for about a half mile. He said he did not stop because he assumed it was security — and not law enforcement — \"making sure that I exited the park.\" He knew he was approaching a gate that had a sensor to open it, so he continued driving.Once guards pulled around him and parked sideways across the road, Richardson said he slowed down and stopped.\"All of a sudden I heard the 'boom, boom, boom,'\" he said. \"It was so unexpected.\"Material used to absorb liquid on pavement is seen at the site where Scott Richardson's vehicle was shot at by private security guards hired to patrol Des Moines Water Works Park. His attorney says the markings prove he was stopped when the bullets struck his radiator, leaking fluid. (Photo: Special to the Register)Both security guards told police that Richardson \"kept coming toward them.\" Peter Berger, an attorney representing On Point, said the guards reported that Richardson was \"driving out of control.\" Richardson disputes that he was driving fast or erratically, and said he had come to a complete stop before the shots were fired into his car. The police report makes no mention of his driving style.\"That was so unexpected because I hadn't done anything I felt to deserve being shot at,\" he said. \"I guess I didn't assume anybody would be shooting a live round. Something could go terribly wrong, you know?\"Richardson was not injured. The bullets struck his radiator, transmission cooler, air conditioning condenser and the heater hose, he said. His car has been out of commission for five weeks.After shooting his vehicle, Richardson said the security guard pointed a gun in his face and yelled at him to put his hand up. The guard then took him out of his car placed him in handcuffs. Three bullets, fired by a private security guard hired to patrol Des Moines Water Works Park, struck the front of Scott Richardson's SUV. (Photo: Special to the Register)The security guards involved in the incident could not be reached for comment. The Register is not naming them because they have not been charged with a crime.But Berger, the attorney representing On Point, said the security guards feared for their lives as Richardson was driving toward them and the locked exit. Plus, Richardson was trespassing in the park after hours, he said.\"The driver of the vehicle was not complying with commands to stop, both when the security vehicle was behind and in front of it. And when the driver of the vehicle posed a significant safety hazard to both security guards and Des Moines Water Works, one of the weapons was discharged as a warning and struck the vehicle,\" Berger said. \"It ultimately got the driver’s attention.\"Des Moines police arrived on scene within minutes of the shooting. The investigation report shows police seized both security guards' 9mm handguns and three spent shell casings. Scott Richardson (Photo: Special to the Register)A preliminary breath test taken on scene showed Richardson's blood alcohol content at .106. He registered .088 on a second breath test taken an hour later. The legal limit to operate a motor vehicle in Iowa is .08. Schroeder said his client's level of intoxication \"played no part\" in justifying the security guards' actions. He said Richardson was \"peaceably\" leaving the park when his vehicle was shot.\"Who in their right mind — when they’re trying to get somebody to leave a place and the person is doing so — decides that it would be helpful to shoot at them to expedite their departure?\" he said. \"I have no idea what they were hoping to accomplish in shooting at him.\"Sgt. Paul Parizek, spokesman for the Des Moines Police Department, said Richardson was under no obligation to stop for the security guards as they attempted to pull him over.Flashing amber lights, which were used on On Point's vehicle that night, are meant to serve as a warning, he said. The Iowa State Patrol recommends drivers wait to pull over for emergency vehicles until they reach a public, well-lit area if they \"question whether the person is actually an officer,\" according to a brochure posted on its website.\"Everybody knows what the red and blue lights mean, that it's law enforcement and pull over. I didn't know that the amber light was wanting me to pull over,\" Richardson said. \"I had a good assumption it was park security, but I didn't know that. And I was in the darkest part of the park.\"Parizek said he could not comment on more than the immediate facts and circumstances surrounding the case, but he said state law does allow for shots to be fired when a person believes his or her life is in danger. A motor vehicle could be considered a dangerous weapon under Iowa law.But Parizek added he's unsure whether this situation warranted that level of force. \"It appears there was some questionable tactics involved,\" he said. \"We train to avoid these types of situations. I'm not sure if there would have been a similar outcome if Des Moines police were involved.\" Bill Stowe, general manager of Des Moines Water Works, declined to comment on specifics of the shooting incident. Water Works Park, 2201 George Flagg Parkway, is owned and maintained by the water utility. \"I'm certainly concerned that anyone would try to evade a security officer and potentially run them over,\" Stowe said. \" ... We're always very disappointed when visitors to our park  fail to abide by the reasonable requests of our security staff.\"Des Moines Water Works has contracted with a private security firm for years, but security guards were not armed until 2014.\"We run a water plant, we're not making toothpaste or brick pavers, so certainly there are significant security concerns in making sure our water treatment facility and our processes are safe from any intrusions,\" said Stowe, who recommended arming security guards. \"We take our security very seriously.\"The Department of Homeland Security lists water systems as potential targets for terrorist attacks.It wasn't until 2016 that On Point security guards began patrolling the 1,500-acre Water Works Park on the southern edge of downtown. Berger said the patrols were added to monitor \"ongoing vandalism\" at the park. Des Moines Water Works has a five-year contract with On Point that pays the company $204,150 a year. On Point provides 24/7 armed security at the Fleur Drive plant and Water Works Park. It also conducts nightly checks at the utility's Saylorville and Maffitt Reservoir treatment facilities. Earlier this year, Water Works added an armed guard at its office, 2201 George Flagg Parkway, where there is a customer service counter. That costs an additional $57,000 a year.Both security guards involved in the May 14 incident are licensed by the Iowa Department of Public Safety, which issues employee identification cards for private security companies.Two-year licenses are issued to individuals who are at least 18 years old and have not been convicted of a felony, aggravated misdemeanor or illegally using, carrying or possessing a dangerous weapon. License holders cannot be addicted to drugs or alcohol and should be “of good moral character.”Both security guards involved in the shooting are still employed by On Point, Berger said. Gray's Lake Park, a popular city-owned park, is located directly across Fleur Drive from Water Works Park. The city contracts with the Des Moines Police Department to provide security there, said Jen Fletcher, marketing supervisor for the parks department.  Scott Richardson stands for a portrait at the office of his attorney, Brad Schroeder, on Monday, June 19, 2017. (Photo: Zach Boyden-Holmes/The Register)Though Richardson was unharmed physically, there are some mental scars to overcome. He has not returned to Water Works Park since the incident. \"It was shocking,\" he said. \"It was a traumatic experience to have a gun pointed at me when all I was doing was exiting the park at 20 miles per hour.\"Richardson, a self-described cycling enthusiast, said he commuted by bicycle to work 114 days last year. The 19-mile route sometimes took him through Water Works Park. He still commutes by bike today, but said he will likely avoid using Water Works Park trails. He is considering filing a civil lawsuit. \"Mostly I think about how bad it could have turned out or what could happen worse for the next person,\" he said. \"Something could end much more badly for somebody else.\"", "dateOfCollection": "2017-06-20T15:31:43Z"}, {"publisher": "usa-today", "media_urls": "", "labels": ["credible_urls"], "description": "View videos and photo galleries from USA TODAY", "title": "Julia Stiles - I&#39;d like to be in &#39;Fleabag&#39;", "url": "http://www.usatoday.com/videos/news/nation/2017/06/20/julia-stiles-i&#39;d-like-&#39;fleabag&#39;/103034022/", "numberOfLinks": 0, "author": null, "publishedAt": null, "urlToImage": null, "article": "", "dateOfCollection": "2017-06-20T15:31:47Z"}]